{
    "cards": [
        {
            "colorIdentity": [],
            "colors": [],
            "manaCost": "{2}",
            "name": "Chaos Orb",
            "number": "1",
            "reserved": true,
            "rulings": [
                {
                    "date": "2018-06-25",
                    "text": "I have applied functional errata to this card in order to make it work more reasonably in our games. It is no longer a dexterity card. For the official text and rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [],
            "supertypes": [],
            "text": "{1}, {T}, Sacrifice Chaos Orb: For each nontoken permanent, flip a coin. Then destroy all permanents whose coin came up tails.",
            "type": "Artifact",
            "types": [
                "Artifact"
            ]
        },
        {
            "colorIdentity": [
                "B"
            ],
            "colors": [
                "B"
            ],
            "manaCost": "{X}{1}{B}",
            "name": "Drain Life",
            "number": "2",
            "rulings": [
                {
                    "date": "2004-10-04",
                    "text": "Cost reducers can be used to reduce the X part of the mana cost."
                },
                {
                    "date": "2004-10-04",
                    "text": "You may gain up to the total toughness of the creature even if it was already damaged."
                },
                {
                    "date": "2018-08-31",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [],
            "supertypes": [],
            "text": "Spend only black mana on X.\nDrain Life deals X damage to any target. You gain life equal to the damage dealt, but not more life than the player's life total before the damage was dealt, the planeswalker's loyalty before the damage was dealt, the Structure's stability before the damage was dealt, or the creature's toughness.",
            "type": "Sorcery",
            "types": [
                "Sorcery"
            ]
        },
        {
            "colorIdentity": [
                "G"
            ],
            "colors": [
                "Green"
            ],
            "manaCost": "{3}{G}{G}",
            "name": "Elvish Bard",
            "number": "3",
            "power": "2",
            "rulings": [
                {
                    "date": "2019-02-15",
                    "text": "I have applied functional errata to this card: it is now a Bard. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Elf",
                "Shaman",
                "Bard"
            ],
            "supertypes": [],
            "text": "All creatures able to block Elvish Bard do so.",
            "toughness": "4",
            "type": "Creature — Elf Shaman Bard",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "R"
            ],
            "colors": [
                "R"
            ],
            "manaCost": "{2}{R}",
            "name": "Falling Star",
            "number": "4",
            "reserved": true,
            "rulings": [
                {
                    "date": "2018-06-25",
                    "text": "I have applied functional errata to this card in order to make it work more reasonably in our games. It is no longer a dexterity card. For the official text and rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [],
            "supertypes": [],
            "text": "For each creature on the battlefield, flip a coin. Then Falling Star deals 3 damage to each creature whose coin came up tails. Tap all creatures dealt damage by Falling Star.",
            "type": "Sorcery",
            "types": [
                "Sorcery"
            ]
        },
        {
            "colorIdentity": [
                "R"
            ],
            "colors": [
                "R"
            ],
            "manaCost": "{2}{R}{R}",
            "name": "Hellrider",
            "number": "5",
            "power": "3",
            "rulings": [
                {
                    "date": "2017-03-14",
                    "text": "Creatures you control may attack multiple players and/or planeswalkers. For each attacking creature, Hellrider will deal damage to the corresponding player or planeswalker."
                },
                {
                    "date": "2019-06-09",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Devil"
            ],
            "supertypes": [],
            "text": "Haste\nWhenever a creature you control attacks, Hellrider deals 1 damage to the player, planeswalker, or Structure it's attacking.",
            "toughness": "3",
            "type": "Creature — Devil",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "G"
            ],
            "colors": [
                "G"
            ],
            "manaCost": "{3}{G}",
            "name": "Joraga Bard",
            "number": "6",
            "power": "1",
            "rulings": [
                {
                    "date": "2009-10-01",
                    "text": "The ability affects only Allies you control at the time the ability resolves."
                },
                {
                    "date": "2019-03-29",
                    "text": "I have applied functional errata to this card: it is now a Bard. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Elf",
                "Rogue",
                "Bard",
                "Ally"
            ],
            "supertypes": [],
            "text": "Whenever Joraga Bard or another Ally enters the battlefield under your control, you may have Ally creatures you control gain vigilance until end of turn.",
            "toughness": "4",
            "type": "Creature — Elf Rogue Bard Ally",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "R",
                "G"
            ],
            "colors": [
                "R",
                "G"
            ],
            "manaCost": "{1}{R}{G}",
            "name": "Mage Slayer",
            "number": "7",
            "rulings": [
                {
                    "date": "2009-05-01",
                    "text": "This ability triggers and resolves in the declare attackers step. The creature will still deal its combat damage as normal later on during the combat phase."
                },
                {
                    "date": "2009-05-01",
                    "text": "When the equipped creature attacks, the first ability will trigger. When that ability resolves, that creature will deal damage equal to its power to player, planeswalker, or Structure it's attacking, even if Mage Slayer has left the battlefield or is equipping a different creature by that time."
                },
                {
                    "date": "2019-06-09",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Equipment"
            ],
            "supertypes": [],
            "text": "Whenever equipped creature attacks, it deals damage equal to its power to the player, planeswalker, or Structure it's attacking.\nEquip {3}",
            "type": "Artifact — Equipment",
            "types": [
                "Artifact"
            ]
        },
        {
            "colorIdentity": [],
            "colors": [],
            "manaCost": "{7}",
            "name": "Myr Battlesphere",
            "number": "8",
            "power": "4",
            "rulings": [
                {
                    "date": "2011-01-01",
                    "text": "You choose the value for X as the last ability resolves. You can't choose a value for X that's greater than the number of untapped Myr you control."
                },
                {
                    "date": "2011-01-01",
                    "text": "You can tap any untapped Myr you control as the last ability resolves, not just the Myr tokens you put onto the battlefield with the first ability. This includes Myr that haven't been under your control since your most recent turn began."
                },
                {
                    "date": "2011-01-01",
                    "text": "As the last ability resolves, you can tap untapped Myr you control even if Myr Battlesphere is no longer on the battlefield by then. If that has happened, Myr Battlesphere won't be able to get the +X/+0 bonus, but it will still deal X damage to the player, planeswalker, or Structure it's attacking."
                },
                {
                    "date": "2019-06-09",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Myr",
                "Construct"
            ],
            "supertypes": [],
            "text": "When Myr Battlesphere enters the battlefield, create four 1/1 colorless Myr artifact creature tokens.\nWhenever Myr Battlesphere attacks, you may tap X untapped Myr you control. If you do, Myr Battlesphere gets +X/+0 until end of turn and deals X damage to the player, planeswalker, or Structure it's attacking.",
            "toughness": "7",
            "type": "Artifact Creature — Myr Construct",
            "types": [
                "Artifact",
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "U"
            ],
            "colors": [
                "U"
            ],
            "manaCost": "{2}{U}",
            "name": "Portal Mage",
            "number": "9",
            "power": "2",
            "rulings": [
                {
                    "date": "2017-08-25",
                    "text": "You may cast Portal Mage outside of a declare attackers step. If Portal Mage enters the battlefield outside of a declare attackers step, its ability simply doesn't trigger."
                },
                {
                    "date": "2017-08-25",
                    "text": "Reselecting which player or planeswalker a creature is attacking ignores all requirements, restrictions, and costs associated with attacking."
                },
                {
                    "date": "2017-08-25",
                    "text": "Reselecting which player or planeswalker a creature is attacking doesn't cause \"whenever this creature attacks\" abilities to trigger. Notably, the Curses in this set (such as Curse of Vitality) won't trigger while Portal Mage's ability is resolving."
                },
                {
                    "date": "2017-08-25",
                    "text": "If you reselect which player or planeswalker an attacking creature is attacking, that creature is still considered to have attacked the player or planeswalker as declared, but it is now attacking the new player or planeswalker."
                },
                {
                    "date": "2017-08-25",
                    "text": "If an ability targets something controlled by the \"defending player\" of an attacking creature and the defending player for that creature changes before that ability resolves, the ability won't resolve because its target has become illegal."
                },
                {
                    "date": "2018-08-27",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Human",
                "Wizard"
            ],
            "supertypes": [],
            "text": "Flash\nWhen Portal Mage enters the battlefield during the declare attackers step, you may reselect which player, planeswalker, or Structure target attacking creature is attacking. (It can't attack its controller or its controller's planeswalkers or Structures.)",
            "toughness": "2",
            "type": "Creature — Human Wizard",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "B",
                "R"
            ],
            "colors": [
                "B",
                "R"
            ],
            "manaCost": "{1}{B}{R}",
            "name": "Rakdos Roustabout",
            "number": "10",
            "power": "3",
            "rulings": [
                {
                    "date": "2019-01-25",
                    "text": "An ability that triggers when a creature becomes blocked triggers only once if two or more creatures block it."
                },
                {
                    "date": "2019-06-09",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Ogre",
                "Warrior"
            ],
            "supertypes": [],
            "text": "Whenever Rakdos Roustabout becomes blocked, it deals 1 damage to the player, planeswalker, or Structure it's attacking.",
            "toughness": "2",
            "type": "Creature — Ogre Warrior",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "U"
            ],
            "colors": [
                "U"
            ],
            "manaCost": "{3}{U}{U}",
            "name": "Richard Garfield, Ph.D.",
            "number": "11",
            "power": "2",
            "rulings": [
                {
                    "date": "2018-07-05",
                    "text": "As part of the Bracket Cube project, I have applied functional errata to this card to make it work in black-border rules. —Fenhl"
                },
                {
                    "date": "2018-07-05",
                    "text": "When choosing a card name, the card must be legal in the format. In the Bracket Cube format, all cards that were first printed in 2016 or earlier are legal, with the exception of nonstandard cards (planes, phenomena, schemes, vanguards, and conspiracies), ante cards, and uncards other than Richard Garfield, Ph.D."
                },
                {
                    "date": "2018-07-05",
                    "text": "Casting a spell using Garfield's ability creates a copy effect. The copy effect is applied before any other decisions made during the casting process. It ends once it leaves the battlefield, or moves from the stack to a zone other than the battlefield."
                },
                {
                    "date": "2018-07-05",
                    "text": "Playing a land using Garfield's ability also creates a copy effect. The card enters the battlefield as a copy of the chosen land card. The choice of which land card, if any, to copy is made as part of playing the land. If no legal choice can be made, the game returns to the moment before the player started to play the land."
                },
                {
                    "date": "2018-07-05",
                    "text": "A nonland card without a mana cost can be played as a land this way."
                },
                {
                    "date": "2018-07-05",
                    "text": "You cannot choose the back face of a double-faced or meld card, or the flipped version of a flip card this way."
                },
                {
                    "date": "2018-07-05",
                    "text": "If you use Garfield's ability on a split card, you must choose a card with a mana cost equal to the combined mana cost of both halves."
                },
                {
                    "date": "2018-07-05",
                    "text": "If you name a split card using Garfield's ability, the combined mana cost of both halves must be equal to the mana cost of the card you have."
                },
                {
                    "date": "2018-07-05",
                    "text": "You may cast spells as cards with morph face down by choosing the card name secretly. To secretly choose a card name, write it on a piece of paper and keep it with the face-down card. You can't choose a card name already chosen with Garfield, including one that has been secretly chosen. It must also be the name of a card with a morph ability and the same mana cost as the physical card. Any player who may look at the card may also look at the chosen name. Similarly, if the card is turned face up or revealed (for example because it was countered or died, or you left the game), the chosen name is also revealed."
                },
                {
                    "date": "2018-07-05",
                    "text": "You can't cast a card as a card with miracle for its miracle cost, because the physical card doesn't have a miracle ability to trigger. If your physical card has miracle, you pay the physical card's miracle cost regardless of as what card you cast it."
                },
                {
                    "date": "2018-07-05",
                    "text": "If Garfield leaves the battlefield and later returns, the new Garfield has access to all card names again."
                },
                {
                    "date": "2018-07-05",
                    "text": "Garfield's ability is not Mental Magic. You can name cards that are already on the battlefield, or look up cards using electronic devices. Players are also encouraged to use notes to aid in representing the board state."
                }
            ],
            "subtypes": [
                "Human",
                "Artificer"
            ],
            "supertypes": [
                "Legendary"
            ],
            "text": "You may play each card you play as a copy of another card with the same mana cost. You can't choose the same card twice. (Mana cost includes color.)",
            "toughness": "2",
            "type": "Legendary Creature — Human Artificer",
            "types": [
                "Creature"
            ]
        },
        {
            "colorIdentity": [
                "B"
            ],
            "colors": [
                "Black"
            ],
            "manaCost": "{X}{2}{B}",
            "name": "Soul Burn",
            "number": "12",
            "rulings": [
                {
                    "date": "2004-10-04",
                    "text": "Will give 1 life for each black mana used, but not more life than the amount of unprevented damage that is dealt."
                },
                {
                    "date": "2018-08-31",
                    "text": "I have applied functional errata to this card in order to make it work with Structures from Ruins of Doharum. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [],
            "supertypes": [],
            "text": "Spend only black and/or red mana on X.\nSoul Burn deals X damage to any target. You gain life equal to the damage dealt, but not more than the amount of {B} spent on X, the player's life total before the damage was dealt, the planeswalker's loyalty before the damage was dealt, the Structure's stability before the damage was dealt, or the creature's toughness.",
            "type": "Sorcery",
            "types": [
                "Sorcery"
            ]
        },
        {
            "colorIdentity": [
                "G"
            ],
            "colors": [
                "Green"
            ],
            "manaCost": "{2}{G}",
            "name": "Yisan, the Wanderer Bard",
            "number": "13",
            "power": "2",
            "rulings": [
                {
                    "date": "2014-07-18",
                    "text": "If Yisan isn't on the battlefield when its ability resolves, use the number of verse counters on it when it left the battlefield to determine which creature cards may be put onto the battlefield. This number will include the counter you put on Yisan to activate the ability."
                },
                {
                    "date": "2019-03-29",
                    "text": "I have applied functional errata to this card: it is now a Bard. For the official text and new rulings, please look up the card on Gatherer. —Fenhl"
                }
            ],
            "subtypes": [
                "Human",
                "Rogue",
                "Bard"
            ],
            "supertypes": [
                "Legendary"
            ],
            "text": "{2}{G}, {T}, Put a verse counter on Yisan, the Wanderer Bard: Search your library for a creature card with converted mana cost equal to the number of verse counters on Yisan, put it onto the battlefield, then shuffle your library.",
            "toughness": "3",
            "type": "Legendary Creature — Human Rogue Bard",
            "types": [
                "Creature"
            ]
        }
    ],
    "code": "LORESEEKERERRATA",
    "meta": {
        "date": "2019-06-09",
        "version": "4.4.1"
    },
    "name": "Lore Seeker errata",
    "releaseDate": "2016-12-14",
    "type": "errata"
}
