{"baseSetSize":4,"block":"Commander","cards":[{"artist":"Seb McKinnon","artistIds":["ad4caca0-8d89-44ce-a1a6-d5ca905bd6fb"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","U","W"],"colors":["B","U","W"],"convertedManaCost":3.0,"edhrecSaltiness":0.63,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"221324","mcmId":"361694","mtgjsonV4Id":"113646e8-d620-502e-a7fd-3d627db1724e","scryfallCardBackId":"597b79b3-7d77-4261-871a-60dd17403388","scryfallId":"c562ff50-f74b-4311-972a-ba62366411d5","scryfallIllustrationId":"9da492c3-2e5f-4f40-a254-fc3993a8ead6","scryfallOracleId":"3a30089d-cd2d-49be-9b06-7a2454117692","tcgplayerProductId":"173005"},"isOversized":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":true},"legalities":{},"loyalty":"3","manaCost":"{W}{U}{B}","manaValue":3.0,"name":"Aminatou, the Fateshifter","number":"37","purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/15909dd132d7555a","tcgplayer":"https://mtgjson.com/links/ca94049f96b477ec"},"rarity":"mythic","rulings":[{"date":"2018-07-13","text":"Aminatou’s second ability can target any permanent you own, including those another player controls."},{"date":"2018-07-13","text":"As Aminatou’s third ability resolves, you choose a direction, then each player takes control of their new permanents at the same time."},{"date":"2018-07-13","text":"If a token is exiled this way, it will cease to exist and won’t return to the battlefield."},{"date":"2018-07-13","text":"In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. The effect of Aminatou’s third ability stops applying to all permanents that player controlled and control of them reverts to their previous controller."},{"date":"2018-07-13","text":"In a two-player game, each player gains control of each permanent the other controls (aside from Aminatou) no matter which direction you choose."},{"date":"2018-07-13","text":"Once the exiled permanent returns, it’s considered a new object with no relation to the object that it was. Auras attached to the exiled permanent will be put into their owners’ graveyards. Equipment attached to the exiled permanent will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist."},{"date":"2018-07-13","text":"The effect of Aminatou’s third ability lasts indefinitely. It continues to apply after Aminatou (or her controller) leaves the game."},{"date":"2018-07-13","text":"You draw a card and put one back all while Aminatou’s first ability is resolving. Nothing can happen between the two, and no player may choose to take actions."}],"securityStamp":"oval","setCode":"OC18","subtypes":["Aminatou"],"supertypes":["Legendary"],"text":"[+1]: Draw a card, then put a card from your hand on top of your library.\n[−1]: Exile another target permanent you own, then return it to the battlefield under your control.\n[−6]: Choose left or right. Each player gains control of all nonland permanents other than Aminatou, the Fateshifter controlled by the next player in the chosen direction.\nAminatou, the Fateshifter can be your commander.","type":"Legendary Planeswalker — Aminatou","types":["Planeswalker"],"uuid":"75ea5f0a-d1ef-5c08-9ce5-d8bca16263f3"},{"artist":"Johannes Voss","artistIds":["3593dd7e-c547-4a32-81cd-7da725f60118"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","U","W"],"colors":["G","U","W"],"convertedManaCost":4.0,"edhrecSaltiness":0.29,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"221325","mcmId":"361696","mtgjsonV4Id":"3eb39074-cfa7-514b-9a68-7252316c9371","scryfallCardBackId":"597b79b3-7d77-4261-871a-60dd17403388","scryfallId":"e2674ab8-6255-4901-944e-b30ca89336a9","scryfallIllustrationId":"9b71b26a-81f1-4cb1-bb3b-9669ca6493e1","scryfallOracleId":"7cf1fa2e-1572-4d9d-8e93-e49016b34458","tcgplayerProductId":"173006"},"isOversized":true,"isReprint":true,"isStarter":true,"keywords":["Mill"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":true},"legalities":{},"loyalty":"3","manaCost":"{1}{G}{W}{U}","manaValue":4.0,"name":"Estrid, the Masked","number":"40","purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/3ac7a488d4b83113","tcgplayer":"https://mtgjson.com/links/63b2afc1e4d8cc91"},"rarity":"mythic","rulings":[{"date":"2018-07-13","text":"All of the non-Aura enchantments put onto the battlefield with Estrid’s third ability enter at the same time. If any have triggered abilities that trigger on something else entering the battlefield, they’ll see each other."},{"date":"2018-07-13","text":"An enchanted permanent is one with an Aura attached to it. Enchantment permanents you control that don’t have Auras attached to them aren’t enchanted."},{"date":"2018-07-13","text":"Aura cards returned with Estrid’s third ability may enchant non-Aura enchantments put onto the battlefield with that ability."},{"date":"2018-07-13","text":"Estrid’s second ability can’t target Estrid, but the Mask token may legally enchant Estrid if you find a way to move it onto her."},{"date":"2018-07-13","text":"Estrid’s second ability might target a permanent that can’t have the Aura token attached to it. In this case, the token isn’t created at all."},{"date":"2018-07-13","text":"If a permanent enchanted with an Aura that has totem armor has indestructible, lethal damage and effects that try to destroy it simply have no effect. Totem armor won’t do anything because it won’t have to."},{"date":"2018-07-13","text":"If a permanent enchanted with an Aura that has totem armor would be destroyed by multiple state-based actions at the same time (most likely because a creature with deathtouch has dealt damage to that creature greater than or equal to its toughness) totem armor’s effect will replace all of them and save the creature."},{"date":"2018-07-13","text":"If a permanent you control is enchanted with multiple Auras that have totem armor, and the enchanted permanent would be destroyed, one of those Auras is destroyed instead — but only one of them. You choose which one because you control the enchanted permanent."},{"date":"2018-07-13","text":"If a spell or ability (such as Akroma’s Vengeance) would destroy both an Aura with totem armor and the permanent it’s enchanting at the same time, totem armor’s effect will save the enchanted permanent from being destroyed. Instead, the spell or ability will destroy the Aura in two different ways at the same time, but the result is the same as destroying it once."},{"date":"2018-07-13","text":"If a spell or ability says that it would “destroy” a permanent enchanted with an Aura that has totem armor, that spell or ability is what causes the Aura to be destroyed instead. Totem armor doesn’t destroy the Aura; rather, it changes the effects of the spell or ability. On the other hand, if a spell or ability deals lethal damage to a creature enchanted with an Aura that has totem armor, the game rules regarding lethal damage cause the Aura to be destroyed, not that spell or ability."},{"date":"2018-07-13","text":"If an Aura card can’t enchant anything, it remains in your graveyard."},{"date":"2018-07-13","text":"If an Aura with totem armor is itself enchanted by another Aura with totem armor, destroying either the first Aura or the permanent it enchants will result in only the second Aura being destroyed instead."},{"date":"2018-07-13","text":"Totem armor has no effect if the enchanted permanent is put into a graveyard for any other reason, such as if it’s sacrificed, if the “legend rule” applies to it, or if its toughness is 0 or less."},{"date":"2018-07-13","text":"Totem armor’s effect is applied no matter why the enchanted permanent would be destroyed: because it’s been dealt lethal damage, or because it’s being affected by an effect that says to “destroy” it (such as Putrefy). In either case, all damage is removed from the permanent and the Aura is destroyed instead."},{"date":"2018-07-13","text":"Totem armor’s effect is mandatory. If the enchanted permanent would be destroyed, you must remove all damage from it (if it has any) and destroy the Aura that has totem armor instead."},{"date":"2018-07-13","text":"Totem armor’s effect is not regeneration. Specifically, if totem armor’s effect is applied, the enchanted permanent does not become tapped and is not removed from combat as a result. Effects that say the enchanted permanent can’t be regenerated (as Putrefy does) won’t prevent totem armor’s effect from being applied."},{"date":"2018-07-13","text":"You choose what each returning Aura will enchant just before that Aura enters the battlefield. The chosen recipient must be able to legally be enchanted by the Aura. This doesn’t target the player or permanent it will enchant, so an opponent’s permanent with hexproof may be chosen this way."}],"securityStamp":"oval","setCode":"OC18","subtypes":["Estrid"],"supertypes":["Legendary"],"text":"[+2]: Untap each enchanted permanent you control.\n[−1]: Create a white Aura enchantment token named Mask attached to another target permanent. The token has enchant permanent and totem armor.\n[−7]: Mill seven cards. Return all non-Aura enchantment cards from your graveyard to the battlefield, then do the same for Aura cards.\nEstrid, the Masked can be your commander.","type":"Legendary Planeswalker — Estrid","types":["Planeswalker"],"uuid":"2266eeff-56c5-565d-9a82-7e749792c273"},{"artist":"Bram Sels","artistIds":["2e90d3c1-e8ac-45c7-9d5a-63385c1a384d"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","G","R"],"colors":["B","G","R"],"convertedManaCost":5.0,"edhrecSaltiness":0.6,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"221323","mcmId":"361695","mtgjsonV4Id":"a72ddb81-524c-5226-9a4d-b3f8899bc807","scryfallCardBackId":"597b79b3-7d77-4261-871a-60dd17403388","scryfallId":"511e4105-1215-4dc7-a198-42a2d2036b8d","scryfallIllustrationId":"d92b458f-5a6c-4cd0-b135-d62bbf521b36","scryfallOracleId":"38a55562-1e2d-4240-9454-219a4a25d38d","tcgplayerProductId":"173007"},"isOversized":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":true},"legalities":{},"loyalty":"5","manaCost":"{2}{B}{R}{G}","manaValue":5.0,"name":"Lord Windgrace","number":"43","purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/bfb008f9c24bbe0e","tcgplayer":"https://mtgjson.com/links/ad306692c824e408"},"rarity":"mythic","rulings":[{"date":"2018-07-13","text":"If you have no cards in hand as Lord Windgrace's first ability resolves, you'll discard nothing then you'll draw one card."},{"date":"2018-07-13","text":"While resolving Lord Windgrace's last ability, you create six Cat Warrior tokens even if fewer than six nonland permanents are destroyed. However, if you choose any targets for the ability and each of them becomes an illegal target, the ability doesn't resolve and you don't create any tokens."}],"securityStamp":"oval","setCode":"OC18","subtypes":["Windgrace"],"supertypes":["Legendary"],"text":"[+2]: Discard a card, then draw a card. If a land card is discarded this way, draw an additional card.\n[−3]: Return up to two target land cards from your graveyard to the battlefield.\n[−11]: Destroy up to six target nonland permanents, then create six 2/2 green Cat Warrior creature tokens with forestwalk.\nLord Windgrace can be your commander.","type":"Legendary Planeswalker — Windgrace","types":["Planeswalker"],"uuid":"f4c730c1-39d6-5b43-b623-18f7e5c88a19"},{"artist":"Ryan Pancoast","artistIds":["89cc9475-dda2-4d13-bf88-54b92867a25c"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","U"],"colors":["R","U"],"convertedManaCost":4.0,"edhrecSaltiness":0.55,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"221326","mcmId":"361697","mtgjsonV4Id":"20df01c2-fa4e-53cd-a8fb-36132fc0ecf2","scryfallCardBackId":"597b79b3-7d77-4261-871a-60dd17403388","scryfallId":"b32b3dae-7616-46ad-b9bf-854559cda977","scryfallIllustrationId":"a1a5f22b-baa8-433a-a393-4f124b53dc63","scryfallOracleId":"0e084342-31ff-47a5-9fd8-5b385add7a1a","tcgplayerProductId":"173008"},"isOversized":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":true},"legalities":{},"loyalty":"4","manaCost":"{2}{U}{R}","manaValue":4.0,"name":"Saheeli, the Gifted","number":"44","purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/f6ec63d2eb967443","tcgplayer":"https://mtgjson.com/links/d469d1daf317d03f"},"rarity":"mythic","rulings":[{"date":"2018-07-13","text":"Any enters-the-battlefield abilities of a copied artifact will trigger when the token enters the battlefield. Any “as [this artifact] enters the battlefield” or “[this artifact] enters the battlefield with” abilities of the artifact will also work."},{"date":"2018-07-13","text":"If a copied artifact has {X} in its mana cost, X is considered to be 0."},{"date":"2018-07-13","text":"If a copied artifact is a token, the token that’s created copies the original characteristics of that token as stated by the effect that created the token."},{"date":"2018-07-13","text":"If a copied artifact is copying something else (for example, if the copied artifact is a Sculpting Steel), then the token enters the battlefield as whatever that artifact copied."},{"date":"2018-07-13","text":"Saheeli’s second ability reduces only generic mana in the cost of the next spell you cast."},{"date":"2018-07-13","text":"The total cost to cast a spell is locked in before you pay that cost. For example, if you control three artifacts, including one you can sacrifice to add {C} to your mana pool, Saheeli’s second ability will reduce the cost of a spell you cast by {3}. Then you can sacrifice the artifact when you activate mana abilities just before paying the cost, and it remains reduced by {3}."},{"date":"2018-07-13","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you’re paying, add any cost increases, then apply any cost reductions (such as that of Saheeli’s second ability). The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."},{"date":"2018-07-13","text":"While resolving Saheeli’s third ability, each token copies exactly what was printed on the original artifact and nothing else (unless that artifact is copying something else or is a token; see below). It doesn’t copy whether that artifact is tapped or untapped, whether it has any counters on it or Auras attached to it, or any non-copy effects that have changed its types, color, or so on."}],"securityStamp":"oval","setCode":"OC18","subtypes":["Saheeli"],"supertypes":["Legendary"],"text":"[+1]: Create a 1/1 colorless Servo artifact creature token.\n[+1]: The next spell you cast this turn costs {1} less to cast for each artifact you control as you cast it.\n[−7]: For each artifact you control, create a token that's a copy of it. Those tokens gain haste. Exile those tokens at the beginning of the next end step.\nSaheeli, the Gifted can be your commander.","type":"Legendary Planeswalker — Saheeli","types":["Planeswalker"],"uuid":"07dce71a-7df1-5bfa-afb1-cf8765b2d27b"}],"code":"OC18","isFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"C18","languages":["English"],"name":"Commander 2018 Oversized","parentCode":"C18","releaseDate":"2018-08-09","tokens":[],"totalSetSize":4,"translations":{},"type":"memorabilia","meta":{"date":"2024-02-26","version":"5.2.2+20240226"}}
