{"baseSetSize":40,"cards":[{"artist":"James Paick","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211763,"name":"Akademie von West-Tolaria","text":"Hast du zu Beginn deines Endsegments keine Karten auf der Hand, ziehe sieben Karten.\nImmer wenn du chaos würfelst, wirf alle Karten aus deiner Hand ab.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211898,"name":"Academia en Tolaria Oeste","text":"Al comienzo de tu paso final, si no tienes cartas en tu mano, roba siete cartas.\nSiempre que lances caos, descarta tu mano.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211853,"name":"Académie de l'Ouest de Tolaria","text":"Au début de votre étape de fin, si vous n'avez aucune carte en main, piochez sept cartes.\nÀ chaque fois que vous obtenez chaos, défaussez-vous de votre main.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211808,"name":"Accademia di Tolaria Occidentale","text":"All'inizio della tua sottofase finale, se non hai carte in mano, pesca sette carte.\nOgniqualvolta tiri caos, scarta la tua mano.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211943,"name":"トレイリア西部のアカデミー","text":"あなたの終了ステップの開始時に、あなたの手札にカードが無い場合、カードを７枚引く。\nあなたがchaosを出すたび、あなたの手札を捨てる。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127729","mcmId":"21475","mtgjsonV4Id":"2227dfa0-5734-5d44-bf67-c198b10ee5e2","multiverseId":"198073","scryfallId":"3f770c56-58ea-4b70-b9b6-9b2cb13e2234","scryfallIllustrationId":"8d617a18-0f09-4471-8ac6-f0928f1f9912","scryfallOracleId":"15b979de-c8ee-4664-9ca7-6c4eb3346967","tcgplayerProductId":"37272"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Academy at Tolaria West","number":"1","originalText":"At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever you roll chaos, discard your hand.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/25522782ba703bd1","tcgplayer":"https://mtgjson.com/links/d314fa73eb3978f1"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Academy at Tolaria West’s first ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless you have no cards in hand as your end step begins, and (2) the ability will do nothing unless you have no cards in hand by the time it resolves."},{"date":"2009-10-01","text":"If you discard your hand as a result of rolling {CHAOS}, Academy at Tolaria West’s first ability will then trigger at the beginning of your end step (unless you planeswalk or somehow put a card in your hand before then)."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever chaos ensues, discard your hand.","type":"Plane — Dominaria","types":["Plane"],"uuid":"f90fa7c0-9671-527c-8c2d-7b68c53fc829"},{"artist":"Jason A. Engle","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211764,"name":"Äther-Abzugsschächte","text":"Wenn du zu Beginn deines Versorgungssegments zu den Äther-Abzugsschächten weltenwanderst, kannst du eine Kreatur opfern. Falls du dies tust, decke Karten oben von deiner Bibliothek auf, bis du eine Kreaturenkarte aufdeckst. Bringe diese Karte ins Spiel und mische dann alle anderen auf diese Weise aufgedeckten Karten in deine Bibliothek.\nImmer wenn du chaos würfelst, kannst du eine Kreaturenkarte aus deiner Hand ins Spiel bringen.","type":"Welt — Iquatana"},{"language":"Spanish","multiverseId":211899,"name":"Las Chimeneas de Éter","text":"Cuando camines por los planos hacia las Chimeneas de Éter o al comienzo de tu mantenimiento, puedes sacrificar una criatura. Si lo haces, muestra las primeras cartas de tu biblioteca hasta que muestres una carta de criatura, pon esa carta en el campo de batalla, luego baraja todas las otras cartas mostradas de esta manera en tu biblioteca.\nSiempre que lances caos, puedes poner una carta de criatura de tu mano en el campo de batalla.","type":"Plano — Iquatana"},{"language":"French","multiverseId":211854,"name":"Les Tubulures d'Aether","text":"Quand vous vous transplanez vers Les Tubulures d'Aether ou au début de votre entretien, vous pouvez sacrifier une créature. Si vous faites ainsi, révélez les cartes du dessus de votre bibliothèque jusqu'à ce que vous révéliez une carte de créature, mettez cette carte sur le champ de bataille et mélangez ensuite toutes les autres cartes révélées de cette manière dans votre bibliothèque.\nÀ chaque fois que vous obtenez chaos, vous pouvez mettre sur le champ de bataille une carte de créature de votre main.","type":"Plan : Iquatana"},{"language":"Italian","multiverseId":211809,"name":"I Cannelli Eterei","text":"Quando viaggi tra i piani fino a I Cannelli Eterei o all'inizio del tuo mantenimento, puoi sacrificare una creatura. Se lo fai, rivela carte dalla cima del tuo grimorio finché non riveli una carta creatura, mettila sul campo di battaglia, poi rimescola tutte le altre carte rivelate in questo modo nel tuo grimorio.\nOgniqualvolta tiri caos, puoi mettere sul campo di battaglia una carta creatura dalla tua mano.","type":"Piano — Iquatana"},{"language":"Japanese","multiverseId":211944,"name":"霊気筒","text":"あなたが霊気筒へプレインズウォークしたときかあなたのアップキープの開始時に、あなたはクリーチャーを１体生け贄に捧げてもよい。 そうした場合、あなたのライブラリーの一番上のカードを、クリーチャー・カードが公開されるまで公開し続け、そのカードを戦場に出し、その後これにより公開された他のすべてのカードをあなたのライブラリーに加えて切り直す。\nあなたがchaosを出すたび、あなたはあなたの手札にあるクリーチャー・カードを１枚戦場に出してもよい。","type":"次元 — イクァンターナ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127759","mcmId":"21476","mtgjsonV4Id":"7c3ea00b-e7c5-57c8-937e-6b0fda31f5a8","multiverseId":"198098","scryfallId":"79dcf946-f5b1-4f8c-ba2b-d1f912946144","scryfallIllustrationId":"c4bf9680-daca-43d0-a9f0-0767b7eacce7","scryfallOracleId":"8eb442a9-5e61-4e2e-983d-b49b04be2575","tcgplayerProductId":"37303"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Aether Flues","number":"2","originalText":"When you planeswalk to The Æther Flues or at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever you roll chaos, you may put a creature card from your hand onto the battlefield.","originalType":"Plane - Iquatana","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/62380c3df0d76edd","tcgplayer":"https://mtgjson.com/links/ee3f01c27110bc93"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"The first ability of The Aether Flues doesn't target a creature. You don't choose a creature to sacrifice until the ability resolves. Once you choose a creature to sacrifice, it's too late for players to respond."},{"date":"2009-10-01","text":"If you use the first ability of The Aether Flues but there are no creatures in your library, you'll reveal your entire library then shuffle it."},{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Iquatana"],"supertypes":[],"text":"When you planeswalk to The Aether Flues and at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever chaos ensues, you may put a creature card from your hand onto the battlefield.","type":"Plane — Iquatana","types":["Plane"],"uuid":"687f316b-51fc-57ac-bb0e-4da85e6c76b8"},{"artist":"Todd Lockwood","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211765,"name":"Agyrem","text":"Immer wenn eine weiße Kreatur aus dem Spiel auf einen Friedhof gelegt wird, bringe sie zu Beginn des nächsten Endsegments unter der Kontrolle ihres Besitzers ins Spiel zurück.\nImmer wenn eine nicht-weiße Kreatur aus dem Spiel auf einen Friedhof gelegt wird, bringe sie zu Beginn des nächsten Endsegments auf die Hand ihres Besitzers zurück.\nImmer wenn du chaos würfelst, können dich Kreaturen nicht mehr angreifen, bis ein Spieler weltenwandert.","type":"Welt — Ravnica"},{"language":"Spanish","multiverseId":211900,"name":"Agyrem","text":"Siempre que una criatura blanca vaya al cementerio desde el campo de batalla, regrésala al campo de batalla bajo el control de su propietario al comienzo del próximo paso final.\nSiempre que una criatura que no sea blanca vaya a un cementerio desde el campo de batalla, regrésala a la mano de su propietario al comienzo del próximo paso final.\nSiempre que lances caos, las criaturas no pueden atacar hasta que un jugador camine por los planos.","type":"Plano — Rávnica"},{"language":"French","multiverseId":211855,"name":"Agyrem","text":"À chaque fois qu'une créature blanche est mise dans un cimetière depuis le champ de bataille, renvoyez-la sur le champ de bataille, sous le contrôle de son propriétaire, au début de la prochaine étape de fin.\nÀ chaque fois qu'une créature non-blanche est mise dans un cimetière depuis le champ de bataille, renvoyez-la dans la main de son propriétaire au début de la prochaine étape de fin.\nÀ chaque fois que vous obtenez chaos, les créatures ne peuvent pas vous attaquer avant qu'un joueur se transplane.","type":"Plan : Ravnica"},{"language":"Italian","multiverseId":211810,"name":"Agyrem","text":"Ogniqualvolta una creatura bianca viene messa in un cimitero dal campo di battaglia, rimettila sul campo di battaglia sotto il controllo del suo proprietario all'inizio della prossima sottofase finale.\nOgniqualvolta una creatura non bianca viene messa in un cimitero dal campo di battaglia, falla tornare in mano al suo proprietario all'inizio della prossima sottofase finale.\nOgniqualvolta tiri caos, le creature non possono attaccarti finché un giocatore non viaggia tra i piani.","type":"Piano — Ravnica"},{"language":"Japanese","multiverseId":211945,"name":"アギレム","text":"白のクリーチャーが１体戦場からいずれかの墓地に置かれるたび、次の終了ステップの開始時に、それをオーナーのコントロール下で戦場に戻す。\n白でないクリーチャーが１体戦場からいずれかの墓地に置かれるたび、次の終了ステップの開始時に、それをオーナーの手札に戻す。\nあなたがchaosを出すたび、いずれかのプレイヤーがプレインズウォークするまで、クリーチャーはあなたを攻撃できない。","type":"次元 — ラヴニカ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127730","mcmId":"21477","mtgjsonV4Id":"42ec76a4-3af7-5af7-8fb1-7a4577a5fc1e","multiverseId":"198090","scryfallId":"3d03025d-a53e-4bd4-9f21-1249d0af5bc2","scryfallIllustrationId":"995f5b3f-7988-4eb5-9335-284f5c3a1e10","scryfallOracleId":"38f84e55-049c-441e-b4e2-1e207ab5dbe5","tcgplayerProductId":"37273"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Agyrem","number":"3","originalText":"Whenever a white creature is put into a graveyard from the battlefield, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature is put into a graveyard from the battlefield, return it to its owner's hand at the beginning of the next end step.\nWhenever you roll chaos, creatures can't attack you until a player planeswalks.","originalType":"Plane - Ravnica","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/d873f7e300c6d2de","tcgplayer":"https://mtgjson.com/links/2f1103949f1d94d9"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Agyrem’s first and second abilities each set up a delayed triggered ability. These abilities will trigger at the beginning of the next end step even if Agyrem is no longer the face-up plane card."},{"date":"2009-10-01","text":"Agyrem’s first ability will return a card to the battlefield only if it’s still in the graveyard by the time the delayed triggered ability resolves. Similarly, Agyrem’s second ability will return a card to its owner’s hand only if it’s still in the graveyard by the time the delayed triggered ability resolves."},{"date":"2009-10-01","text":"If a creature is put into a graveyard from the battlefield, its last existence on the battlefield is checked to determine its color."},{"date":"2009-10-01","text":"A creature that caused either of Agyrem’s first two abilities to trigger will be returned at the beginning of the next end step even if it’s not a creature card. (For example, if it’s a Treetop Village.)"},{"date":"2009-10-01","text":"If a token creature is put into a graveyard from the battlefield, one of Agyrem’s first two abilities will trigger, but the token will cease to exist long before it would be returned somewhere."},{"date":"2009-10-01","text":"If multiple creatures are put into their owners’ graveyards at the same time (due to combat damage or Planar Cleansing, for example), Agyrem’s first two abilities trigger that many times. At the beginning of the next end step, the player whose turn it is at that time puts all of their Agyrem delayed triggered abilities on the stack in any order, then each other player in turn order does the same. The last ability put on the stack is the first one that resolves. The creatures are returned one at a time."},{"date":"2009-10-01","text":"If you’re affected by the chaos ability, creatures will still be able to attack planeswalkers you control."}],"setCode":"OHOP","subtypes":["Ravnica"],"supertypes":[],"text":"Whenever a white creature dies, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature dies, return it to its owner's hand at the beginning of the next end step.\nWhenever chaos ensues, creatures can't attack you until a player planeswalks.","type":"Plane — Ravnica","types":["Plane"],"uuid":"bbad1963-ea88-54c3-accc-1f690345c26f"},{"artist":"Michael Komarck","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211766,"name":"Bant","text":"Alle Kreaturen haben Edelmut. (Immer wenn eine Kreatur alleine angreift, erhält sie für jedes Vorkommen von Edelmut bei den Kreaturen, die ihr Beherrscher kontrolliert, +1/+1 bis zum Ende des Zuges.)\nImmer wenn du chaos würfelst, lege eine Göttlichkeitsmarke auf eine grüne, weiße oder blaue Kreatur deiner Wahl. Diese Kreatur ist unzerstörbar, solange die Göttlichkeitsmarke auf ihr liegt.","type":"Welt — Alara"},{"language":"Spanish","multiverseId":211901,"name":"Bant","text":"Todas las criaturas tienen la habilidad de exaltado. (Siempre que una criatura ataque sola, obtiene +1/+1 hasta el final del turno por cada copia de la habilidad de exaltado entre los permanentes que controle su controlador.)\nSiempre que lances caos, pon un contador de divinidad sobre la criatura verde, blanca o azul objetivo. Esa criatura es indestructible mientras tenga un contador de divinidad sobre ella.","type":"Plano — Alara"},{"language":"French","multiverseId":211856,"name":"Bant","text":"Toutes les créatures ont l'exaltation. (À chaque fois qu'une créature attaque seule, elle gagne +1/+1 jusqu'à la fin du tour pour chaque occurrence d'exaltation parmi les créatures que son contrôleur contrôle.)\nÀ chaque fois que vous obtenez chaos, mettez un marqueur « divinité » sur une créature verte, blanche ou bleue ciblée. Cette créature est indestructible tant qu'elle a sur elle un marqueur « divinité ».","type":"Plan : Alara"},{"language":"Italian","multiverseId":211811,"name":"Bant","text":"Tutte le creature hanno esaltato. (Ogniqualvolta una creatura attacca da sola, prende +1/+1 fino alla fine del turno per ogni istanza di esaltato tra i permanenti controllati dal suo controllore.)\nOgniqualvolta tiri caos, metti un segnalino divinità su una creatura bersaglio verde, bianca o blu. Quella creatura è indistruttibile fintanto che ha un segnalino divinità.","type":"Piano — Alara"},{"language":"Japanese","multiverseId":211946,"name":"バント","text":"すべてのクリーチャーは賛美を持つ。 （あなたがコントロールするいずれかのクリーチャーが単独で攻撃するたび、そのクリーチャーはターン終了時まで、それのコントローラーがコントロールするパーマネントが持つ賛美１つにつき＋１/＋１の修整を受ける。）\nあなたがchaosを出すたび、緑か白か青のクリーチャー１体を対象とし、それの上に神性カウンターを１個置く。 そのクリーチャーは、神性カウンターが置かれているかぎり破壊されない。","type":"次元 — アラーラ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127731","mcmId":"21478","mtgjsonV4Id":"a4f8e275-f3e3-5447-8993-a8e3b31595fc","multiverseId":"198099","scryfallId":"95e19068-54e6-46a0-b341-9039382fe463","scryfallIllustrationId":"37d62f5a-f174-48ca-9678-9e1ec7002686","scryfallOracleId":"82e67c57-6d7a-44cc-ba63-77ce887ab075","tcgplayerProductId":"37274"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Bant","number":"4","originalText":"All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among creatures its controller controls.)\nWhenever you roll chaos, put a divinity counter on target green, white, or blue creature. That creature is indestructible as long as it has a divinity counter on it.","originalType":"Plane - Alara","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/fd07e761b6be33cf","tcgplayer":"https://mtgjson.com/links/7ee008b50b292376"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you declare exactly one creature as an attacker, each exalted ability on each permanent you control (including, perhaps, the attacking creature itself) will trigger. Note that if a creature has multiple instances of exalted, each one triggers separately. The bonuses are given to the attacking creature, not to the permanent with exalted. Ultimately, the attacking creature will wind up with +1/+1 for each of your exalted abilities."},{"date":"2009-10-01","text":"If you attack with multiple creatures, but then all but one are removed from combat, your exalted abilities won’t trigger."},{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"Some effects put creatures onto the battlefield attacking. Since those creatures were never declared as attackers, they’re ignored by exalted abilities. They won’t cause exalted abilities to trigger. If any exalted abilities have already triggered (because exactly one creature was declared as an attacker), those abilities will resolve as normal even though there may now be multiple attackers."},{"date":"2009-10-01","text":"Exalted bonuses last until the turn ends. If an effect creates an additional combat phase during your turn, a creature that attacked alone during the first combat phase will still have its exalted bonuses in that new phase. If a creature attacks alone during the second combat phase, all your exalted abilities will trigger again."},{"date":"2009-10-01","text":"In a Two-Headed Giant game, a creature “attacks alone” if it’s the only creature declared as an attacker by your entire team. If you control that attacking creature, your exalted abilities will trigger but your teammate’s exalted abilities won’t."},{"date":"2009-10-01","text":"Exalted abilities will resolve before blockers are declared."},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2013-07-01","text":"A creature with a divinity counter put on it due to the chaos ability retains indestructible even after Bant stops being the face-up plane card."},{"date":"2013-07-01","text":"If all divinity counters on a creature are moved to a different creature, the indestructible ability doesn’t move along with them. The first creature no longer has indestructible because it no longer has a divinity counter on it. The second creature doesn’t have indestructible because the chaos ability didn’t target it."}],"setCode":"OHOP","subtypes":["Alara"],"supertypes":[],"text":"All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents its controller controls.)\nWhenever chaos ensues, put a divinity counter on target green, white, or blue creature. That creature has indestructible for as long as it has a divinity counter on it.","type":"Plane — Alara","types":["Plane"],"uuid":"0d478923-11d8-5b0a-ada6-6f62150e1304"},{"artist":"Matt Stewart","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211767,"name":"Klippenmarkt","text":"Wenn du zum Klippenmarkt weltenwanderst oder zu Beginn deines Versorgungssegments kannst du mit einem Spieler deiner Wahl den Lebenspunktestand tauschen.\nImmer wenn du chaos würfelst, tausche die Kontrolle über zwei bleibende Karten deiner Wahl, die einen Typ gemeinsam haben.","type":"Welt — Merkadia"},{"language":"Spanish","multiverseId":211902,"name":"Mercado del Precipicio","text":"Cuando camines por los planos hacia Mercado del Precipicio o al comienzo de tu mantenimiento, puedes intercambiar los totales de vida con el jugador objetivo.\nSiempre que lances caos, intercambia el control de dos permanentes objetivos que compartan un tipo de carta.","type":"Plano — Mercadia"},{"language":"French","multiverseId":211857,"name":"Marché à flanc de falaise","text":"Quand vous vous transplanez vers le Marché à flanc de falaise ou au début de votre entretien, vous pouvez échanger votre total de points de vie contre celui du joueur ciblé.\nÀ chaque fois que vous obtenez chaos, échangez le contrôle de deux permanents ciblés qui partagent un type.","type":"Plan : Mercadia"},{"language":"Italian","multiverseId":211812,"name":"Mercato del Dirupo","text":"Quando viaggi tra i piani fino al Mercato del Dirupo o all'inizio del tuo mantenimento, puoi scambiare i tuoi punti vita con quelli di un giocatore bersaglio.\nOgniqualvolta tiri caos, scambia il controllo di due permanenti bersaglio che condividono un tipo di carta.","type":"Piano — Mercadia"},{"language":"Japanese","multiverseId":211947,"name":"絶壁の市場","text":"あなたが絶壁の市場にプレインズウォークしたときかあなたのアップキープの開始時に、プレイヤー１人を対象とする。あなたはそのプレイヤーとライフの総量を交換してもよい。\nあなたがchaosを出すたび、共通のカードタイプを持つパーマネント２つを対象とし、それらのコントロールを交換する。","type":"次元 — メルカディア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127732","mcmId":"21479","mtgjsonV4Id":"6b5c6d03-6e86-59aa-abe6-ce9d23e9228c","multiverseId":"198077","scryfallId":"8f1db58b-e199-4417-a20e-6a4ed2cde856","scryfallIllustrationId":"43c8ab85-a133-4f6f-a083-6cb7388d5c74","scryfallOracleId":"b21a71d7-f236-43e2-b576-0b5c9280f0cc","tcgplayerProductId":"37275"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Cliffside Market","number":"5","originalText":"When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever you roll chaos, exchange control of two target permanents that share a type.","originalType":"Plane - Mercadia","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/652e6d2c0ca7a963","tcgplayer":"https://mtgjson.com/links/36d800cf22b9957a"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"For two players to exchange life totals, what actually happens is that each player gains or loses the amount of life necessary to equal the other player’s previous life total. For example, if Player A has 5 life and Player B has 3 life before the exchange, Player A will lose 2 life and Player B will gain 2 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."},{"date":"2009-10-01","text":"Neither permanent you target with the chaos ability needs to be one you control."},{"date":"2009-10-01","text":"The control-change effect has no duration. For each permanent, it will last until the game ends or the permanent leaves the battlefield. It will override all previous control-change effects for those permanents, and may be overridden by a later control-change effect."},{"date":"2009-10-01","text":"Both permanents targeted by the chaos ability may be controlled by the same player. If they are, the effect nothing."},{"date":"2009-10-01","text":"If either permanent targeted by the chaos ability is an illegal target by the time the ability resolves, the exchange doesn’t happen. If both targets become illegal, the ability doesn’t resolve."}],"setCode":"OHOP","subtypes":["Mercadia"],"supertypes":[],"text":"When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever chaos ensues, exchange control of two target permanents that share a card type.","type":"Plane — Mercadia","types":["Plane"],"uuid":"d1e6fe8b-9e17-59ed-9feb-0c6e762f1f4c"},{"artist":"Pete Venters","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211768,"name":"Die dunkle Baronie","text":"Immer wenn eine nicht-schwarze Karte von irgendwoher auf den Friedhof eines Spielers gelegt wird, verliert dieser Spieler 1 Lebenspunkt.\nImmer wenn du chaos würfelst, wirft jeder Gegner eine Karte aus seiner Hand ab.","type":"Welt — Ulgrotha"},{"language":"Spanish","multiverseId":211903,"name":"La Baronía Oscura","text":"Siempre que una carta que no sea negra vaya al cementerio de un jugador desde cualquier parte, ese jugador pierde 1 vida.\nSiempre que lances caos, cada oponente descarta una carta.","type":"Plano — Ulgrotha"},{"language":"French","multiverseId":211858,"name":"La Baronnerie Noire","text":"À chaque fois qu'une carte non-noire est mise dans le cimetière d'un joueur depuis n'importe où, ce joueur perd 1 point de vie.\nÀ chaque fois que vous obtenez chaos, chaque adversaire se défausse d'une carte.","type":"Plan : Ulgrotha"},{"language":"Italian","multiverseId":211813,"name":"La Baronia Oscura","text":"Ogniqualvolta una carta non nera viene messa nel cimitero di un giocatore da qualsiasi zona, quel giocatore perde 1 punto vita.\nOgniqualvolta tiri caos, ogni avversario scarta una carta.","type":"Piano — Ulgrotha"},{"language":"Japanese","multiverseId":211948,"name":"暗き男爵領","text":"黒でないカードが１枚いずれかの領域からいずれかのプレイヤーの墓地に置かれるたび、そのプレイヤーは１点のライフを失う。\nあなたがchaosを出すたび、各対戦相手はそれぞれカードを１枚捨てる。","type":"次元 — ウルグローサ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127760","mcmId":"21480","mtgjsonV4Id":"19a5a828-04ed-5796-b5b3-c4c6d0dfade1","multiverseId":"198083","scryfallId":"379809a2-988b-46a8-a38e-134cee7eeaaf","scryfallIllustrationId":"6ccf0105-a576-4907-91a0-7a9daf2e97b1","scryfallOracleId":"5503c308-560d-4d5f-a86a-4b06d9947ddc","tcgplayerProductId":"37304"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Dark Barony","number":"6","originalText":"Whenever a nonblack card is put into a player's graveyard from anywhere, that player loses 1 life.\nWhenever you roll chaos, each opponent discards a card.","originalType":"Plane - Ulgrotha","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/02d6c375806c47d7","tcgplayer":"https://mtgjson.com/links/ec993e50f67a1a89"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"The Dark Barony’s first ability doesn’t behave like a leaves-the-battlefield triggered ability, since the card put into a graveyard may come from anywhere. If a card is put into a graveyard from the battlefield, its color is checked in the graveyard, not as it last existed on the battlefield."}],"setCode":"OHOP","subtypes":["Ulgrotha"],"supertypes":[],"text":"Whenever a nonblack card is put into a player's graveyard from anywhere, that player loses 1 life.\nWhenever chaos ensues, each opponent discards a card.","type":"Plane — Ulgrotha","types":["Plane"],"uuid":"8cc1946c-8712-522d-83c7-65cc2ff9caea"},{"artist":"Darrell Riche","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211769,"name":"Die Wildnis von Eloren","text":"Immer wenn ein Spieler eine bleibende Karte für Mana tappt, erhöht dieser Spieler seinen Manavorrat um ein zusätzliches Mana eines beliebigen Typs, den diese bleibende Karte erzeugt hat.\nImmer wenn du chaos würfelst, kann ein Spieler deiner Wahl keine Zaubersprüche mehr wirken, bis ein Spieler weltenwandert.","type":"Welt — Shandalar"},{"language":"Spanish","multiverseId":211904,"name":"Campos de Eloren","text":"Siempre que un jugador gire un permanente para obtener maná, ese jugador agrega un maná a su reserva de maná de algún tipo que produzca ese permanente.\nSiempre que lances caos, el jugador objetivo no puede lanzar hechizos hasta que un jugador camine por los planos.","type":"Plano — Shandalar"},{"language":"French","multiverseId":211859,"name":"Friches d'Eloren","text":"À chaque fois qu'un joueur engage un permanent pour du mana, ce joueur ajoute à sa réserve un mana de n'importe quel type produit par ce permanent.\nÀ chaque fois que vous obtenez chaos, le joueur ciblé ne peut pas lancer de sorts jusqu'à ce qu'un joueur se transplane.","type":"Plan : Shandalar"},{"language":"Italian","multiverseId":211814,"name":"Rovi di Eloren","text":"Ogniqualvolta un giocatore TAPpa un permanente per attingere mana, quel giocatore aggiunge alla sua riserva di mana un mana di qualsiasi tipo quel permanente abbia prodotto.\nOgniqualvolta tiri caos, un giocatore bersaglio non può lanciare magie finché un giocatore non viaggia tra i piani.","type":"Piano — Shandalar"},{"language":"Japanese","multiverseId":211949,"name":"エローレン荒原","text":"いずれかのプレイヤーがマナを引き出す目的でパーマネントを１つタップするたび、そのプレイヤーは自分のマナ・プールに、そのパーマネントが生み出したいずれかのタイプのマナ１点を加える。\nあなたがchaosを出すたび、プレイヤー１人を対象とする。いずれかのプレイヤーがプレインズウォークするまで、そのプレイヤーは呪文を唱えられない。","type":"次元 — シャンダラー"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127733","mcmId":"21481","mtgjsonV4Id":"103c577a-0aa2-5ba6-9117-e54b8d1db3f3","multiverseId":"198109","scryfallId":"691cdea0-d9ed-4cee-884c-32b8420e974c","scryfallIllustrationId":"3c601dc2-c9f5-4d8d-9d78-d05ac5a968d5","scryfallOracleId":"23fe1c21-c396-4ebf-a8b0-22d697952b34","tcgplayerProductId":"37276"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Eloren Wilds","number":"7","originalText":"Whenever a player taps a permanent for mana, that player adds one mana to his or her mana pool of any type that permanent produced.\nWhenever you roll chaos, target player can't cast spells until a player planeswalks.","originalType":"Plane - Shandalar","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/a794bda088ab1e2c","tcgplayer":"https://mtgjson.com/links/68e97aff52267afb"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"You’re “tapping a permanent for mana” only if you’re activating an activated ability of that permanent that includes the {T} symbol in its cost and produces mana as part of its effect."},{"date":"2009-10-01","text":"Eloren Wilds’s first ability affects any permanent players tap for mana, not just lands they tap for mana."},{"date":"2009-10-01","text":"The additional mana is produced by Eloren Wilds, not the permanent that was tapped for mana."},{"date":"2009-10-01","text":"The chaos ability prevents the affected player from casting permanent spells (artifacts, creatures, enchantments, and planeswalkers), not just instant and sorcery spells. It doesn’t stop the player from playing lands or activating abilities (such as cycling or unearth)."}],"setCode":"OHOP","subtypes":["Shandalar"],"supertypes":[],"text":"Whenever a player taps a permanent for mana, that player adds one mana of any type that permanent produced.\nWhenever chaos ensues, target player can't cast spells until a player planeswalks.","type":"Plane — Shandalar","types":["Plane"],"uuid":"67aede78-6297-5181-982e-189e1826558d"},{"artist":"Jaime Jones","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211770,"name":"Der Äonennebel","text":"Spieler übergehen ihre Enttappsegmente.\nImmer wenn du chaos würfelst, enttappe alle bleibenden Karten, die du kontrollierst.","type":"Welt — Equilor"},{"language":"Spanish","multiverseId":211905,"name":"La Niebla de los Eones","text":"Los jugadores se saltan sus pasos de enderezar.\nSiempre que lances caos, endereza todos los permanentes que controles.","type":"Plano — Equilor"},{"language":"French","multiverseId":211860,"name":"Le Brouillard des Éons","text":"Les joueurs passent leurs étapes de dégagement.\nÀ chaque fois que vous obtenez chaos, dégagez tous les permanents que vous contrôlez.","type":"Plan : Équilor"},{"language":"Italian","multiverseId":211815,"name":"La Nebbia Eterna","text":"I giocatori saltano le loro sottofasi di STAP.\nOgniqualvolta tiri caos, STAPpa tutti i permanenti che controlli.","type":"Piano — Equilor"},{"language":"Japanese","multiverseId":211950,"name":"永劫の霧","text":"プレイヤーはアンタップ・ステップを飛ばす。\nあなたがchaosを出すたび、あなたがコントロールするすべてのパーマネントをアンタップする。","type":"次元 — エクィロー"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127761","mcmId":"21482","mtgjsonV4Id":"6da4a83e-5c4f-5d4e-9b24-6de74a11ff51","multiverseId":"198092","scryfallId":"c13ee1df-b481-4f09-87e5-3366967d136c","scryfallIllustrationId":"bcc1a3a8-d351-43a0-9f7d-9af64ffc1b62","scryfallOracleId":"a04d05ed-1b9b-4407-8780-c75c102a94dd","tcgplayerProductId":"37305"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Eon Fog","number":"8","originalText":"Players skip their untap steps.\nWhenever you roll chaos, untap all permanents you control.","originalType":"Plane - Equilor","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/eb8b8492edee3d9e","tcgplayer":"https://mtgjson.com/links/2ce1dec6a2c625a4"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Equilor"],"supertypes":[],"text":"Players skip their untap steps.\nWhenever chaos ensues, untap all permanents you control.","type":"Plane — Equilor","types":["Plane"],"uuid":"3ddb5556-7008-51aa-90ce-c566bab58ee7"},{"artist":"Matt Stewart","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211771,"name":"Fressgründe","text":"Rote Zaubersprüche kosten beim Wirken {1} weniger.\nGrüne Zaubersprüche kosten beim Wirken {1} weniger.\nImmer wenn du chaos würfelst, lege X +1/+1-Marken auf eine Kreatur deiner Wahl, wobei X gleich den umgewandelten Manakosten dieser Kreatur ist.","type":"Welt — Muraganda"},{"language":"Spanish","multiverseId":211906,"name":"Terrenos de Caza","text":"Cuesta {1} menos lanzar los hechizos rojos.\nCuesta {1} menos lanzar los hechizos verdes.\nSiempre que lances caos, pon X contadores +1/+1 sobre la criatura objetivo, donde X es el coste de maná convertido de esa criatura.","type":"Plano — Muraganda"},{"language":"French","multiverseId":211861,"name":"Terrain de chasse","text":"Les sorts rouges coûtent {1} de moins à lancer.\nLes sorts verts coûtent {1} de moins à lancer.\nÀ chaque fois que vous obtenez chaos, mettez X marqueurs +1/+1 sur la créature ciblée, X étant le coût converti de mana de cette créature.","type":"Plan : Muraganda"},{"language":"Italian","multiverseId":211816,"name":"Pascoli Naturali","text":"Le magie rosse costano {1} in meno per essere lanciate.\nLe magie verdi costano {1} in meno per essere lanciate.\nOgniqualvolta tiri caos, metti X segnalini +1/+1 su una creatura bersaglio, dove X è il costo di mana convertito di quella creatura.","type":"Piano — Muraganda"},{"language":"Japanese","multiverseId":211951,"name":"餌場","text":"赤の呪文は、それを唱えるためのコストが{1}少なくなる。\n緑の呪文は、それを唱えるためのコストが{1}少なくなる。\nあなたがchaosを出すたび、クリーチャー１体を対象とし、それの上に＋１/＋１カウンターをＸ個置く。Ｘはそのクリーチャーの点数で見たマナ・コストに等しい。","type":"次元 — ムラガンダ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127734","mcmId":"21483","mtgjsonV4Id":"ab434c0e-4a65-5e09-b300-30c20fefe5d9","multiverseId":"198066","scryfallId":"206d6c77-9754-45db-9bf7-819d9c4a6fbc","scryfallIllustrationId":"76f110fd-c94a-4444-8cb6-b34670fa80cd","scryfallOracleId":"b1eff630-b56c-48a5-ac21-836a60157b35","tcgplayerProductId":"37277"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Feeding Grounds","number":"9","originalText":"Red spells cost {1} less to cast.\nGreen spells cost {1} less to cast.\nWhenever you roll chaos, put X +1/+1 counters on target creature, where X is that creature's converted mana cost.","originalType":"Plane - Muraganda","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/01395f54d4404829","tcgplayer":"https://mtgjson.com/links/b47cac55c3ee3f91"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Spells that are both red and green cost {2} less to cast."}],"setCode":"OHOP","subtypes":["Muraganda"],"supertypes":[],"text":"Red spells cost {1} less to cast.\nGreen spells cost {1} less to cast.\nWhenever chaos ensues, put X +1/+1 counters on target creature, where X is that creature's mana value.","type":"Plane — Muraganda","types":["Plane"],"uuid":"b4067278-0d0e-53ee-9e4a-d880c56f6e56"},{"artist":"Daniel Ljunggren","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211772,"name":"Sommerfelder","text":"Immer wenn ein Spieler einen Zauberspruch wirkt, kann dieser Spieler 2 Lebenspunkte dazuerhalten.\nImmer wenn du chaos würfelst, kannst du 10 Lebenspunkte dazuerhalten.","type":"Welt — Moag"},{"language":"Spanish","multiverseId":211907,"name":"Campos del Verano","text":"Siempre que un jugador lance un hechizo, ese jugador puede ganar 2 vidas.\nSiempre que lances caos, puedes ganar 10 vidas.","type":"Plano — Moag"},{"language":"French","multiverseId":211862,"name":"Champs d'Été","text":"À chaque fois qu'un joueur lance un sort, ce joueur peut gagner 2 points de vie.\nÀ chaque fois que vous obtenez chaos, vous pouvez gagner 10 points de vie.","type":"Plan : Moag"},{"language":"Italian","multiverseId":211817,"name":"Campi dell'Estate","text":"Ogniqualvolta un giocatore lancia una magia, quel giocatore può guadagnare 2 punti vita.\nOgniqualvolta tiri caos, puoi guadagnare 10 punti vita.","type":"Piano — Moag"},{"language":"Japanese","multiverseId":211952,"name":"夏の平原","text":"いずれかのプレイヤーが呪文を１つ唱えるたび、そのプレイヤーは２点のライフを得てもよい。\nあなたがchaosを出すたび、あなたは10点のライフを得てもよい。","type":"次元 — モアグ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127735","mcmId":"21484","mtgjsonV4Id":"fa7ca867-a3ad-5d32-b23e-0b6bc1f6f397","multiverseId":"198097","scryfallId":"08445a56-25a9-40be-bcf1-a147733d6f0a","scryfallIllustrationId":"57951dbc-b432-44e5-8514-7e315e0e7b90","scryfallOracleId":"81a0d96a-7ac8-4947-8779-2102c9b33d38","tcgplayerProductId":"37278"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Fields of Summer","number":"10","originalText":"Whenever a player casts a spell, that player may gain 2 life.\nWhenever you roll chaos, you may gain 10 life.","originalType":"Plane - Moag","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/d9715348a2b68c1c","tcgplayer":"https://mtgjson.com/links/b6b74fa71b68beed"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Moag"],"supertypes":[],"text":"Whenever a player casts a spell, that player may gain 2 life.\nWhenever chaos ensues, you may gain 10 life.","type":"Plane — Moag","types":["Plane"],"uuid":"0fcf4b06-5cde-579d-8364-927eb2383f7c"},{"artist":"Dave Kendall","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211773,"name":"Die vierte Sphäre","text":"Opfere zu Beginn deines Versorgungssegments eine nicht-schwarze Kreatur.\nImmer wenn du chaos würfelst, bringe einen 2/2 schwarzen Zombie-Kreaturenspielstein ins Spiel.","type":"Welt — Phyrexia"},{"language":"Spanish","multiverseId":211908,"name":"La Cuarta Esfera","text":"Al comienzo de tu mantenimiento, sacrifica una criatura que no sea negra.\nSiempre que lances caos, pon en el campo de batalla una ficha de criatura Zombie negra 2/2.","type":"Plano — Pirexia"},{"language":"French","multiverseId":211863,"name":"La Quatrième Sphère","text":"Au début de votre entretien, sacrifiez une créature non-noire.\nÀ chaque fois que vous obtenez chaos, mettez sur le champ de bataille un jeton de créature 2/2 noire Zombie.","type":"Plan : Phyrexia"},{"language":"Italian","multiverseId":211818,"name":"La Quarta Sfera","text":"All'inizio del tuo mantenimento, sacrifica una creatura non nera.\nOgniqualvolta tiri caos, metti sul campo di battaglia una pedina creatura Zombie 2/2 nera.","type":"Piano — Phyrexia"},{"language":"Japanese","multiverseId":211953,"name":"第四球層","text":"あなたのアップキープの開始時に、黒でないクリーチャーを１体生け贄に捧げる。\nあなたがchaosを出すたび、黒の２/２のゾンビ・クリーチャー・トークンを１体戦場に出す。","type":"次元 — ファイレクシア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127762","mcmId":"21485","mtgjsonV4Id":"4756febb-8f3b-58ff-a24b-4ae097f338e6","multiverseId":"198102","scryfallId":"875ddd84-2244-4d8e-a2c8-1a98f395edf1","scryfallIllustrationId":"22c22b4f-3153-4247-8594-f1f62f57d673","scryfallOracleId":"13e801cd-e537-4ea6-8c3d-21b142bdc026","tcgplayerProductId":"37306"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Fourth Sphere","number":"11","originalText":"At the beginning of your upkeep, sacrifice a nonblack creature.\nWhenever you roll chaos, put a 2/2 black Zombie creature token onto the battlefield.","originalType":"Plane - Phyrexia","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/be479081d2edbcc5","tcgplayer":"https://mtgjson.com/links/d70d9ed3b148bd6f"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Phyrexia"],"supertypes":[],"text":"At the beginning of your upkeep, sacrifice a nonblack creature.\nWhenever chaos ensues, create a 2/2 black Zombie creature token.","type":"Plane — Phyrexia","types":["Plane"],"uuid":"a729af19-b606-5f1d-95eb-86160cf6338e"},{"artist":"Lars Grant-West","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211774,"name":"Glimmerleere-Becken","text":"Immer wenn ein Spieler einen Spontanzauber mit einem einzelnen Ziel oder eine Hexerei mit einem einzelnen Ziel wirkt, kopiert er den Zauberspruch für jedes mögliche Ziel einmal (für jeden anderen Zauberspruch, für jede andere bleibende Karte, jede Karte, die sich nicht im Spiel befindet und/oder jeden Spieler). Jede dieser Kopien hat ein unterschiedliches Ziel.\nImmer wenn du chaos würfelst, bestimme eine Kreatur deiner Wahl. Jeder Spieler außer dem Beherrscher dieser Kreatur bringt einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist.","type":"Welt — Mirrodin"},{"language":"Spanish","multiverseId":211909,"name":"Cuenca del Campo Resplandeciente","text":"Siempre que un jugador lance un hechizo instantáneo o conjuro con un único objetivo, él copia ese hechizo para cada otro hechizo, permanente, carta que no esté en el campo de batalla y/o jugador que el hechizo pudiera hacer objetivo. Cada copia hace objetivo a uno distinto de esos.\nSiempre que lances caos, elige una criatura objetivo. Cada jugador excepto el controlador de esa criatura pone en el campo de batalla una ficha que es una copia de esa criatura.","type":"Plano — Mirrodín"},{"language":"French","multiverseId":211864,"name":"Bassin du Vide Rayonnant","text":"À chaque fois qu'un joueur lance un sort d'éphémère ou de rituel ayant une seule cible, il copie ce sort pour chaque autre sort, permanent, carte qui n'est pas sur le champ de bataille et/ou joueur que le sort pourrait cibler. Chaque copie cible une de ces cibles différentes.\nÀ chaque fois que vous obtenez chaos, choisissez une créature ciblée. Chaque joueur, excepté le contrôleur de cette créature, met sur le champ de bataille un jeton qui est une copie de cette créature.","type":"Plan : Mirrodin"},{"language":"Italian","multiverseId":211819,"name":"Bacino del Nulla Scintillante","text":"Ogniqualvolta un giocatore lancia una magia istantaneo o stregoneria con un singolo bersaglio, quel giocatore copia quella magia per ogni altra magia, permanente, carta non sul campo di battaglia e/o giocatore che la magia potrebbe bersagliare. Ogni copia ne bersaglia uno diverso.\nOgniqualvolta tiri caos, scegli una creatura bersaglio. Ogni giocatore tranne il controllore di quella creatura mette sul campo di battaglia una pedina che è una copia di quella creatura.","type":"Piano — Mirrodin"},{"language":"Japanese","multiverseId":211954,"name":"空僻の盆地","text":"いずれかのプレイヤーが、単一の対象を持つインスタント呪文かソーサリー呪文を１つ唱えるたび、そのプレイヤーは、呪文やパーマネントや戦場に無いカードやプレイヤーのうち、他に対象にとれるもの１つにつき１つその呪文をコピーする。 それぞれのコピーは、それらのうち別々のものを対象とする。\nあなたがchaosを出すたび、クリーチャー１体を対象とする。 そのクリーチャーのコントローラー以外の各プレイヤーは、そのクリーチャーのコピーであるトークンを１体戦場に出す。","type":"次元 — ミラディン"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127736","mcmId":"21486","mtgjsonV4Id":"f6a76ffd-c224-59b1-9088-90edeb462087","multiverseId":"198068","scryfallId":"43bb6932-90c5-4dee-847a-0c9977b0d270","scryfallIllustrationId":"d4b48a41-398c-4480-81cb-e7e0ac9f90e0","scryfallOracleId":"43a23de7-0738-4b03-b87d-5a7d1144825c","tcgplayerProductId":"37279"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Glimmervoid Basin","number":"12","originalText":"Whenever a player casts an instant or sorcery spell with a single target, he or she copies that spell for each other spell, permanent, card not on the battlefield, and/or player the spell could target. Each copy targets a different one of them.\nWhenever you roll chaos, choose target creature. Each player except that creature's controller puts a token onto the battlefield that's a copy of that creature.","originalType":"Plane - Mirrodin","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/08ab8dabe3cf5d32","tcgplayer":"https://mtgjson.com/links/a05e417ab77a58b1"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If a spell targets multiple things, it won't cause Glimmervoid Basin's first ability to trigger, even if all but one of those targets has become illegal."},{"date":"2009-10-01","text":"If a spell targets the same player or object multiple times, it won't cause Glimmervoid Basin's first ability to trigger."},{"date":"2009-10-01","text":"Other than choices involving modes or additional costs, the copies are created based on what they could target if the spell were cast anew. For example, if a player casts Naturalize (“Destroy target artifact or enchantment”) targeting an artifact, Glimmervoid Basin's first ability will copy it for each artifact and enchantment it could target (and each copy will target a different one of those), not just for each artifact it could target."},{"date":"2009-10-01","text":"Anything that couldn't be targeted by the original spell (due to shroud, protection abilities, targeting restrictions, or any other reason) is just ignored by Glimmervoid Basin's first ability."},{"date":"2009-10-01","text":"The controller of the spell that caused Glimmervoid Basin's first ability to trigger also controls all the copies. That player chooses the order the copies are put onto the stack. The original spell will be on the stack beneath those copies and resolves last."},{"date":"2009-10-01","text":"The copies that Glimmervoid Basin's first ability creates are created on the stack, so they're not “cast.” Abilities that trigger when a player casts a spell (like Glimmervoid Basin's first ability itself) won't trigger."},{"date":"2009-10-01","text":"If the spell that's copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. Its controller can't choose a different one."},{"date":"2009-10-01","text":"If the spell that's copied has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."},{"date":"2009-10-01","text":"The controller of a copy can't choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."},{"date":"2009-10-01","text":"As a token is created by the chaos ability, it checks the printed values of the creature it's copying, as well as any copy effects that have been applied to it. It won't copy counters on the creature, nor will it copy other effects that have changed the creature's power, toughness, types, color, and so on."}],"setCode":"OHOP","subtypes":["Mirrodin"],"supertypes":[],"text":"Whenever a player casts an instant or sorcery spell with a single target, that player copies that spell for each other spell, permanent, card not on the battlefield, and/or player the spell could target. Each copy targets a different one of them.\nWhenever chaos ensues, choose target creature. Each player except that creature's controller creates a token that's a copy of that creature.","type":"Plane — Mirrodin","types":["Plane"],"uuid":"eca96293-e416-5ade-b457-ad88e3fe2a53"},{"artist":"Warren Mahy","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211775,"name":"Goldwiese","text":"Immer wenn ein Land ins Spiel kommt, bringt der Beherrscher dieses Landes drei 0/1 weiße Ziegen-Kreaturenspielsteine ins Spiel.\nImmer wenn du chaos würfelst, bringe einen 0/1 weißen Ziegen-Kreaturenspielstein ins Spiel.","type":"Welt — Lorwyn"},{"language":"Spanish","multiverseId":211910,"name":"Pradera Dorada","text":"Siempre que una tierra entre al campo de batalla, el controlador de esa tierra pone en el campo de batalla tres fichas de criatura Cabra blanca 0/1.\nSiempre que lances caos, pon en el campo de batalla una ficha de criatura Cabra blanca 0/1.","type":"Plano — Lorwyn"},{"language":"French","multiverseId":211865,"name":"Orprairie","text":"À chaque fois qu'un terrain arrive sur le champ de bataille, le contrôleur de ce terrain met sur le champ de bataille trois jetons de créature 0/1 blanche Chèvre.\nÀ chaque fois que vous obtenez chaos, mettez sur le champ de bataille un jeton de créature 0/1 blanche Chèvre.","type":"Plan : Lorwyn"},{"language":"Italian","multiverseId":211820,"name":"Prateria Dorata","text":"Ogniqualvolta una terra entra nel campo di battaglia, il controllore di quella terra mette sul campo di battaglia tre pedine creatura Capra 0/1 bianche.\nOgniqualvolta tiri caos, metti sul campo di battaglia una pedina creatura Capra 0/1 bianca.","type":"Piano — Lorwyn"},{"language":"Japanese","multiverseId":211955,"name":"ゴールドメドウ","text":"土地が１つ戦場に出るたび、その土地のコントローラーは、白の０/１のヤギ・クリーチャー・トークンを３体戦場に出す。\nあなたがchaosを出すたび、白の０/１のヤギ・クリーチャー・トークンを１体戦場に出す。","type":"次元 — ローウィン"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127737","mcmId":"21487","mtgjsonV4Id":"9acd7141-43e8-5463-b1ac-59ecc5d61971","multiverseId":"198087","scryfallId":"af7cce84-7bf0-4724-a797-65ef6cdc4497","scryfallIllustrationId":"6b943ff7-3a2f-43b4-9e0d-dda96c71a81e","scryfallOracleId":"f12400e5-8288-48e1-b3b7-0cc4f8d9ca67","tcgplayerProductId":"37280"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Goldmeadow","number":"13","originalText":"Whenever a land enters the battlefield, that land's controller puts three 0/1 white Goat creature tokens onto the battlefield.\nWhenever you roll chaos, put a 0/1 white Goat creature token onto the battlefield.","originalType":"Plane - Lorwyn","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/748238306b41cccb","tcgplayer":"https://mtgjson.com/links/a3034a31e24d27eb"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Lorwyn"],"supertypes":[],"text":"Whenever a land enters the battlefield, that land's controller creates three 0/1 white Goat creature tokens.\nWhenever chaos ensues, create a 0/1 white Goat creature token.","type":"Plane — Lorwyn","types":["Plane"],"uuid":"5061a17d-37cc-58f3-beed-50c909ba5076"},{"artist":"Howard Lyon","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211776,"name":"Der Große Wald","text":"Jede Kreatur verwendet beim Zuweisen ihres Kampfschadens den Wert ihrer Widerstandskraft und nicht den ihrer Stärke.\nImmer wenn du chaos würfelst, erhalten bis zum Ende des Zuges Kreaturen, die du kontrollierst, +0/+2 und verursachen Trampelschaden.","type":"Welt — Lorwyn"},{"language":"Spanish","multiverseId":211911,"name":"El Gran Bosque","text":"Cada criatura asigna daño de combate igual a su resistencia en lugar de su fuerza.\nSiempre que lances caos, las criaturas que controlas obtienen +0/+2 y ganan la habilidad de arrollar hasta el final del turno.","type":"Plano — Lorwyn"},{"language":"French","multiverseId":211866,"name":"La Grande Forêt","text":"Chaque créature attribue des blessures de combat égales à son endurance à la place de sa force.\nÀ chaque fois que vous obtenez chaos, les créatures que vous contrôlez gagnent +0/+2 et acquièrent le piétinement jusqu'à la fin du tour.","type":"Plan : Lorwyn"},{"language":"Italian","multiverseId":211821,"name":"Bosco Grande","text":"Ogni creatura assegna danno da combattimento pari alla sua costituzione invece che alla sua forza.\nOgniqualvolta tiri caos, le creature che controlli prendono +0/+2 e hanno travolgere fino alla fine del turno.","type":"Piano — Lorwyn"},{"language":"Japanese","multiverseId":211956,"name":"偉大なる森","text":"各クリーチャーは、パワーではなくタフネスに等しい点数の戦闘ダメージを割り振る。\nあなたがchaosを出すたび、あなたがコントロールするクリーチャーはターン終了時まで＋０/＋２の修整を受けるとともにトランプルを得る。","type":"次元 — ローウィン"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127763","mcmId":"21488","mtgjsonV4Id":"4cb91701-1d01-52ed-bc2b-13a4a20f5592","multiverseId":"198088","scryfallId":"16b49b6d-863c-4db9-aa4f-bb270588ee8a","scryfallIllustrationId":"1eb02cca-c6a5-48ac-8a6f-e7dd1ef2240d","scryfallOracleId":"8c56bb41-a8d8-4b0f-bbb7-be8466dc9ed1","tcgplayerProductId":"37307"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Great Forest","number":"14","originalText":"Each creature assigns combat damage equal to its toughness rather than its power.\nWhenever you roll chaos, creatures you control get +0/+2 and gain trample until end of turn.","originalType":"Plane - Lorwyn","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/903cdf31d6cb8fc2","tcgplayer":"https://mtgjson.com/links/2db04025764dfb71"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"The Great Forest's first ability means, for example, that a 2/3 creature will assign 3 damage in combat instead of 2."},{"date":"2009-10-01","text":"The Great Forest's first ability doesn't actually change creatures' power; it changes only the value of the combat damage they assign. All other rules and effects that check power or toughness use the real values."}],"setCode":"OHOP","subtypes":["Lorwyn"],"supertypes":[],"text":"Each creature assigns combat damage equal to its toughness rather than its power.\nWhenever chaos ensues, creatures you control get +0/+2 and gain trample until end of turn.","type":"Plane — Lorwyn","types":["Plane"],"uuid":"4a9a9bed-cbbf-575a-a8a0-70daf9692b41"},{"artist":"Nils Hamm","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211777,"name":"Grixis","text":"Blaue, schwarze und/oder rote Kreaturenkarten in deinem Friedhof haben Exhumieren. Die Exhumierungskosten sind gleich ihrer Manakosten. (Bezahle die Manakosten der Karte: Bringe sie ins Spiel zurück. Die Kreatur hat Eile. Schicke sie zu Beginn des nächsten Endsegments oder falls sie das Spiel verlassen würde ins Exil. Spiele Exhumieren nur wie eine Hexerei.)\nImmer wenn du chaos würfelst, bringe eine Kreaturenkarte deiner Wahl aus einem Friedhof unter deiner Kontrolle ins Spiel.","type":"Welt — Alara"},{"language":"Spanish","multiverseId":211912,"name":"Grixis","text":"Las cartas de criatura azules, negras y/o rojas en tu cementerio tienen la habilidad de desenterrar. El coste de desenterrar es igual al coste de maná de la carta. (Pagar el coste de maná de la carta: Regrésala al campo de batalla. La criatura gana la habilidad de prisa. Exíliala al comienzo del próximo paso final o si fuera a dejar el campo de batalla. Desentierra sólo como un conjuro.)\nSiempre que lances caos, pon la carta de criatura objetivo de un cementerio en el campo de batalla bajo tu control.","type":"Plano — Alara"},{"language":"French","multiverseId":211867,"name":"Grixis","text":"Les cartes de créature bleues, noires et/ou rouges dans votre cimetière ont l'exhumation. Le coût d'exhumation est égal au coût de mana de la carte. (Payez le coût de mana de la carte : Renvoyez-la sur le champ de bataille. La créature acquiert la célérité. Exilez-la au début de la prochaine étape de fin ou si elle devait quitter le champ de bataille. N'exhumez que lorsque vous pourriez lancer un rituel.)\nÀ chaque fois que vous obtenez chaos, mettez sur le champ de bataille, sous votre contrôle, la carte de créature ciblée d'un cimetière.","type":"Plan : Alara"},{"language":"Italian","multiverseId":211822,"name":"Grixis","text":"Le carte creatura blu, nere e/o rosse nel tuo cimitero hanno dissotterrare. Il costo di dissotterrare è pari al costo di mana della carta. (Paga il costo di mana della carta: Rimettila sul campo di battaglia. La creatura ha rapidità. Esiliala all'inizio della prossima sottofase finale o se dovesse lasciare il campo di battaglia. Dissotterra solo quando potresti giocare una stregoneria.)\nOgniqualvolta tiri caos, metti sul campo di battaglia sotto il tuo controllo una carta creatura bersaglio da un cimitero.","type":"Piano — Alara"},{"language":"Japanese","multiverseId":211957,"name":"グリクシス","text":"あなたの墓地にある青か黒か赤のクリーチャー・カードは蘇生を持つ。 その蘇生コストは、そのカード自身のマナ・コストに等しい。 （そのカードのマナ・コストを支払う：それを戦場に戻す。 そのクリーチャーは速攻を得る。 次の終了ステップの開始時かそれが戦場を離れた場合に、それを追放する。 蘇生はソーサリーとしてのみ行う。）\nあなたがchaosを出すたび、いずれかの墓地にあるクリーチャー・カード１枚を対象とし、それをあなたのコントロール下で戦場に出す。","type":"次元 — アラーラ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127738","mcmId":"21489","mtgjsonV4Id":"71fa4340-5c36-5ae8-b659-d97664b353b5","multiverseId":"198071","scryfallId":"efe379bc-c08d-4dba-82b2-e46414b73420","scryfallIllustrationId":"ba050b27-e034-412b-934a-9d0ce27ad515","scryfallOracleId":"1aaa60e4-47a8-4255-8a09-5f00922ccf6d","tcgplayerProductId":"37281"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Grixis","number":"15","originalText":"Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever you roll chaos, put target creature card in a graveyard onto the battlefield under your control.","originalType":"Plane - Alara","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/44bc508877ca0aef","tcgplayer":"https://mtgjson.com/links/a9965fde02d37ff7"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Despite the appearance of the reminder text, the unearth abilities that Grixis grants are activated abilities of each individual blue, black, and/or red creature card in a graveyard. They’re not activated abilities of Grixis."},{"date":"2009-10-01","text":"A card’s mana cost includes its color."},{"date":"2009-10-01","text":"Grixis may cause a creature card in a graveyard to have multiple unearth abilities. Its owner may activate any one of those abilities."},{"date":"2009-10-01","text":"If you activate a creature card’s unearth ability but that card is removed from your graveyard before the ability resolves, that unearth ability will resolve and do nothing."},{"date":"2009-10-01","text":"Activating a creature card’s unearth ability isn’t the same as casting the creature card. The unearth ability is put on the stack, but the creature card is not. Spells and abilities that interact with activated abilities (such as Stifle) will interact with unearth, but spells and abilities that interact with spells (such as Essence Scatter) will not."},{"date":"2009-10-01","text":"At the beginning of the end step, a creature returned to the battlefield with unearth is exiled. This is a delayed triggered ability, and it can be countered by effects such as Stifle or Voidslime that counter triggered abilities. If the ability is countered, the creature will stay on the battlefield and the ability won’t trigger again. However, the replacement effect will still exile the creature if it would eventually leave the battlefield."},{"date":"2009-10-01","text":"Unearth grants haste to the creature that’s returned to the battlefield. However, neither of the exile abilities is granted to that creature. If that creature loses all its abilities, it will still be exiled at the beginning of the end step, and if it would leave the battlefield, it is still exiled instead."},{"date":"2009-10-01","text":"If a creature returned to the battlefield with unearth would leave the battlefield for any reason, it’s exiled instead — unless the spell or ability that’s causing the creature to leave the battlefield is actually trying to exile it! In that case, it succeeds at exiling it. If it later returns the creature card to the battlefield (as Oblivion Ring or Flickerwisp might, for example), the creature card will return to the battlefield as a new permanent with no relation to its previous existence. The unearth effect will no longer apply to it."},{"date":"2009-10-01","text":"Unlike the unearth ability, the chaos ability returns a creature card from a graveyard to the battlefield indefinitely."}],"setCode":"OHOP","subtypes":["Alara"],"supertypes":[],"text":"Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever chaos ensues, put target creature card from a graveyard onto the battlefield under your control.","type":"Plane — Alara","types":["Plane"],"uuid":"e6afb568-5fe8-54e7-bbc4-f3f72948a54c"},{"artist":"Steve Argyle","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211778,"name":"Das Hippodrom","text":"Alle Kreaturen erhalten -5/-0.\nImmer wenn du chaos würfelst, kannst du eine Kreatur deiner Wahl zerstören, wenn ihre Stärke 0 oder weniger beträgt.","type":"Welt — Segovia"},{"language":"Spanish","multiverseId":211913,"name":"El Hipódromo","text":"Todas las criaturas obtienen -5/-0.\nSiempre que lances caos, puedes destruir la criatura objetivo si su fuerza es 0 o menos.","type":"Plano — Segovia"},{"language":"French","multiverseId":211868,"name":"L'hippodrome","text":"Toutes les créatures gagnent -5/-0.\nÀ chaque fois que vous obtenez chaos, vous pouvez détruire la créature ciblée si sa force est inférieure ou égale à 0.","type":"Plan : Ségovie"},{"language":"Italian","multiverseId":211823,"name":"L'Ippodromo","text":"Tutte le creature prendono -5/-0.\nOgniqualvolta tiri caos, puoi distruggere una creatura bersaglio se la sua forza è 0 o meno.","type":"Piano — Segovia"},{"language":"Japanese","multiverseId":211958,"name":"ヒッポドローム","text":"すべてのクリーチャーは－５/－０の修整を受ける。\nあなたがchaosを出すたび、クリーチャー１体を対象とする。それのパワーが０以下である場合、あなたはそれを破壊してもよい。","type":"次元 — セゴビア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127764","mcmId":"21490","mtgjsonV4Id":"11e471f5-200f-5017-8f0a-d4da191d1b7a","multiverseId":"198067","scryfallId":"32f321bc-d080-42a3-b29f-a2e58193cfdf","scryfallIllustrationId":"c980f94b-817b-42a4-bca9-c0948ec0e657","scryfallOracleId":"cde8d8c4-5e2b-452f-b3e9-bb9f2e745ec9","tcgplayerProductId":"37308"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Hippodrome","number":"16","originalText":"All creatures get -5/-0.\nWhenever you roll chaos, you may destroy target creature if its power is 0 or less.","originalType":"Plane - Segovia","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/4e464a6cf515b6ca","tcgplayer":"https://mtgjson.com/links/623c4ab3129580ac"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Creatures may have negative power. For example, a 3/4 creature that gets -5/-0 becomes -2/4. The total of its power and toughness is 2. It would need +3/+0 to raise its power to 1."},{"date":"2009-10-01","text":"A creature that would assign 0 or less combat damage (due to having power 0 or less) doesn’t assign combat damage at all."},{"date":"2009-10-01","text":"You may target any creature with The Hippodrome’s chaos ability. Whether its power is 0 or less isn’t checked until the ability resolves."}],"setCode":"OHOP","subtypes":["Segovia"],"supertypes":[],"text":"All creatures get -5/-0.\nWhenever chaos ensues, you may destroy target creature if its power is 0 or less.","type":"Plane — Segovia","types":["Plane"],"uuid":"9fce4a02-01ec-5dc3-a3e9-92646a69e6fd"},{"artist":"Raymond Swanland","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211779,"name":"Immersturm","text":"Immer wenn eine Kreatur ins Spiel kommt, kann der Beherrscher dieser Kreatur sie einer Kreatur oder einem Spieler seiner Wahl Schadenspunkte in Höhe ihrer Stärke zufügen lassen.\nImmer wenn du chaos würfelst, schicke eine Kreatur deiner Wahl ins Exil und bringe sie dann unter der Kontrolle ihres Besitzers ins Spiel zurück.","type":"Welt — Valla"},{"language":"Spanish","multiverseId":211914,"name":"Immersturm","text":"Siempre que una criatura entre al campo de batalla, el controlador de esa criatura puede hacer que le haga daño igual a su fuerza a la criatura o jugador objetivo de su elección.\nSiempre que lances caos, exilia la criatura objetivo, luego regrésala al campo de batalla bajo el control de su propietario.","type":"Plano — Valla"},{"language":"French","multiverseId":211869,"name":"Immersturm","text":"À chaque fois qu'une créature arrive sur le champ de bataille, le contrôleur de cette créature peut faire qu'elle inflige un nombre de blessures égal à sa force à une cible, créature ou joueur, de son choix.\nÀ chaque fois que vous obtenez chaos, exilez la créature ciblée et renvoyez-la ensuite sur le champ de bataille, sous le contrôle de son propriétaire.","type":"Plan : Valla"},{"language":"Italian","multiverseId":211824,"name":"Immersturm","text":"Ogniqualvolta una creatura entra nel campo di battaglia, il controllore di quella creatura può farle infliggere danno pari alla sua forza a una creatura o a un giocatore bersaglio a sua scelta.\nOgniqualvolta tiri caos, esilia una creatura bersaglio, poi rimettila sul campo di battaglia sotto il controllo del suo proprietario.","type":"Piano — Valla"},{"language":"Japanese","multiverseId":211959,"name":"イマースターム","text":"クリーチャーが１体戦場に出るたび、そのクリーチャーのコントローラーが選んだクリーチャー１体かプレイヤー１人を対象とする。その戦場に出たクリーチャーのコントローラーは「このクリーチャーは、それに自身のパワーに等しい点数のダメージを与える。」を選んでもよい。\nあなたがchaosを出すたび、クリーチャー１体を対象とする。それを追放し、その後それをオーナーのコントロール下で戦場に戻す。","type":"次元 — ヴァラ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127739","mcmId":"21491","mtgjsonV4Id":"1e96e98a-fcc4-5f6c-89f8-8e26c34014d4","multiverseId":"198084","scryfallId":"413c3671-f49d-47e0-a6b4-bc60c09204da","scryfallIllustrationId":"c2632990-5b8a-4fe9-8029-da56e27fae0a","scryfallOracleId":"ece3b5ed-3c07-4586-bf99-72bc1aa6ccef","tcgplayerProductId":"37282"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Immersturm","number":"17","originalText":"Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to target creature or player of his or her choice.\nWhenever you roll chaos, exile target creature, then return it to the battlefield under its owner's control.","originalType":"Plane - Valla","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/cbb9c0ad14bfda55","tcgplayer":"https://mtgjson.com/links/1161d916d1262f7b"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If a creature controlled by a player other than the planar controller enters the battlefield, the planar controller (not the creature’s controller) controls Immersturm’s triggered ability. That means that if multiple creatures enter the battlefield at the same time, that player controls all of Immersturm’s triggered abilities and may put them on the stack in whichever order they like. The last one put on the stack is the first one to resolve."},{"date":"2009-10-01","text":"When the chaos ability resolves, the targeted creature is exiled, then immediately returned to the battlefield as a new permanent with no relation to its previous existence."},{"date":"2009-10-01","text":"Any “as [this permanent] enters the battlefield” choices for the card returned by the chaos ability are made by that card’s owner, not its old controller or the controller of the chaos ability."},{"date":"2009-10-01","text":"A token that has left the battlefield can’t come back onto the battlefield. If the chaos ability exiles a token, that token remains in exile until state-based actions are checked, then it ceases to exist."}],"setCode":"OHOP","subtypes":["Valla"],"supertypes":[],"text":"Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to any target of their choice.\nWhenever chaos ensues, exile target creature, then return it to the battlefield under its owner's control.","type":"Plane — Valla","types":["Plane"],"uuid":"d445d03a-4d0f-5633-8937-128d7a18240c"},{"artist":"Zoltan Boros & Gabor Szikszai","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211780,"name":"Die Insel Vesuva","text":"Immer wenn eine Kreatur, die kein Spielstein ist, ins Spiel kommt, bringt ihr Beherrscher einen Spielstein ins Spiel, der eine Kopie dieser Kreatur ist.\nImmer wenn du chaos würfelst, zerstöre eine Kreatur deiner Wahl und alle anderen Kreaturen, die den gleichen Namen wie diese Kreatur haben.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211915,"name":"Isla de Vesuva","text":"Siempre que una criatura que no sea ficha entre al campo de batalla, su controlador pone en el campo de batalla una ficha que es una copia de esa criatura.\nSiempre que lances caos, destruye la criatura objetivo y todas las otras criaturas con el mismo nombre que esa criatura.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211870,"name":"Île de Vésuva","text":"À chaque fois qu'une créature non-jeton arrive sur le champ de bataille, son contrôleur met sur le champ de bataille un jeton qui est une copie de cette créature.\nÀ chaque fois que vous obtenez chaos, détruisez la créature ciblée et toutes les autres créatures ayant le même nom que cette créature.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211825,"name":"Isola di Vesuva","text":"Ogniqualvolta una creatura non pedina entra nel campo di battaglia, il suo controllore mette sul campo di battaglia una pedina che è una copia di quella creatura.\nOgniqualvolta tiri caos, distruggi una creatura bersaglio e tutte le altre creature con lo stesso nome di quella creatura.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211960,"name":"ヴェズーヴァ島","text":"トークンでないクリーチャーが１体戦場に出るたび、それのコントローラーはそのクリーチャーのコピーであるトークンを１体戦場に出す。\nあなたがchaosを出すたび、クリーチャー１体を対象とし、それと、そのクリーチャーと同じ名前を持つ他のすべてのクリーチャーを破壊する。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127740","mcmId":"21492","mtgjsonV4Id":"019e848c-df6b-5692-b9a5-555f70f7727a","multiverseId":"198096","scryfallId":"9e849be6-7697-42b3-8b79-74e2aa3eeaeb","scryfallIllustrationId":"55a63577-a300-4cca-9570-af1a11866052","scryfallOracleId":"f017380f-97db-4a36-b111-b257aa17ebaf","tcgplayerProductId":"37283"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Isle of Vesuva","number":"18","originalText":"Whenever a nontoken creature enters the battlefield, its controller puts a token onto the battlefield that's a copy of that creature.\nWhenever you roll chaos, destroy target creature and all other creatures with the same name as that creature.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/e28b9d94d10cd169","tcgplayer":"https://mtgjson.com/links/8f1e387cfe0a6a58"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"As a token is created by Isle of Vesuva's first ability, it checks the printed values of the creature it's copying, as well as any copy effects that have been applied to it. It won't copy counters on the creature, nor will it copy other effects that have changed the creature's power, toughness, types, color, and so on."},{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"The chaos ability will destroy all creatures with the same name as the target creature, not just tokens created by Isle of Vesuva's first ability. It doesn't matter who controls them."},{"date":"2009-10-01","text":"If the permanent targeted by the chaos ability has become an illegal target by the time the ability resolves, the ability doesn't resolve. Nothing will be destroyed."},{"date":"2009-10-01","text":"A token's name is the same as the creature types listed by the effect that created it, unless the token copies a permanent or that effect specifically gives that token a name. For example, the effect of The Fourth Sphere's chaos ability creates a token with the name “Zombie.”"},{"date":"2009-10-01","text":"A face-down creature has no name, so it doesn't have the same name as anything else."},{"date":"2009-10-01","text":"If the creature that caused Isle of Vesuva's first ability to trigger has already left the battlefield by the time the ability resolves, the ability still creates a token. It will have the copiable values of the characteristics of that nontoken creature as it last existed on the battlefield."},{"date":"2013-07-01","text":"If the permanent targeted by the chaos ability isn't destroyed (because it regenerates, or because it has indestructible), all other permanents with the same name as it will still be destroyed."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"Whenever a nontoken creature enters the battlefield, its controller creates a token that's a copy of that creature.\nWhenever chaos ensues, destroy target creature and all other creatures with the same name as that creature.","type":"Plane — Dominaria","types":["Plane"],"uuid":"f9bdf967-a870-542d-8371-fd3f9097504c"},{"artist":"Franz Vohwinkel","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211781,"name":"Der Izzet-Dampfirrgarten","text":"Immer wenn ein Spieler einen Spontanzauber oder eine Hexerei wirkt, kopiert dieser Spieler den Zauberspruch. Der Spieler kann neue Ziele für die Kopie bestimmen.\nImmer wenn du chaos würfelst, kosten Spontanzauber und Hexereien, die du in diesem Zug wirkst, {3} weniger.","type":"Welt — Ravnica"},{"language":"Spanish","multiverseId":211916,"name":"Laberinto de vapor ízzet","text":"Siempre que un jugador lance un hechizo instantáneo o conjuro, ese jugador lo copia. El jugador puede elegir nuevos objetivos para la copia.\nSiempre que lances caos, los hechizos instantáneos o conjuros que lances este turno te cuesta {3} menos lanzarlos.","type":"Plano — Rávnica"},{"language":"French","multiverseId":211871,"name":"Labyrinthe de vapeur d'Izzet","text":"À chaque fois qu'un joueur lance un sort d'éphémère ou de rituel, ce joueur le copie. Le joueur peut choisir de nouvelles cibles pour la copie.\nÀ chaque fois que vous obtenez chaos, les sorts d'éphémère et de rituel que vous lancez ce tour-ci coûtent {3} de moins à lancer.","type":"Plan : Ravnica"},{"language":"Italian","multiverseId":211826,"name":"Labirinto di Vapore Izzet","text":"Ogniqualvolta un giocatore lancia una magia istantaneo o stregoneria, quel giocatore copia quella magia. Il giocatore può scegliere nuovi bersagli per la copia.\nOgniqualvolta tiri caos, le magie istantaneo e stregoneria che lanci in questo turno costano {3} in meno per essere lanciate.","type":"Piano — Ravnica"},{"language":"Japanese","multiverseId":211961,"name":"イゼットの蒸気迷路","text":"いずれかのプレイヤーがインスタント呪文かソーサリー呪文を１つ唱えるたび、そのプレイヤーはそれをコピーする。 そのプレイヤーはそのコピーの新しい対象を選んでもよい。\nあなたがchaosを出すたび、このターンあなたが唱えるインスタント呪文やソーサリー呪文は、唱えるためのコストが{3}少なくなる。","type":"次元 — ラヴニカ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127741","mcmId":"21493","mtgjsonV4Id":"3dd22cc1-c160-5f4e-b44f-74227c9e9e1e","multiverseId":"198065","scryfallId":"cfcd7ff3-4bad-4205-9d62-b3763eae9513","scryfallIllustrationId":"e5169463-65cc-4aa0-8f7e-f0c2e3af32b5","scryfallOracleId":"e5f8b2bb-e9bb-4a0a-aa88-7fa0299f52a9","tcgplayerProductId":"37284"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Izzet Steam Maze","number":"19","originalText":"Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever you roll chaos, instant and sorcery spells you cast this turn cost {3} less to cast.","originalType":"Plane - Ravnica","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/f70ea812226c9bd8","tcgplayer":"https://mtgjson.com/links/8faa36d43d132278"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"The effect of Izzet Steam Maze’s first ability is mandatory. You must copy the spell whether you want to or not."},{"date":"2009-10-01","text":"Izzet Steam Maze’s first ability will copy any instant or sorcery spell, not just one with targets."},{"date":"2009-10-01","text":"The controller of the spell that caused Izzet Steam Maze’s first ability to trigger also controls the copy. The copy resolves before the original spell."},{"date":"2009-10-01","text":"A copy is created even if the spell that caused Izzet Steam Maze’s first ability to trigger has been countered by the time that ability resolves."},{"date":"2009-10-01","text":"The copy will have the same targets as the spell it’s copying unless its controller chooses new ones. That player may change any number of the targets, including all of them or none of them. The new targets must be legal."},{"date":"2009-10-01","text":"If the spell that’s copied is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. Its controller can’t choose a different one."},{"date":"2009-10-01","text":"If the spell that’s copied has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."},{"date":"2009-10-01","text":"The controller of the copy can’t choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too."},{"date":"2009-10-01","text":"The copy that Izzet Steam Maze’s first ability creates is created on the stack, so it’s not “cast.” Abilities that trigger when a player casts a spell (like Izzet Steam Maze’s first ability itself) won’t trigger."}],"setCode":"OHOP","subtypes":["Ravnica"],"supertypes":[],"text":"Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever chaos ensues, instant and sorcery spells you cast this turn cost {3} less to cast.","type":"Plane — Ravnica","types":["Plane"],"uuid":"85503cb8-14ea-575f-ad16-0c74d415e244"},{"artist":"Steven Belledin","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":["B","G","R","U","W"],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211782,"name":"Krosa","text":"Alle Kreaturen erhalten +2/+2.\nImmer wenn du chaos würfelst, kannst du deinen Manavorrat um {W}{U}{B}{R}{G} erhöhen.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211917,"name":"Krosa","text":"Todas las criaturas obtienen +2/+2.\nSiempre que lances caos, puedes agregar {W}{U}{B}{R}{G} a tu reserva de maná.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211872,"name":"Krosia","text":"Toutes les créatures gagnent +2/+2.\nÀ chaque fois que vous obtenez chaos, vous pouvez ajouter {W}{U}{B}{R}{G} à votre réserve.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211827,"name":"Krosa","text":"Tutte le creature prendono +2/+2.\nOgniqualvolta tiri caos, puoi aggiungere {W}{U}{B}{R}{G} alla tua riserva di mana.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211962,"name":"クローサ","text":"すべてのクリーチャーは＋２/＋２の修整を受ける。\nあなたがchaosを出すたび、あなたはあなたのマナ・プールに{W}{U}{B}{R}{G}を加えてもよい。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127742","mcmId":"21494","mtgjsonV4Id":"718f236c-0652-528a-b9ad-96346b5f468b","multiverseId":"198100","scryfallId":"0473fb5c-e9fc-482c-9e92-cb68ad012ad5","scryfallIllustrationId":"43b23220-6ea0-4db4-9b5e-4dc4a1325901","scryfallOracleId":"2732b605-7c88-4995-b46e-62dc09e68919","tcgplayerProductId":"37285"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Krosa","number":"20","originalText":"All creatures get +2/+2.\nWhenever you roll chaos, you may add {W}{U}{B}{R}{G} to your mana pool.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/ace3ecd2721487c3","tcgplayer":"https://mtgjson.com/links/36caf1d6776712aa"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"All creatures get +2/+2.\nWhenever chaos ensues, you may add {W}{U}{B}{R}{G}.","type":"Plane — Dominaria","types":["Plane"],"uuid":"34ca26b1-01c5-56fe-8662-22992bd92137"},{"artist":"Chris J. Anderson","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211783,"name":"Lethe-See","text":"Lege zu Beginn deines Versorgungssegments die obersten zehn Karten deiner Bibliothek auf deinen Friedhof.\nImmer wenn du chaos würfelst, legt ein Spieler deiner Wahl die obersten zehn Karten seiner Bibliothek auf seinen Friedhof.","type":"Welt — Arkhos"},{"language":"Spanish","multiverseId":211918,"name":"Lago del Leteo","text":"Al comienzo de tu mantenimiento, pon las primeras diez cartas de tu biblioteca en tu cementerio.\nSiempre que lances caos, el jugador objetivo pone las primeras diez cartas de su biblioteca en su cementerio.","type":"Plano — Arkhos"},{"language":"French","multiverseId":211873,"name":"Lac de Lethe","text":"Au début de votre entretien, mettez les dix cartes du dessus de votre bibliothèque dans votre cimetière.\nÀ chaque fois que vous obtenez chaos, le joueur ciblé met les dix cartes du dessus de sa bibliothèque dans son cimetière.","type":"Plan : Arkhos"},{"language":"Italian","multiverseId":211828,"name":"Lago Lete","text":"All'inizio del tuo mantenimento, metti le prime dieci carte del tuo grimorio nel tuo cimitero.\nOgniqualvolta tiri caos, un giocatore bersaglio mette nel suo cimitero le prime dieci carte del suo grimorio.","type":"Piano — Arkhos"},{"language":"Japanese","multiverseId":211963,"name":"忘却湖","text":"あなたのアップキープの開始時に、あなたのライブラリーの一番上から10枚のカードをあなたの墓地に置く。\nあなたがchaosを出すたび、プレイヤー１人を対象とする。そのプレイヤーは、自分のライブラリーの一番上から10枚のカードを自分の墓地に置く。","type":"次元 — アーコス"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127743","mcmId":"21495","mtgjsonV4Id":"6120f84c-66ef-585b-91e7-b57baa16c09f","multiverseId":"198105","scryfallId":"2cdcbdba-8a88-4fd3-8e49-daccf5415937","scryfallIllustrationId":"68454647-94db-4d2d-9883-8f76bf01aa2c","scryfallOracleId":"85592710-8637-4726-8b92-552b9be677c0","tcgplayerProductId":"37286"},"isOversized":true,"isStarter":true,"keywords":["Mill"],"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Lethe Lake","number":"21","originalText":"At the beginning of your upkeep, put the top ten cards of your library into your graveyard.\nWhenever you roll chaos, target player puts the top ten cards of his or her library into his or her graveyard.","originalType":"Plane - Arkhos","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/8bb44a49204f756c","tcgplayer":"https://mtgjson.com/links/8fa30a2be94e7315"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you don’t have ten cards in your library, you’ll put all the cards in your library into your graveyard. The same is true if the targeted player doesn’t have ten cards in their library."}],"setCode":"OHOP","subtypes":["Arkhos"],"supertypes":[],"text":"At the beginning of your upkeep, mill ten cards.\nWhenever chaos ensues, target player mills ten cards.","type":"Plane — Arkhos","types":["Plane"],"uuid":"657afeb4-f400-5779-97d6-63a0e00a2966"},{"artist":"Kev Walker","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":["G"],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211784,"name":"Llanowar","text":"Alle Kreaturen haben „{T}: Erhöhe deinen Manavorrat um {G}{G}.\"\nImmer wenn du chaos würfelst, enttappe alle Kreaturen, die du kontrollierst.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211919,"name":"Llanowar","text":"Todas las criaturas tienen \"{T}: Agrega {G}{G} a tu reserva de maná.\"\nSiempre que lances caos, endereza todas las criaturas que controlas.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211874,"name":"Llanowar","text":"Toutes les créatures ont « {T} : Ajoutez {G}{G} à votre réserve. »\nÀ chaque fois que vous obtenez chaos, dégagez toutes les créatures que vous contrôlez.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211829,"name":"Llanowar","text":"Tutte le creature hanno \"{T}: Aggiungi {G}{G} alla tua riserva di mana.\"\nOgniqualvolta tiri caos, STAPpa tutte le creature che controlli.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211964,"name":"ラノワール","text":"すべてのクリーチャーは「{T}：あなたのマナ・プールに{G}{G}を加える。」を持つ。\nあなたがchaosを出すたび、あなたがコントロールするすべてのクリーチャーをアンタップする。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127744","mcmId":"21496","mtgjsonV4Id":"17586edc-76b4-5c53-a364-3432832de369","multiverseId":"198107","scryfallId":"6313f61b-77bc-42ee-a566-0e5ef2035c6a","scryfallIllustrationId":"8a0194dc-01f8-4a30-ba6e-741c7d4bcecf","scryfallOracleId":"11b3fcb2-0b66-4d8b-8e66-a21a5da1c1f5","tcgplayerProductId":"37287"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Llanowar","number":"22","originalText":"All creatures have \"{T}: Add {G}{G} to your mana pool.\"\nWhenever you roll chaos, untap all creatures you control.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/f6f3309963d8a71f","tcgplayer":"https://mtgjson.com/links/c16e020d0571ba50"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"All creatures have \"{T}: Add {G}{G}.\"\nWhenever chaos ensues, untap all creatures you control.","type":"Plane — Dominaria","types":["Plane"],"uuid":"c127834b-1613-5f5c-a4fd-5a6fe7b5c255"},{"artist":"James Paick","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211785,"name":"Der Mahlstrom","text":"Wenn du zum Mahlstrom weltenwanderst oder zu Beginn deines Versorgungssegments kannst du die oberste Karte deiner Bibliothek offen vorzeigen. Falls es eine bleibende Karte ist, kannst du sie ins Spiel bringen. Lege die Karte sonst unter deine Bibliothek.\nImmer wenn du chaos würfelst, bringe eine bleibende Karte deiner Wahl aus deinem Friedhof ins Spiel zurück.","type":"Welt — Alara"},{"language":"Spanish","multiverseId":211920,"name":"El Remolino","text":"Cuando camines por los planos hacia El Remolino o al comienzo de tu mantenimiento, puedes mostrar la primera carta de tu biblioteca. Si es una carta de permanente, puedes ponerla en el campo de batalla. De lo contrario, pon esa carta en el fondo de tu biblioteca.\nSiempre que lances caos, regresa al campo de batalla la carta de permanente objetivo de tu cementerio.","type":"Plano — Alara"},{"language":"French","multiverseId":211875,"name":"Le Maelstrom","text":"Quand vous vous transplanez vers Le Maelstrom ou au début de votre entretien, vous pouvez révéler la carte du dessus de votre bibliothèque. Si c'est une carte de permanent, vous pouvez la mettre sur le champ de bataille. Sinon, mettez cette carte au-dessous de votre bibliothèque.\nÀ chaque fois que vous obtenez chaos, renvoyez sur le champ de bataille une carte de permanent ciblée depuis votre cimetière.","type":"Plan : Alara"},{"language":"Italian","multiverseId":211830,"name":"Il Maelstrom","text":"Quando viaggi tra i piani fino al Maelstrom o all'inizio del tuo mantenimento, puoi rivelare la prima carta del tuo grimorio. Se è una carta permanente, puoi metterla sul campo di battaglia. Altrimenti, mettila in fondo al tuo grimorio.\nOgniqualvolta tiri caos, rimetti sul campo di battaglia una carta permanente bersaglio dal tuo cimitero.","type":"Piano — Alara"},{"language":"Japanese","multiverseId":211965,"name":"大渦","text":"あなたが大渦へプレインズウォークしたときかあなたのアップキープの開始時に、あなたはあなたのライブラリーの一番上のカードを公開してもよい。 それがパーマネント・カードである場合、あなたはそれを戦場に出してもよい。 そうでない場合、そのカードをあなたのライブラリーの一番下に置く。\nあなたがchaosを出すたび、あなたの墓地にあるパーマネント・カード１枚を対象とし、それを戦場に戻す。","type":"次元 — アラーラ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127765","mcmId":"21497","mtgjsonV4Id":"1b56b095-9f0a-55e9-8566-aee7903b2b9a","multiverseId":"198062","scryfallId":"e100595e-895b-442a-83c1-b2f89523e207","scryfallIllustrationId":"a2f52e01-c6b3-42d1-993f-bb93a29b91da","scryfallOracleId":"e28deac5-d3c4-48e9-974c-093e3122f317","tcgplayerProductId":"37309"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"The Maelstrom","number":"23","originalText":"When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. Otherwise, put that card on the bottom of your library.\nWhenever you roll chaos, return target permanent card from your graveyard to the battlefield.","originalType":"Plane - Alara","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/72b8fcf116581332","tcgplayer":"https://mtgjson.com/links/d2ebb1b483e10352"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"A permanent card is an artifact, creature, enchantment, land, or planeswalker card."},{"date":"2009-10-01","text":"As The Maelstrom’s first ability resolves, you choose whether or not to reveal the top card of your library. If you reveal it and it’s a permanent card, you have two choices: Put it onto the battlefield, or put it on the bottom of your library. It can’t remain on top of your library. On the other hand, if you reveal it and it’s an instant or sorcery card, it must be put on the bottom of your library. There is no way you can leave a card revealed this way on top of your library."},{"date":"2009-10-01","text":"If you reveal a permanent card that can’t enter the battlefield (because it’s an Aura and there’s nothing it can enchant, for example), then you must put it on the bottom of your library."}],"setCode":"OHOP","subtypes":["Alara"],"supertypes":[],"text":"When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. If you revealed a card but didn't put it onto the battlefield, put it on the bottom of your library.\nWhenever chaos ensues, return target permanent card from your graveyard to the battlefield.","type":"Plane — Alara","types":["Plane"],"uuid":"9bcc93b7-802b-5735-979b-8c994b19693b"},{"artist":"Charles Urbach","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211786,"name":"Minamo","text":"Immer wenn ein Spieler einen Zauberspruch wirkt, kann dieser Spieler eine Karte ziehen.\nImmer wenn du chaos würfelst, kann jeder Spieler eine blaue Karte aus seinem Friedhof auf seine Hand zurücknehmen.","type":"Welt — Kamigawa"},{"language":"Spanish","multiverseId":211921,"name":"Minamo","text":"Siempre que un jugador lance un hechizo, ese jugador puede robar una carta.\nSiempre que lances caos, cada jugador puede regresar una carta azul de su cementerio a su mano.","type":"Plano — Kamigawa"},{"language":"French","multiverseId":211876,"name":"Minamo","text":"À chaque fois qu'un joueur lance un sort, ce joueur peut piocher une carte.\nÀ chaque fois que vous obtenez chaos, chaque joueur peut renvoyer dans sa main une carte bleue de son cimetière.","type":"Plan : Kamigawa"},{"language":"Italian","multiverseId":211831,"name":"Minamo","text":"Ogniqualvolta un giocatore lancia una magia, quel giocatore può pescare una carta.\nOgniqualvolta tiri caos, ogni giocatore può riprendere in mano una carta blu dal proprio cimitero.","type":"Piano — Kamigawa"},{"language":"Japanese","multiverseId":211966,"name":"水面院","text":"いずれかのプレイヤーが呪文を１つ唱えるたび、そのプレイヤーはカードを１枚引いてもよい。\nあなたがchaosを出すたび、各プレイヤーは自分の墓地にある青のカードを１枚、自分の手札に戻してもよい。","type":"次元 — 神河"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127745","mcmId":"21498","mtgjsonV4Id":"151401b9-f3cf-532e-9ac5-911eff955251","multiverseId":"198078","scryfallId":"68eab027-f8e7-41bd-8a5c-e9c65ecec6ad","scryfallIllustrationId":"ccae9ab7-8edc-4f31-a398-8ceb8013c301","scryfallOracleId":"6491f511-87e6-4504-84f5-fe5cf44768d7","tcgplayerProductId":"37288"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Minamo","number":"24","originalText":"Whenever a player casts a spell, that player may draw a card.\nWhenever you roll chaos, each player may return a blue card from his or her graveyard to his or her hand.","originalType":"Plane - Kamigawa","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/93c3c45e4384d2b9","tcgplayer":"https://mtgjson.com/links/e857e1b021866b2e"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Minamo’s first ability resolves before the spell that caused it to trigger."},{"date":"2009-10-01","text":"The chaos ability doesn’t target the cards it will return, so they’re not chosen until resolution. As the ability resolves, first the active player may choose a blue card in their graveyard, then each other player in turn order does the same, then all cards chosen this way are returned to their owners’ hands. Once a card is chosen, it’s too late for players to respond."}],"setCode":"OHOP","subtypes":["Kamigawa"],"supertypes":[],"text":"Whenever a player casts a spell, that player may draw a card.\nWhenever chaos ensues, each player may return a blue card from their graveyard to their hand.","type":"Plane — Kamigawa","types":["Plane"],"uuid":"2f00dd23-b08b-5320-8939-e3f83339c707"},{"artist":"Jung Park","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211787,"name":"Murasa","text":"Immer wenn eine Kreatur, die kein Spielstein ist, ins Spiel kommt, kann ihr Beherrscher seine Bibliothek nach einem Standardland durchsuchen, dieses getappt ins Spiel bringen und dann seine Bibliothek mischen.\nImmer wenn du chaos würfelst, wird ein Land deiner Wahl zu einer 4/4 Kreatur, die weiterhin ein Land ist.","type":"Welt — Zendikar"},{"language":"Spanish","multiverseId":211922,"name":"Murasa","text":"Siempre que una criatura que no sea ficha entre al campo de batalla, su controlador puede buscar en su biblioteca una carta de tierra básica, ponerla en el campo de batalla girada y luego barajar su biblioteca.\nSiempre que lances caos, la tierra objetivo se convierte en una criatura 4/4 que sigue siendo una tierra.","type":"Plano — Zendikar"},{"language":"French","multiverseId":211877,"name":"Murasa","text":"À chaque fois qu'une créature non-jeton arrive sur le champ de bataille, son contrôleur peut chercher une carte de terrain de base dans sa bibliothèque, la mettre sur le champ de bataille engagée et mélanger ensuite sa bibliothèque.\nÀ chaque fois que vous obtenez chaos, le terrain ciblé devient une créature 4/4 qui est encore un terrain.","type":"Plan : Zendikar"},{"language":"Italian","multiverseId":211832,"name":"Murasa","text":"Ogniqualvolta una creatura non pedina entra nel campo di battaglia, il suo controllore può passare in rassegna il suo grimorio per una carta terra base, metterla sul campo di battaglia TAPpata, poi rimescolare il suo grimorio.\nOgniqualvolta tiri caos, una terra bersaglio diventa una creatura 4/4 che è ancora una terra.","type":"Piano — Zendikar"},{"language":"Japanese","multiverseId":211967,"name":"ムラーサ","text":"トークンでないクリーチャーが１体戦場に出るたび、それのコントローラーは自分のライブラリーから基本土地カードを１枚探してもよい。そうしたなら、そのプレイヤーはそのカードをタップ状態で戦場に出し、その後自分のライブラリーを切り直す。\nあなたがchaosを出すたび、土地１つを対象とする。それは４/４のクリーチャーになる。それは土地でもある。","type":"次元 — ゼンディカー"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127746","mcmId":"21499","mtgjsonV4Id":"c2c07bd9-2e40-5b0e-8302-718a650513f9","multiverseId":"198074","scryfallId":"89a65a8e-8e91-40e4-bbde-c678d572fbb0","scryfallIllustrationId":"8e53e26f-9988-4659-8a47-0e0297ee3d26","scryfallOracleId":"07cc253d-e23c-450c-bfaf-5cb6a3a588ce","tcgplayerProductId":"37289"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Murasa","number":"25","originalText":"Whenever a nontoken creature enters the battlefield, its controller may search his or her library for a basic land card, put it onto the battlefield tapped, then shuffle his or her library.\nWhenever you roll chaos, target land becomes a 4/4 creature that's still a land.","originalType":"Plane - Zendikar","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/064c81b81fce1b58","tcgplayer":"https://mtgjson.com/links/4d16fd83e1153939"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"The effect of the chaos ability has no duration. The affected land will remain a creature until the end of the game, it leaves the battlefield, or some other effect changes its card types, whichever comes first. It doesn’t matter whether Murasa remains the face-up plane card."}],"setCode":"OHOP","subtypes":["Zendikar"],"supertypes":[],"text":"Whenever a nontoken creature enters the battlefield, its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever chaos ensues, target land becomes a 4/4 creature that's still a land.","type":"Plane — Zendikar","types":["Plane"],"uuid":"c931af94-a889-56bd-aeb4-bd2a6ec8195e"},{"artist":"Mark Zug","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211788,"name":"Die Insel Naar","text":"Lege zu Beginn deines Versorgungssegments eine Flammenmarke auf die Insel Naar, dann fügt die Insel Naar dir so viele Schadenspunkte zu, wie Flammenmarken auf ihr liegen.\nImmer wenn du chaos würfelst, fügt die Insel Naar einem Spieler deiner Wahl 3 Schadenspunkte zu.","type":"Welt — Wildfeuer"},{"language":"Spanish","multiverseId":211923,"name":"Isla Naar","text":"Al comienzo de tu mantenimiento, pon un contador de llama sobre la Isla Naar, luego la Isla Naar te hace daño igual a la cantidad de contadores de llama sobre ella.\nSiempre que lances caos, la Isla Naar le hace 3 puntos de daño al jugador objetivo.","type":"Plano — Dominio Ígneo"},{"language":"French","multiverseId":211878,"name":"Île de Naâr","text":"Au début de votre entretien, mettez un marqueur « flamme » sur l'Île de Naâr. L'Île de Naâr vous inflige ensuite un nombre de blessures égal au nombre de marqueurs « flamme » sur elle.\nÀ chaque fois que vous obtenez chaos, l'Île de Naâr inflige 3 blessures au joueur ciblé.","type":"Plan : Grégefeu"},{"language":"Italian","multiverseId":211833,"name":"Isola Naar","text":"All'inizio del tuo mantenimento, metti un segnalino fiamma sull'Isola Naar, poi l'Isola Naar ti infligge danno pari al numero di segnalini fiamma su di esso.\nOgniqualvolta tiri caos, l'Isola Naar infligge 3 danni a un giocatore bersaglio.","type":"Piano — Fuoco Ribelle"},{"language":"Japanese","multiverseId":211968,"name":"ナー島","text":"あなたのアップキープの開始時に、ナー島の上に火炎カウンターを１個置く。その後ナー島はあなたに、自身の上に置かれている火炎カウンターの数に等しい点数のダメージを与える。\nあなたがchaosを出すたび、プレイヤー１人を対象とする。ナー島はそのプレイヤーに３点のダメージを与える。","type":"次元 — ワイルドファイア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127747","mcmId":"21500","mtgjsonV4Id":"40a5d3d5-bf2e-5e43-be0d-76bd352555a4","multiverseId":"198070","scryfallId":"3441027c-4d8e-48d4-9121-89e4ea4e9481","scryfallIllustrationId":"6643bb2a-61ef-4dba-a167-bbeef967c827","scryfallOracleId":"3e0bcf65-1eaf-440f-a59b-0b11e1106135","tcgplayerProductId":"37290"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Naar Isle","number":"26","originalText":"At the beginning of your upkeep, put a flame counter on Naar Isle, then Naar Isle deals damage to you equal to the number of flame counters on it.\nWhenever you roll chaos, Naar Isle deals 3 damage to target player.","originalType":"Plane - Wildfire","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/04f7fd212024861b","tcgplayer":"https://mtgjson.com/links/c415e742f9e2c731"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Wildfire"],"supertypes":[],"text":"At the beginning of your upkeep, put a flame counter on Naar Isle, then Naar Isle deals damage to you equal to the number of flame counters on it.\nWhenever chaos ensues, Naar Isle deals 3 damage to target player or planeswalker.","type":"Plane — Wildfire","types":["Plane"],"uuid":"520c6d22-6e97-5e19-9e4a-086d9ef1a99d"},{"artist":"Zoltan Boros & Gabor Szikszai","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211789,"name":"Naya","text":"Du darfst eine beliebige Anzahl zusätzlicher Länder während jedes deiner Züge ausspielen.\nImmer wenn du chaos würfelst, erhält eine rote, grüne oder weiße Kreatur, die du kontrollierst, bis zum Ende des Zuges +1/+1 für jedes Land, das du kontrollierst.","type":"Welt — Alara"},{"language":"Spanish","multiverseId":211924,"name":"Naya","text":"Puedes jugar cualquier cantidad de tierras adicionales en cada uno de tus turnos.\nSiempre que lances caos, la criatura objetivo roja, verde o blanca que controlas obtiene +1/+1 hasta el final del turno por cada tierra que controles.","type":"Plano — Alara"},{"language":"French","multiverseId":211879,"name":"Naya","text":"Vous pouvez jouer n'importe quel nombre de terrains supplémentaires pendant chacun de vos tours.\nÀ chaque fois que vous obtenez chaos, la créature rouge, verte ou blanche que vous contrôlez gagne +1/+1 jusqu'à la fin du tour pour chaque terrain que vous contrôlez.","type":"Plan : Alara"},{"language":"Italian","multiverseId":211834,"name":"Naya","text":"Puoi giocare un qualsiasi numero di terre addizionali in ognuno dei tuoi turni.\nOgniqualvolta tiri caos, una creatura bersaglio rossa, verde o bianca che controlli prende +1/+1 fino alla fine del turno per ogni terra che controlli.","type":"Piano — Alara"},{"language":"Japanese","multiverseId":211969,"name":"ナヤ","text":"あなたの各ターンに、あなたは追加の土地を望む枚数プレイしてもよい。\nあなたがchaosを出すたび、あなたがコントロールする赤か緑か白のクリーチャー１体を対象とする。それはターン終了時まで、あなたがコントロールする土地１つにつき＋１/＋１の修整を受ける。","type":"次元 — アラーラ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127748","mcmId":"21501","mtgjsonV4Id":"25100cc5-c1a7-5f43-9c18-162be151d246","multiverseId":"198103","scryfallId":"6e17f67b-60a0-4858-9454-92b35dee08a6","scryfallIllustrationId":"b20bc437-5f07-4cc9-a170-2c9b4752a1ea","scryfallOracleId":"5ed6be01-af06-4f3d-8b43-ef8993c52c97","tcgplayerProductId":"37291"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Naya","number":"27","originalText":"You may play any number of additional lands on each of your turns.\nWhenever you roll chaos, target red, green, or white creature you control gets +1/+1 until end of turn for each land you control.","originalType":"Plane - Alara","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/af4da746f09b9307","tcgplayer":"https://mtgjson.com/links/9b5a530488b7e85d"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you play lands using Naya’s first ability, and then you planeswalk away from Naya, the lands you played still count as additional land plays for the turn. If you haven’t already, you can still play a land using your standard land play."},{"date":"2009-10-01","text":"The bonus granted by the chaos ability is determined at the time it resolves. It won’t change if the number of lands you control changes later in the turn."}],"setCode":"OHOP","subtypes":["Alara"],"supertypes":[],"text":"You may play any number of lands on each of your turns.\nWhenever chaos ensues, target red, green, or white creature you control gets +1/+1 until end of turn for each land you control.","type":"Plane — Alara","types":["Plane"],"uuid":"20292b6d-bcac-5bb3-8fa0-d190b2f92aba"},{"artist":"Charles Urbach","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211790,"name":"Otaria","text":"Spontanzauber und Hexereien in den Friedhöfen haben Rückblende. Die Rückblendekosten sind gleich ihrer Manakosten. (Ihr Besitzer kann die Karte für ihre Manakosten aus seinem Friedhof wirken. Danach schickt er sie ins Exil.)\nImmer wenn du chaos würfelst, erhältst du nach diesem Zug einen weiteren Zug.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211925,"name":"Otaria","text":"Las cartas de instantáneo y conjuro en los cementerios tienen la habilidad de retrospectiva. El coste de retrospectiva es igual al coste de maná de la carta. (Su propietario puede lanzar la carta desde su cementerio por su coste de maná. Luego la exilia.)\nSiempre que lances caos, toma un turno extra después de éste.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211880,"name":"Otaria","text":"Les cartes d'éphémère et de rituel dans les cimetières ont le flashback. Le coût de flashback est égal au coût de mana de la carte. (Son propriétaire peut lancer la carte depuis son cimetière pour son coût de mana. Il l'exile ensuite.)\nÀ chaque fois que vous obtenez chaos, jouez un tour supplémentaire après celui-ci.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211835,"name":"Otaria","text":"Le carte istantaneo e stregoneria nei cimiteri hanno flashback. Il costo di flashback è pari al costo di mana della carta. (Il suo proprietario può lanciare la carta dal proprio cimitero per il suo costo di mana. Poi la esilia.)\nOgniqualvolta tiri caos, gioca un altro turno dopo questo.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211970,"name":"オタリア","text":"墓地にあるインスタント・カードとソーサリー・カードはフラッシュバックを持つ。 そのフラッシュバック・コストは、そのカード自身のマナ・コストに等しい。 （そのカードのオーナーはそれを自分の墓地からそれのマナ・コストでプレイしてもよい。その後、そのプレイヤーはそれを追放する。）\nあなたがchaosを出すたび、このターンに続いて追加の１ターンを行う。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127749","mcmId":"21502","mtgjsonV4Id":"16c01eea-4baf-55ea-90ca-16032e3ecaee","multiverseId":"198095","scryfallId":"899c4e17-b8f5-4090-b4e3-5c31553b97f6","scryfallIllustrationId":"cf2338ee-d708-47ef-8510-444ce9b499a2","scryfallOracleId":"29e3371d-aa41-46a9-921a-96565be47eff","tcgplayerProductId":"37292"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Otaria","number":"28","originalText":"Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from his or her graveyard for its mana cost. Then he or she exiles it.)\nWhenever you roll chaos, take an extra turn after this one.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/69752c89a34f30c9","tcgplayer":"https://mtgjson.com/links/10052f69a77b0422"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you use a card’s flashback ability, you’re actually casting that card. It moves from your graveyard to the stack. Abilities that trigger when you cast a spell will trigger. That spell can be countered."},{"date":"2009-10-01","text":"If you cast a card by using flashback, you cast that card from your graveyard rather than your hand, and you pay an alternative cost rather than its mana cost, but everything else about casting that spell works normally. You must follow timing restrictions based on the card’s type (if it’s a sorcery), as well as other restrictions (such as “Cast [this card] only before blockers are declared”). You may pay additional costs (such as kicker). Effects that cause you to pay more or less for a spell will apply."},{"date":"2009-10-01","text":"As a spell cast with flashback resolves, it never goes to its owner’s graveyard, so abilities that trigger on cards being put in a graveyard won’t trigger. The card is exiled instead."},{"date":"2009-10-01","text":"If a spell cast by using flashback is countered, it’s still exiled rather than being put into its owner’s graveyard."},{"date":"2009-10-01","text":"If you use the flashback ability granted by Otaria to cast a split card from your graveyard, the flashback cost you pay is equal to the mana cost of the half that you’re casting."},{"date":"2009-10-01","text":"If you use the flashback ability granted by Otaria to cast a card with X in its mana cost from your graveyard, you choose the value of X as you cast it. You’ll still have to pay that X."},{"date":"2009-10-01","text":"Otaria may cause an instant or sorcery card in a graveyard to have multiple flashback abilities. Its owner may cast it using any one of those abilities."},{"date":"2009-10-01","text":"If you roll {CHAOS} multiple times in the same turn, you’ll take that many extra turns after this one."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from their graveyard for its mana cost. Then they exile it.)\nWhenever chaos ensues, take an extra turn after this one.","type":"Plane — Dominaria","types":["Plane"],"uuid":"149d818e-8b1a-52cc-81a8-99750bbaddae"},{"artist":"John Avon","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211791,"name":"Panopticon","text":"Wenn du nach Panopticon weltenwanderst, ziehe eine Karte.\nZiehe zu Beginn deines Ziehsegments eine zusätzliche Karte.\nImmer wenn du chaos würfelst, ziehe eine Karte.","type":"Welt — Mirrodin"},{"language":"Spanish","multiverseId":211926,"name":"Panópticon","text":"Cuando camines por los planos hacia el Panópticon, roba una carta.\nAl comienzo de tu paso de robar, roba una carta adicional.\nSiempre que lances caos, roba una carta.","type":"Plano — Mirrodín"},{"language":"French","multiverseId":211881,"name":"Panopticon","text":"Quand vous vous transplanez vers Panopticon, piochez une carte.\nAu début de votre étape de pioche, piochez une carte supplémentaire.\nÀ chaque fois que vous obtenez chaos, piochez une carte.","type":"Plan : Mirrodin"},{"language":"Italian","multiverseId":211836,"name":"Panottico","text":"Quando viaggi tra i piani fino al Panottico, pesca una carta.\nAll'inizio della tua acquisizione, pesca una carta addizionale.\nOgniqualvolta tiri caos, pesca una carta.","type":"Piano — Mirrodin"},{"language":"Japanese","multiverseId":211971,"name":"パノプティコン","text":"あなたがパノプティコンにプレインズウォークしたとき、カードを１枚引く。\nあなたのドロー・ステップの開始時に、あなたはカードを追加で１枚引く。\nあなたがchaosを出すたび、カードを１枚引く。","type":"次元 — ミラディン"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127750","mcmId":"21503","mtgjsonV4Id":"b4dd95a0-29da-5093-ad83-f72aad49700e","multiverseId":"198064","scryfallId":"f60f7d4e-1a78-402a-a70e-c42f4950f31d","scryfallIllustrationId":"5b6e4da5-b691-4465-91cb-264a9109d38a","scryfallOracleId":"cd8ce6f1-9753-40a7-a625-5ed63c15c29e","tcgplayerProductId":"37293"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Panopticon","number":"29","originalText":"When you planeswalk to Panopticon, draw a card.\nAt the beginning of your draw step, draw an additional card.\nWhenever you roll chaos, draw a card.","originalType":"Plane - Mirrodin","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/c9b291787cc6093f","tcgplayer":"https://mtgjson.com/links/8cd0d1265e5ec3f1"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Mirrodin"],"supertypes":[],"text":"When you planeswalk to Panopticon, draw a card.\nAt the beginning of your draw step, draw an additional card.\nWhenever chaos ensues, draw a card.","type":"Plane — Mirrodin","types":["Plane"],"uuid":"830f9da8-31bb-50e4-b52c-d0f5352ea0e5"},{"artist":"Jason Chan","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211792,"name":"Teiche der Entstehung","text":"Lege zu Beginn deines Endsegments die Karten, die du auf der Hand hast, in beliebiger Reihenfolge unter deine Bibliothek und ziehe dann ebenso viele Karten.\nImmer wenn du chaos würfelst, decke die obersten drei Karten deines Weltendecks auf. Alle chaos-Fähigkeiten der aufgedeckten Karten werden ausgelöst. Lege dann die auf diese Weise aufgedeckten Karten in beliebiger Reihenfolge unter dein Weltendeck.","type":"Welt — Bolas' Meditationsreich"},{"language":"Spanish","multiverseId":211927,"name":"Estanques de Creación","text":"Al comienzo de tu paso final, pon las cartas de tu mano en el fondo de tu biblioteca en cualquier orden, luego roba esa misma cantidad de cartas.\nSiempre que lances caos, muestra las primeras tres cartas de tu mazo planar. La habilidad de caos de cada una de las cartas mostradas se dispara. Luego pon las cartas mostradas en el fondo de tu mazo planar en cualquier orden.","type":"Plano — Reino de Meditación de Nicol Bolas"},{"language":"French","multiverseId":211882,"name":"Bassins de transition","text":"Au début de votre étape de fin, mettez les cartes de votre main au-dessous de votre bibliothèque, dans l'ordre de votre choix, et piochez ensuite autant de cartes.\nÀ chaque fois que vous obtenez chaos, révélez les trois cartes du dessus de votre deck planaire. Chacune des capacités chaos des cartes révélées se déclenche. Mettez ensuite les cartes ainsi révélées au-dessous de votre deck planaire, dans l'ordre de votre choix.","type":"Plan : Royaume de méditation de Bolas"},{"language":"Italian","multiverseId":211837,"name":"Pozze del Divenire","text":"All'inizio della tua sottofase finale, metti le carte dalla tua mano in fondo al tuo grimorio in qualsiasi ordine, poi pesca altrettante carte.\nOgniqualvolta tiri caos, rivela le prime tre carte del tuo mazzo planare. Ognuna delle abilità di caos delle carte rivelate si innesca. Poi metti le carte rivelate in fondo al tuo mazzo planare in qualsiasi ordine.","type":"Piano — Reame della Meditazione di Bolas"},{"language":"Japanese","multiverseId":211972,"name":"生達の池","text":"あなたの終了ステップの開始時に、あなたの手札にあるカードをあなたのライブラリーの一番下に望む順番で置き、その枚数に等しい枚数のカードを引く。\nあなたがchaosを出すたび、あなたの次元デッキの一番上から３枚のカードを公開する。 公開した各カードのchaos能力が誘発する。 その後、これにより公開されたすべてのカードを、あなたの次元デッキの一番下に望む順番で置く。","type":"次元 — ボーラスの・瞑想・領土"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127751","mcmId":"21504","mtgjsonV4Id":"c081fbe8-52e7-530a-b809-4912a9612b9d","multiverseId":"198080","scryfallId":"6e9949a2-7cc5-42a7-86b6-8517a21fd390","scryfallIllustrationId":"55170f25-6bd2-41c4-a5af-5b22891ebb86","scryfallOracleId":"f133e42a-2962-4781-b413-ce2127f17c26","tcgplayerProductId":"37294"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Pools of Becoming","number":"30","originalText":"At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever you roll chaos, reveal the top three cards of your planar deck. Each of the revealed cards' chaos abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.","originalType":"Plane - Bolas's Meditation Realm","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/a4c1bc67911517ad","tcgplayer":"https://mtgjson.com/links/f67c1713a607141e"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"The face-up plane card isn’t currently part of its owner’s planar deck. If the chaos ability is rolled by the owner of Pools of Becoming, Pools of Becoming is not one of the three cards that are revealed."},{"date":"2009-10-01","text":"You may put the chaos abilities of the three revealed plane cards on the stack in any order. The last one you put on the stack will be the first one to resolve."},{"date":"2009-10-01","text":"If one of the revealed plane cards is another Pools of Becoming, its chaos ability triggers. When it resolves, you’ll reveal three more cards from the top of your planar deck, their chaos abilities will trigger, and you’ll put them on the stack in any order on top of any remaining chaos abilities from the first Pools of Becoming’s effect."}],"setCode":"OHOP","subtypes":["Bolas's Meditation Realm"],"supertypes":[],"text":"At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever chaos ensues, reveal the top three cards of your planar deck. Each of the revealed cards' {CHAOS} abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.","type":"Plane — Bolas's Meditation Realm","types":["Plane"],"uuid":"670372ec-de3a-5973-bcfb-079005948607"},{"artist":"Omar Rayyan","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211793,"name":"Rabenrevier","text":"Alle Kreaturen haben Verdorren. (Sie fügen Kreaturen Schaden in Form von -1/-1-Marken zu.)\nImmer wenn du chaos würfelst, lege eine -1/-1-Marke auf eine Kreatur deiner Wahl, zwei -1/-1-Marken auf eine andere Kreatur deiner Wahl und drei -1/-1-Marken auf eine dritte Kreatur deiner Wahl.","type":"Welt — Schattenmoor"},{"language":"Spanish","multiverseId":211928,"name":"Coto de Cuervos","text":"Todas las criaturas tienen la habilidad de debilitar. (Hacen daño a las criaturas en forma de contadores -1/-1.)\nSiempre que lances caos, pon un contador -1/-1 sobre la criatura objetivo, dos contadores -1/-1 sobre otra criatura objetivo y tres contadores -1/-1 sobre una tercera criatura objetivo.","type":"Plano — Páramo Sombrío"},{"language":"French","multiverseId":211883,"name":"Garenne du Corbeau","text":"Toutes les créatures ont la flétrissure. (Elles infligent des blessures aux créatures sous la forme de marqueurs -1/-1.)\nÀ chaque fois que vous obtenez chaos, mettez un marqueur -1/-1 sur une créature ciblée, deux marqueurs -1/-1 sur une autre créature ciblée, et trois marqueurs -1/-1 sur une troisième créature ciblée.","type":"Plan : Sombrelande"},{"language":"Italian","multiverseId":211838,"name":"Volo del Corvo","text":"Tutte le creature hanno avvizzire. (Una fonte con avvizzire infligge danno alle creature sotto forma di segnalini -1/-1.)\nOgniqualvolta tiri caos, metti un segnalino -1/-1 su una creatura bersaglio, due segnalini -1/-1 su un'altra creatura bersaglio e tre segnalini -1/-1 su una terza creatura bersaglio.","type":"Piano — Landa Tenebrosa"},{"language":"Japanese","multiverseId":211973,"name":"レイヴンの地","text":"すべてのクリーチャーは萎縮を持つ。 （それらはクリーチャーに－１/－１カウンターの形でダメージを与える。）\nあなたがchaosを出すたび、クリーチャー１体と、他のクリーチャー１体と、他のクリーチャー１体を対象とする。その１体目の上に－１/－１カウンターを１個置き、その２体目の上に－１/－１カウンターを２個置き、その３体目の上に－１/－１カウンターを３個置く。","type":"次元 — シャドウムーア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127752","mcmId":"21505","mtgjsonV4Id":"c7da9016-5df5-52b9-9677-df20270b1fab","multiverseId":"198076","scryfallId":"9a903d2a-d67f-4e45-a64d-223ac3b51dd7","scryfallIllustrationId":"01a7ef60-261a-4813-a9ca-b246e4a9d298","scryfallOracleId":"b53e06af-be18-4f75-9dd0-7494ec867b13","tcgplayerProductId":"37295"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Raven's Run","number":"31","originalText":"All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever you roll chaos, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.","originalType":"Plane - Shadowmoor","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/2931b531685ad8a7","tcgplayer":"https://mtgjson.com/links/6e501660be3a80bc"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Wither applies to any damage, not just combat damage."},{"date":"2009-10-01","text":"The -1/-1 counters that result from wither remain on the damaged creature indefinitely. They won’t be removed if the creature regenerates or the turn ends."},{"date":"2009-10-01","text":"Since damage from a creature with wither is real damage, it follows all the other rules for damage. It can be prevented or redirected. When it’s dealt, it will cause “Whenever [this creature] deals damage” and “Whenever [this creature] is dealt damage” abilities to trigger."},{"date":"2009-10-01","text":"If the source of the damage is still on the battlefield at the time that damage is dealt, its characteristics are checked to see if it has wither. If the source has left the battlefield by then, its last existence on the battlefield is checked to see if it had wither."},{"date":"2009-10-01","text":"Damage from creatures with wither affects players and planeswalkers normally."},{"date":"2009-10-01","text":"Multiple instances of wither are redundant."},{"date":"2009-10-01","text":"You must target three different creatures when the chaos ability triggers, even if that means you have to target creatures you control. If you can’t target three creatures (because there are just two creatures on the battlefield, perhaps), the ability is removed from the stack and does nothing."}],"setCode":"OHOP","subtypes":["Shadowmoor"],"supertypes":[],"text":"All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever chaos ensues, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.","type":"Plane — Shadowmoor","types":["Plane"],"uuid":"ff6e1f65-3468-5227-a52a-ea14113897b4"},{"artist":"Rob Alexander","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211794,"name":"Das Heiligtum von Serra","text":"Wenn du vom Heiligtum von Serra weg weltenwanderst, zerstöre alle bleibenden Karten, die kein Land sind.\nImmer wenn du chaos würfelst, kannst du deinen Lebenspunktestand 20 werden lassen.","type":"Welt — Serras Reich"},{"language":"Spanish","multiverseId":211929,"name":"Santuario de Serra","text":"Cuando camines por los planos desde el Santuario de Serra, destruye todos los permanentes que no sean tierra.\nSiempre que lances caos, puedes hacer que tu total de vidas sea 20.","type":"Plano — Reino de Serra"},{"language":"French","multiverseId":211884,"name":"Le Sanctuaire de Serra","text":"Quand vous vous transplanez depuis Le Sanctuaire de Serra, détruisez tous les permanents non-terrain.\nÀ chaque fois que vous obtenez chaos, vous pouvez faire que votre total de points de vie devienne 20.","type":"Plan : Royaume de Serra"},{"language":"Italian","multiverseId":211839,"name":"Santuario di Serra","text":"Quando viaggi tra i piani dal Santuario di Serra, distruggi tutti i permanenti non terra.\nOgniqualvolta tiri caos, puoi portare a 20 i tuoi punti vita.","type":"Piano — Reame di Serra"},{"language":"Japanese","multiverseId":211974,"name":"セラの聖所","text":"あなたがセラの聖所からプレインズウォークしたとき、すべての土地でないパーマネントを破壊する。\nあなたがchaosを出すたび、あなたはあなたのライフの総量を20点にしてもよい。","type":"次元 — セラの・領土"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127753","mcmId":"21506","mtgjsonV4Id":"d1eec663-c084-5881-b537-26db97627200","multiverseId":"198079","scryfallId":"65bbd325-8438-4742-a537-7e9e2b9a4497","scryfallIllustrationId":"95980fcd-ee4b-47b5-9153-0da76860065a","scryfallOracleId":"f0c8ce35-b627-485c-bd64-d7eae47b8efa","tcgplayerProductId":"37296"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Sanctum of Serra","number":"32","originalText":"When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever you roll chaos, you may have your life total become 20.","originalType":"Plane - Serra's Realm","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/3c733074c888f77a","tcgplayer":"https://mtgjson.com/links/418be68eabcca0b0"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you planeswalk away from Sanctum of Serra because the player who owns Sanctum of Serra leaves the game, its first ability will still trigger and resolve."},{"date":"2009-10-01","text":"For a player’s life total to become 20, what actually happens is that the player gains or loses the appropriate amount of life. For example, if your life total is 14 when this ability resolves, it will cause you to gain 6 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."}],"setCode":"OHOP","subtypes":["Serra’s Realm"],"supertypes":[],"text":"When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever chaos ensues, you may have your life total become 20.","type":"Plane — Serra’s Realm","types":["Plane"],"uuid":"ed7e28c5-c9d2-59a8-802b-d05d096dd9c4"},{"artist":"Jim Nelson","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211795,"name":"Das Sandmeer","text":"Alle Spieler zeigen alle Karten offen vor, die sie ziehen.\nImmer wenn ein Spieler ein Land zieht, erhält dieser Spieler 3 Lebenspunkte dazu.\nImmer wenn ein Spieler eine Karte zieht, die kein Land ist, verliert dieser Spieler 3 Lebenspunkte.\nImmer wenn du chaos würfelst, lege eine bleibende Karte deiner Wahl aus dem Spiel oben auf die Bibliothek ihres Besitzers.","type":"Welt — Rabiah"},{"language":"Spanish","multiverseId":211930,"name":"Mar de Arena","text":"Los jugadores muestran cada carta que roban.\nSiempre que un jugador robe una carta de tierra, ese jugador gana 3 vidas.\nSiempre que un jugador robe una carta que no sea tierra, ese jugador pierde 3 vidas.\nSiempre que lances caos, pon el permanente objetivo en la parte superior de la biblioteca de su propietario.","type":"Plano — Rabiah"},{"language":"French","multiverseId":211885,"name":"Mer de sable","text":"Les joueurs révèlent chaque carte qu'ils piochent.\nÀ chaque fois qu'un joueur pioche une carte de terrain, ce joueur gagne 3 points de vie.\nÀ chaque fois qu'un joueur pioche une carte non-terrain, ce joueur perd 3 points de vie.\nÀ chaque fois que vous obtenez chaos, mettez le permanent ciblé au-dessus de la bibliothèque de son propriétaire.","type":"Plan : Rabiah"},{"language":"Italian","multiverseId":211840,"name":"Mare di Sabbia","text":"I giocatori rivelano ogni carta che pescano.\nOgniqualvolta un giocatore pesca una carta terra, guadagna 3 punti vita.\nOgniqualvolta un giocatore pesca una carta non terra, perde 3 punti vita.\nOgniqualvolta tiri caos, metti un permanente bersaglio in cima al grimorio del suo proprietario.","type":"Piano — Rabiah"},{"language":"Japanese","multiverseId":211975,"name":"砂の海","text":"プレイヤーは自分が引いた各カードを公開する。\nいずれかのプレイヤーが土地カードを１枚引くたび、そのプレイヤーはライフを３点得る。\nいずれかのプレイヤーが土地でないカードを１枚引くたび、そのプレイヤーはライフを３点失う。\nあなたがchaosを出すたび、パーマネント１つを対象とし、それをオーナーのライブラリーの一番上に置く。","type":"次元 — ラバイア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127754","mcmId":"21507","mtgjsonV4Id":"abc035c3-27f3-5385-b871-5fee3546f1f9","multiverseId":"198111","scryfallId":"72244e95-5422-41f4-a1b6-fbf5c88d7747","scryfallIllustrationId":"bd30cda7-2207-4970-84b4-30e7aaa88ab4","scryfallOracleId":"edd21d18-98d2-4e3f-8da1-1ba645b8f69c","tcgplayerProductId":"37297"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Sea of Sand","number":"33","originalText":"Players reveal each card they draw.\nWhenever a player draws a land card, that player gains 3 life.\nWhenever a player draws a nonland card, that player loses 3 life.\nWhenever you roll chaos, put target permanent on top of its owner's library.","originalType":"Plane - Rabiah","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/852b25a077123e88","tcgplayer":"https://mtgjson.com/links/f5fb25557cedf1b2"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Rabiah"],"supertypes":[],"text":"Players reveal each card they draw.\nWhenever a player draws a land card, that player gains 3 life.\nWhenever a player draws a nonland card, that player loses 3 life.\nWhenever chaos ensues, put target permanent on top of its owner's library.","type":"Plane — Rabiah","types":["Plane"],"uuid":"0fd59677-1260-5445-93cc-dc6b09d07ddd"},{"artist":"rk post","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":["R"],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211796,"name":"Shiv","text":"Alle Kreaturen haben „{R}: Diese Kreatur erhält +1/+0 bis zum Ende des Zuges.\"\nImmer wenn du chaos würfelst, bringe einen 5/5 roten Drachen-Kreaturenspielstein mit Flugfähigkeit ins Spiel.","type":"Welt — Dominaria"},{"language":"Spanish","multiverseId":211931,"name":"Shiv","text":"Todas las criaturas tienen \"{R}: Esta criatura obtiene +1/+0 hasta el final del turno\".\nSiempre que lances caos, pon en el campo de batalla una ficha de criatura Dragón roja 5/5 con la habilidad de volar.","type":"Plano — Dominaria"},{"language":"French","multiverseId":211886,"name":"Shiv","text":"Toutes les créatures ont « {R} : Cette créature gagne +1/+0 jusqu'à la fin du tour. »\nÀ chaque fois que vous obtenez chaos, mettez sur le champ de bataille un jeton de créature 5/5 rouge Dragon avec le vol.","type":"Plan : Dominaria"},{"language":"Italian","multiverseId":211841,"name":"Shiv","text":"Tutte le creature hanno \"{R}: Questa creatura prende +1/+0 fino alla fine del turno.\"\nOgniqualvolta tiri caos, metti sul campo di battaglia una pedina creatura Drago 5/5 rossa con volare.","type":"Piano — Dominaria"},{"language":"Japanese","multiverseId":211976,"name":"シヴ","text":"すべてのクリーチャーは「{R}：このクリーチャーはターン終了時まで＋１/＋０の修整を受ける」を持つ。\nあなたがchaosを出すたび、飛行を持つ赤の５/５のドラゴン・クリーチャー・トークンを１体戦場に出す。","type":"次元 — ドミナリア"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127755","mcmId":"21508","mtgjsonV4Id":"606e5c7f-55a5-543c-bbf0-9e1826c69b4a","multiverseId":"198086","scryfallId":"1ae070fa-9f29-44b1-99a3-3edec3489190","scryfallIllustrationId":"6829684c-7227-4d35-87f3-4cb605085761","scryfallOracleId":"70edae19-e278-401d-9772-508bd66320a6","tcgplayerProductId":"37298"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Shiv","number":"34","originalText":"All creatures have \"{R}: This creature gets +1/+0 until end of turn.\"\nWhenever you roll chaos, put a 5/5 red Dragon creature token with flying onto the battlefield.","originalType":"Plane - Dominaria","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/668fe6055805fb06","tcgplayer":"https://mtgjson.com/links/60b203869a29f347"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."}],"setCode":"OHOP","subtypes":["Dominaria"],"supertypes":[],"text":"All creatures have \"{R}: This creature gets +1/+0 until end of turn.\"\nWhenever chaos ensues, create a 5/5 red Dragon creature token with flying.","type":"Plane — Dominaria","types":["Plane"],"uuid":"0fc72757-bdee-5bd5-a2ba-4a24d68085b1"},{"artist":"Wayne England","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211797,"name":"Himmelsbräun","text":"Die oberste Karte der Bibliotheken aller Spieler ist offen.\nZaubersprüche, die einen Kartentyp mit der obersten Karte einer Bibliothek gemeinsam haben, können nicht gewirkt werden.\nImmer wenn du chaos würfelst, verliert ein Spieler deiner Wahl so viele Lebenspunkte, wie er Karten auf der Hand hat.","type":"Welt — Kaldheim"},{"language":"Spanish","multiverseId":211932,"name":"Glaciar en las nubes","text":"Los jugadores juegan mostrando la primera carta de su biblioteca.\nLos hechizos que compartan un tipo de carta con la primera carta de una biblioteca no pueden ser lanzados.\nSiempre que lances caos, el jugador objetivo pierde vidas igual a la cantidad de cartas en su mano.","type":"Plano — Kaldheim"},{"language":"French","multiverseId":211887,"name":"Glacier céleste","text":"Les joueurs jouent avec la carte du dessus de leurs bibliothèques révélée.\nLes sorts qui partagent un type de carte avec la carte du dessus d'une bibliothèque ne peuvent pas être lancés.\nÀ chaque fois que vous obtenez chaos, le joueur ciblé perd un nombre de points de vie égal au nombre de cartes de sa main.","type":"Plan : Kaldheim"},{"language":"Italian","multiverseId":211842,"name":"Skybreen","text":"I giocatori giocano con la prima carta dei loro grimori rivelata.\nLe magie che condividono un tipo di carta con la prima carta di un grimorio non possono essere lanciate.\nOgniqualvolta tiri caos, un giocatore bersaglio perde punti vita pari al numero di carte nella sua mano.","type":"Piano — Kaldheim"},{"language":"Japanese","multiverseId":211977,"name":"スカイブリーン","text":"プレイヤーは自分のライブラリーの一番上のカードを公開したままプレイする。\nいずれかのライブラリーの一番上のカードと共通のカード・タイプを持つ呪文は唱えられない。\nあなたがchaosを出すたび、プレイヤー１人を対象とする。そのプレイヤーは自分の手札にあるカードの枚数に等しい点数のライフを失う。","type":"次元 — カルドハイム"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127756","mcmId":"21509","mtgjsonV4Id":"fb80b614-ff98-521d-a91e-ea94a061845d","multiverseId":"198101","scryfallId":"f872b281-1419-4b92-ba38-68d253803ba7","scryfallIllustrationId":"3e90db1f-bf4d-41f1-b261-fb366a247055","scryfallOracleId":"61006acf-de38-420b-ab7a-685fbd64141c","tcgplayerProductId":"37299"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Skybreen","number":"35","originalText":"Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever you roll chaos, target player loses life equal to the number of cards in his or her hand.","originalType":"Plane - Kaldheim","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/836901c5c07f0118","tcgplayer":"https://mtgjson.com/links/33eb27505cb9c8da"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"When playing with the top card of your library revealed, if an effect tells you to draw several cards, reveal each one before you draw it."},{"date":"2009-10-01","text":"If the top card of your library changes during the process of casting a spell or activating an ability, the new top card won’t be revealed until the process of casting the spell or activating the ability ends (all targets are chosen, all costs are paid, and so on)."},{"date":"2009-10-01","text":"Skybreen’s second ability prevents each player from casting spells that share a card type with a card on top of any library, not just the one on top of that player’s own library. This includes permanent spells (artifacts, creatures, enchantments, and planeswalkers), not just instant and sorcery spells. It doesn’t stop players from playing lands or activating abilities (such as cycling or unearth)."}],"setCode":"OHOP","subtypes":["Kaldheim"],"supertypes":[],"text":"Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever chaos ensues, target player loses life equal to the number of cards in their hand.","type":"Plane — Kaldheim","types":["Plane"],"uuid":"da769198-3a98-53dd-80ec-094486ce734f"},{"artist":"Brian Snõddy","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211798,"name":"Sokenzan","text":"Alle Kreaturen erhalten +1/+1 und haben Eile.\nImmer wenn du chaos würfelst, enttappe alle Kreaturen, die in diesem Zug angegriffen haben. Nach dieser Hauptphase gibt es eine zusätzliche Kampfphase, der eine zusätzliche Hauptphase folgt.","type":"Welt — Kamigawa"},{"language":"Spanish","multiverseId":211933,"name":"Sokenzan","text":"Todas las criaturas obtienen +1/+1 y tienen la habilidad de prisa.\nSiempre que lances caos, endereza todas las criaturas que atacaron este turno. Después de esta fase principal, hay una fase de combate adicional seguida de una fase principal adicional.","type":"Plano — Kamigawa"},{"language":"French","multiverseId":211888,"name":"Sokenzan","text":"Toutes les créatures gagnent +1/+1 et ont la célérité.\nÀ chaque fois que vous obtenez chaos, dégagez toutes les créatures qui ont attaqué ce tour-ci. Cette phase principale est suivie d'une phase de combat supplémentaire, puis d'une phase principale supplémentaire.","type":"Plan : Kamigawa"},{"language":"Italian","multiverseId":211843,"name":"Sokenzan","text":"Tutte le creature prendono +1/+1 e hanno rapidità.\nOgniqualvolta tiri caos, STAPpa tutte le creature che hanno attaccato in questo turno. Dopo questa fase principale, c'è una fase di combattimento addizionale seguita da una fase principale addizionale.","type":"Piano — Kamigawa"},{"language":"Japanese","multiverseId":211978,"name":"霜剣山","text":"すべてのクリーチャーは＋１/＋１の修整を受けるとともに速攻を持つ。\nあなたがchaosを出すたび、このターン攻撃したすべてのクリーチャーをアンタップする。 このメイン・フェイズの後に、追加の戦闘フェイズとその後の追加のメイン・フェイズを加える。","type":"次元 — 神河"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127757","mcmId":"21510","mtgjsonV4Id":"51144226-f3e9-5b05-a46e-b9e5f37f87c9","multiverseId":"198075","scryfallId":"6b379c56-6b79-4852-ad77-31f45181948d","scryfallIllustrationId":"036c0eda-4245-4a62-a172-29ccae28191b","scryfallOracleId":"c09d304a-87d0-4a2a-bcb2-e81341b2dbf2","tcgplayerProductId":"37300"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Sokenzan","number":"36","originalText":"All creatures get +1/+1 and have haste.\nWhenever you roll chaos, untap all creatures that attacked this turn. After this main phase, there is an additional combat phase followed by an additional main phase.","originalType":"Plane - Kamigawa","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/2cb88f363053c33c","tcgplayer":"https://mtgjson.com/links/1c6f5aa5d5f59e17"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If you roll {CHAOS} twice in the same main phase, two new combat phases will be created. However, all creatures that attacked this turn untap as the chaos abilities resolve, not as the combat phases start. Any creature that attacks in the second combat phase will remain tapped during the third combat phase (unless you roll {CHAOS} again)."}],"setCode":"OHOP","subtypes":["Kamigawa"],"supertypes":[],"text":"All creatures get +1/+1 and have haste.\nWhenever chaos ensues, untap all creatures that attacked this turn. If it's a main phase, there is an additional combat phase after this phase, followed by an additional main phase.","type":"Plane — Kamigawa","types":["Plane"],"uuid":"38aab624-b9e3-5334-8eb0-b1356bda8d0c"},{"artist":"Jim Pavelec","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211799,"name":"Schmelzofen der Felsenburg","text":"Falls eine Quelle einer Kreatur oder einem Spieler Schadenspunkte zufügen würde, fügt sie dieser Kreatur oder diesem Spieler stattdessen doppelt so viele Schadenspunkte zu.\nImmer wenn du chaos würfelst, fügt der Schmelzofen der Felsenburg einer Kreatur oder einem Spieler deiner Wahl 1 Schadenspunkt zu.","type":"Welt — Rath"},{"language":"Spanish","multiverseId":211934,"name":"Horno de la Fortaleza","text":"Si una fuente fuera a hacer daño a una criatura o jugador, en vez de eso, hace el doble del daño a esa criatura o jugador.\nSiempre que lances caos, el Horno de la Fortaleza hace 1 punto de daño a la criatura o jugador objetivo.","type":"Plano — Rath"},{"language":"French","multiverseId":211889,"name":"Fourneau de la Forteresse","text":"Si une source devait infliger des blessures à une créature ou un joueur, elle inflige à la place le double de ces blessures à cette créature ou à ce joueur.\nÀ chaque fois que vous obtenez chaos, le Fourneau de la Forteresse inflige 1 blessure à une cible, créature ou joueur.","type":"Plan : Rajh"},{"language":"Italian","multiverseId":211844,"name":"Fornace della Fortezza","text":"Se una fonte sta per infliggere danno a una creatura o a un giocatore, infligge invece il doppio di quel danno a quella creatura o a quel giocatore.\nOgniqualvolta tiri caos, la Fornace della Fortezza infligge 1 danno a una creatura o a un giocatore bersaglio.","type":"Piano — Rath"},{"language":"Japanese","multiverseId":211979,"name":"要塞の灼熱洞","text":"いずれかの発生源がクリーチャーかプレイヤーにダメージを与える場合、代わりにそれはそのクリーチャーかプレイヤーにその点数の２倍のダメージを与える。\nあなたがchaosを出すたび、クリーチャー１体かプレイヤー１人を対象とする。要塞の灼熱洞はそれに１点のダメージを与える。","type":"次元 — ラース"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127758","mcmId":"21511","mtgjsonV4Id":"68299256-f207-567c-9090-7776511c5533","multiverseId":"198063","scryfallId":"93bba6ac-b145-4039-9853-e04683c422f1","scryfallIllustrationId":"c21e3a8d-deb4-4866-b2db-58e35d5e4b90","scryfallOracleId":"ff76b576-8ad3-44f9-8043-80003a078e84","tcgplayerProductId":"37301"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Stronghold Furnace","number":"37","originalText":"If a source would deal damage to a creature or player, it deals double that damage to that creature or player instead.\nWhenever you roll chaos, Stronghold Furnace deals 1 damage to target creature or player.","originalType":"Plane - Rath","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/03cd5f526e6042f8","tcgplayer":"https://mtgjson.com/links/cc647bff4af3a320"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Stronghold Furnace's first ability interacts with all damage, not just combat damage. Notably, it doubles the damage from its own chaos ability."},{"date":"2009-10-01","text":"If multiple effects modify how damage will be dealt, the player who would be dealt damage or the controller of the creature that would be dealt damage chooses the order to apply the effects. For example, Mending Hands says, “Prevent the next 4 damage that would be dealt to any target this turn.” Suppose a spell would deal 5 damage to a player who has cast Mending Hands targeting themselves. The player who would be dealt damage can either (a) prevent 4 damage first and then let Stronghold Furnace's effect double the remaining 1 damage, taking 2 damage, or (b) double the damage to 10 and then prevent 4 damage, taking 6 damage."},{"date":"2009-10-01","text":"If a spell or ability divides damage among multiple recipients (such as Pyrotechnics does), the damage is divided before Stronghold Furnace's effect doubles it. The same is true for combat damage."}],"setCode":"OHOP","subtypes":["Rath"],"supertypes":[],"text":"If a source would deal damage to a permanent or player, it deals double that damage instead.\nWhenever chaos ensues, Stronghold Furnace deals 1 damage to any target.","type":"Plane — Rath","types":["Plane"],"uuid":"a9a06540-6142-5050-9489-9a3e4ab7274f"},{"artist":"Raymond Swanland","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211800,"name":"Die Insel Turri","text":"Kreaturenzauber kosten beim Wirken {2} weniger.\nImmer wenn du chaos würfelst, decke die obersten drei Karten deiner Bibliothek auf. Nimm alle Kreaturenkarten, die auf diese Weise aufgedeckt wurden, auf deine Hand und lege den Rest der Karten auf deinen Friedhof.","type":"Welt — Ir"},{"language":"Spanish","multiverseId":211935,"name":"Isla Turri","text":"Cuesta {2} menos lanzar los hechizos de criatura.\nSiempre que lances caos, muestra las primeras tres cartas de tu biblioteca. Pon todas las cartas de criatura mostradas de esta manera en tu mano y el resto, en tu cementerio.","type":"Plano — Ir"},{"language":"French","multiverseId":211890,"name":"Île de Turri","text":"Les sorts de créature coûtent {2} de moins à lancer.\nÀ chaque fois que vous obtenez chaos, révélez les trois cartes du dessus de votre bibliothèque. Mettez toutes les cartes de créature révélées de cette manière dans votre main et le reste dans votre cimetière.","type":"Plan : Ir"},{"language":"Italian","multiverseId":211845,"name":"Isola Turri","text":"Le magie creatura costano {2} in meno per essere lanciate.\nOgniqualvolta tiri caos, rivela le prime tre carte del tuo grimorio. Aggiungi alla tua mano tutte le carte creatura rivelate in questo modo e metti le altre nel tuo cimitero.","type":"Piano — Ir"},{"language":"Japanese","multiverseId":211980,"name":"ターリ島","text":"クリーチャー呪文は、それを唱えるためのコストが{2}少なくなる。\nあなたがchaosを出すたび、あなたのライブラリーの一番上から３枚のカードを公開する。 これにより公開されたクリーチャー・カードをすべてあなたの手札に加え、残りをあなたの墓地に置く。","type":"次元 — アー"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127766","mcmId":"21512","mtgjsonV4Id":"91666465-d477-58f8-b7e0-d1d57eec9391","multiverseId":"198085","scryfallId":"a49c096c-4849-48b8-8186-7da2232e63b0","scryfallIllustrationId":"f9bcb726-aebf-4446-9f62-99e3acc02614","scryfallOracleId":"1300b5e7-d741-4723-bb15-dabd04cb0c11","tcgplayerProductId":"37310"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Turri Island","number":"38","originalText":"Creature spells cost {2} less to cast.\nWhenever you roll chaos, reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest into your graveyard.","originalType":"Plane - Ir","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/e7aae0b3ba30dc4a","tcgplayer":"https://mtgjson.com/links/42cc85501c12012d"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Turri Island's first ability can't reduce the cost to cast a creature spell to less than {0}."},{"date":"2009-10-01","text":"If there are fewer than three cards in your library as the chaos ability resolves, you'll reveal all the cards in your library."}],"setCode":"OHOP","subtypes":["Ir"],"supertypes":[],"text":"Creature spells cost {2} less to cast.\nWhenever chaos ensues, reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest into your graveyard.","type":"Plane — Ir","types":["Plane"],"uuid":"7e33cf63-dfd3-5bb5-af80-34f7bbd3d0fc"},{"artist":"Stephan Martiniere","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211801,"name":"Unterstadt-Viertel","text":"Immer wenn eine Kreatur einem Spieler Kampfschaden zufügt, kann ihr Beherrscher eine Karte ziehen.\nImmer wenn du chaos würfelst, hast du für den Rest des Spiels keine maximale Handkartenzahl.","type":"Welt — Ravnica"},{"language":"Spanish","multiverseId":211936,"name":"Cimas de la Subciudad","text":"Siempre que una criatura haga daño de combate a un jugador, su controlador puede robar una carta.\nSiempre que lances caos, tu mano no tiene tamaño máximo por el resto del juego.","type":"Plano — Rávnica"},{"language":"French","multiverseId":211891,"name":"Étendue de la Citerraine","text":"À chaque fois qu'une créature inflige des blessures de combat à un joueur, son contrôleur peut piocher une carte.\nÀ chaque fois que vous obtenez chaos, vous n'avez plus limite au nombre de cartes dans votre main pour le restant de la partie.","type":"Plan : Ravnica"},{"language":"Italian","multiverseId":211846,"name":"Distesa della Città Sepolta","text":"Ogniqualvolta una creatura infligge danno da combattimento a un giocatore, il suo controllore può pescare una carta.\nOgniqualvolta tiri caos, non hai un limite massimo di carte nella tua mano per il resto della partita.","type":"Piano — Ravnica"},{"language":"Japanese","multiverseId":211981,"name":"地下都市の辺境","text":"いずれかのクリーチャーがいずれかのプレイヤーに戦闘ダメージを与えるたび、それのコントローラーはカードを１枚引いてもよい。\nあなたがchaosを出すたび、残りのゲームの間、あなたの手札の上限はなくなる。","type":"次元 — ラヴニカ"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127767","mcmId":"21513","mtgjsonV4Id":"08e26e58-4b22-5a17-b4f8-7d304444008d","multiverseId":"198110","scryfallId":"f0d8c066-1b69-4579-87e2-dcbba87964a8","scryfallIllustrationId":"02a454e9-5a01-40fe-8389-86d6804a4c60","scryfallOracleId":"f3f5a033-d063-4250-9cfe-4c3c1a2725f1","tcgplayerProductId":"37311"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Undercity Reaches","number":"39","originalText":"Whenever a creature deals combat damage to a player, its controller may draw a card.\nWhenever you roll chaos, you have no maximum hand size for the rest of the game.","originalType":"Plane - Ravnica","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/f40a2cd9c65b7721","tcgplayer":"https://mtgjson.com/links/95761e27ee99e490"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"The chaos ability's effect continues to apply even after Undercity Reaches stops being the face-up plane card."},{"date":"2009-10-01","text":"If multiple effects modify your hand size, apply them in timestamp order. For example, if you put Null Profusion (an enchantment that says your maximum hand size is two) onto the battlefield and then roll {CHAOS} while Undercity Reaches is the face-up plane card, you'll have no maximum hand size. However, if those events had happened in the opposite order, your maximum hand size would be two for as long as Null Profusion is on the battlefield."},{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner's planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that's turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn't leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it's referring to whoever the plane's controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"If multiple creatures deal combat damage to a player, the first ability of Undercity Reaches triggers multiple times."},{"date":"2009-10-01","text":"If a creature deals combat damage to a player, the controller of Undercity Reaches controls the ability that triggers, but the controller of the creature decides whether to draw a card."}],"setCode":"OHOP","subtypes":["Ravnica"],"supertypes":[],"text":"Whenever a creature deals combat damage to a player, its controller may draw a card.\nWhenever chaos ensues, you have no maximum hand size for the rest of the game.","type":"Plane — Ravnica","types":["Plane"],"uuid":"6f3b4dd5-6782-5fec-a219-91a0c164e6f6"},{"artist":"Terese Nielsen","availability":["mtgo","paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["nonfoil"],"foreignData":[{"language":"German","multiverseId":211802,"name":"Velis Vel","text":"Jede Kreatur erhält +1/+1 für jede andere Kreatur im Spiel, mit der sie mindestens einen Kreaturentyp teilt. (Sind zum Beispiel zwei „Elementarwesen, Schamane\" sowie ein „Elementarwesen, Geist\" im Spiel, erhalten alle +2/+2.)\nImmer wenn du chaos würfelst, erhält eine Kreatur deiner Wahl bis zum Ende des Zuges alle Kreaturentypen","type":"Welt — Lorwyn"},{"language":"Spanish","multiverseId":211937,"name":"Velis Vel","text":"Cada criatura obtiene +1/+1 por cada otra criatura que haya en el campo de batalla que comparta al menos un tipo de criatura con ella. (Por ejemplo, si hay en el campo de batalla dos criaturas Chamán Elemental y un Espíritu Elemental, cada una obtiene +2/+2.)\nSiempre que lances caos, la criatura objetivo gana todos los tipos de criatura hasta el final del turno.","type":"Plano — Lorwyn"},{"language":"French","multiverseId":211892,"name":"Velis Vel","text":"Chaque créature gagne +1/+1 pour chaque autre créature sur le champ de bataille qui partage au moins un type de créature avec elle. (Par exemple, si deux élémentaux et shamanes et un élémental et esprit sont sur le champ de bataille, chacun gagne +2/+2,)\nÀ chaque fois que vous obtenez chaos, la créature ciblée acquiert tous les types de créature jusqu'à la fin du tour.","type":"Plan : Lorwyn"},{"language":"Italian","multiverseId":211847,"name":"Velis Vel","text":"Ogni creatura prende +1/+1 per ogni altra creatura sul campo di battaglia che condivide almeno un tipo di creatura con essa. (Ad esempio, se sono sul campo di battaglia due Sciamani Elementali e uno Spirito Elementale, ognuno prende +2/+2.)\nOgniqualvolta tiri caos, una creatura bersaglio ha tutti i tipi di creatura fino alla fine del turno.","type":"Piano — Lorwyn"},{"language":"Japanese","multiverseId":211982,"name":"ヴェリズ・ヴェル","text":"各クリーチャーは、戦場に出ているそれと共通のクリーチャー・タイプを少なくとも１つ持つ他のクリーチャー１体につき＋１/＋１の修整を受ける。 （例えば、戦場にエレメンタル・シャーマンが２体、エレメンタル・スピリットが１体いる場合、それらはそれぞれ＋２/＋２の修整を受ける。）\nあなたがchaosを出すたび、クリーチャー１体を対象とする。それはターン終了時まですべてのクリーチャー・タイプを得る。","type":"次元 — ローウィン"}],"frameVersion":"2003","hasFoil":false,"hasNonFoil":true,"identifiers":{"cardKingdomId":"127768","mcmId":"21514","mtgjsonV4Id":"a3780550-0a38-50e8-ab71-5619f9c3f191","multiverseId":"198081","scryfallId":"dfcbc084-20df-4ff5-9f2d-0b1e277add54","scryfallIllustrationId":"c89c62b3-6717-4cc8-a948-7113e648287f","scryfallOracleId":"1c4e174e-19fb-4c0a-b762-ef6d927392c9","tcgplayerProductId":"37312"},"isOversized":true,"isStarter":true,"language":"English","layout":"planar","legalities":{},"manaValue":0.0,"name":"Velis Vel","number":"40","originalText":"Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. (For example, if two Elemental Shamans and an Elemental Spirit are on the battlefield, each gets +2/+2.)\nWhenever you roll chaos, target creature gains all creature types until end of turn.","originalType":"Plane - Lorwyn","purchaseUrls":{"cardKingdom":"https://mtgjson.com/links/f7c779de642df137","tcgplayer":"https://mtgjson.com/links/e9a9cde710ff048f"},"rarity":"common","rulings":[{"date":"2009-10-01","text":"A plane card is treated as if its text box included “When you roll {PW}, put this card on the bottom of its owner’s planar deck face down, then move the top card of your planar deck off that planar deck and turn it face up.” This is called the “planeswalking ability.”"},{"date":"2009-10-01","text":"A face-up plane card that’s turned face down becomes a new object with no relation to its previous existence. In particular, it loses all counters it may have had."},{"date":"2009-10-01","text":"The controller of a face-up plane card is the player designated as the “planar controller.” Normally, the planar controller is whoever the active player is. However, if the current planar controller would leave the game, instead the next player in turn order that wouldn’t leave the game becomes the planar controller, then the old planar controller leaves the game. The new planar controller retains that designation until they leave the game or a different player becomes the active player, whichever comes first."},{"date":"2009-10-01","text":"If an ability of a plane refers to “you,” it’s referring to whoever the plane’s controller is at the time, not to the player that started the game with that plane card in their deck. Many abilities of plane cards affect all players, while many others affect only the planar controller, so read each ability carefully."},{"date":"2009-10-01","text":"Sharing multiple creature types doesn’t give an additional bonus. Velis Vel’s first ability counts creatures, not creature types."},{"date":"2009-10-01","text":"The chaos ability doesn’t give a creature changeling."}],"setCode":"OHOP","subtypes":["Lorwyn"],"supertypes":[],"text":"Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. (For example, if two Elemental Shamans and an Elemental Spirit are on the battlefield, each gets +2/+2.)\nWhenever chaos ensues, target creature gains all creature types until end of turn.","type":"Plane — Lorwyn","types":["Plane"],"uuid":"2f8004fd-a258-5d00-90b2-6c5e94f28a49"}],"code":"OHOP","isFoilOnly":false,"isNonFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"HOP","languages":["English","French","German","Italian","Japanese","Spanish"],"mtgoCode":"OHOP","name":"Planechase Planes","parentCode":"HOP","releaseDate":"2009-09-04","tokens":[],"totalSetSize":40,"translations":{},"type":"planechase","meta":{"date":"2023-06-18","version":"5.2.1+20230618"}}
