{"baseSetSize":85,"cards":[{"artist":"Raph Lomotan","artistIds":["7da5333c-6b1e-48ba-ab42-1b41f09920ee"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":7.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298005","mtgjsonV4Id":"ec31c808-1a44-5871-b61a-cf6284e9a567","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"998d2321-955b-4453-980c-725d1cabf785","scryfallIllustrationId":"9d8b0f04-7923-4626-88ff-91f56dfc4475","scryfallOracleId":"89215e6d-ebe7-4eb0-9999-11ee2e6eb1d2"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{5}{C}{C}","manaValue":7.0,"name":"Devourer of Destiny","number":"2s","power":"6","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/dde0222dc1445314"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A player's \"opening hand\" is the hand of cards the player has after all players have taken mulligans. If players have any cards in hand that allow actions to be taken with them from a player's opening hand, the starting player takes all such actions first in any order, followed by each other player in turn order. Then the first turn begins."},{"date":"2024-06-07","text":"Devourer of Destiny's last triggered ability will resolve before Devourer of Destiny does. If Devourer of Destiny is countered or otherwise leaves the stack in response to that triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"If you reveal more than one Devourer of Destiny from your opening hand, you'll put that many triggered abilities on the stack at the beginning of your first upkeep. As a result, you'll look at the top four cards of your library, put up to one back on top, and exile the rest once for each Devour of Destiny you revealed."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":[],"text":"You may reveal this card from your opening hand. If you do, at the beginning of your first upkeep, look at the top four cards of your library. You may put one of those cards back on top of your library. Exile the rest.\nWhen you cast this spell, exile target permanent that's one or more colors.","toughness":"6","type":"Creature — Eldrazi","types":["Creature"],"uuid":"a85ef1bc-5fa1-5268-a45c-f2146030249c"},{"artist":"Isis","artistIds":["4d12227a-8657-48b7-884a-ff70cc6428a5"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":6.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298006","mtgjsonV4Id":"08c97a58-2caa-58bc-9211-ec20b86576b7","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ebf7119e-9b77-4a76-90b6-7b56dfb6adfe","scryfallIllustrationId":"6897df97-e4df-466e-8115-fc84f648b35c","scryfallOracleId":"23a79523-4be0-4d17-80aa-5ea024cb3463"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{3}{C}{C}{C}","manaValue":6.0,"name":"Echoes of Eternity","number":"4s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/ff6b807029c3ab5e"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Abilities that apply \"as [this permanent] enters the battlefield\" or \"as [this permanent] is turned face up\" are also unaffected."},{"date":"2024-06-07","text":"Abilities that apply \"when [this permanent] is turned face up\" will trigger an additional time only if that permanent is colorless once it has been turned face up."},{"date":"2024-06-07","text":"Echoes of Eternity's first ability doesn't copy the triggered ability; it just causes the ability to trigger an additional time. Any choices made as you put the ability onto the stack, such as modes and targets, are made separately for each instance of the ability. Any choices made on resolution, such as whether to put counters on a permanent, are also made individually."},{"date":"2024-06-07","text":"If a triggered ability is linked to a second ability, additional instances of that triggered ability are also linked to that second ability. If the second ability refers to \"the exiled card,\" it refers to all cards exiled by instances of the triggered ability."},{"date":"2024-06-07","text":"If you control two copies of Echoes of Eternity and you cast a colorless spell, each of their second abilities will trigger. Then, each of their first abilities will cause the other's second ability to trigger an additional time. In total, you'll get four copies of the spell in addition to the original spell. If you control three copies of Echoes of Eternity, you'll end up with nine copies of the spell plus the original. Four copies of Echoes of Eternity means sixteen copies of the spell plus the original, five means twenty-five copies plus the original, and so on."},{"date":"2024-06-07","text":"If you control two copies of Echoes of Eternity, abilities of colorless spells and other colorless permanents you control trigger three times. A third Echoes of Eternity causes such abilities to trigger four times, a fourth causes such abilities to trigger five times, and so on."},{"date":"2024-06-07","text":"In some cases involving linked abilities, an ability requires information about \"the exiled card.\" When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist's enters-the-battlefield ability triggers twice, two cards are exiled. The value of X in the activation cost of Elite Arcanist's other ability is the sum of the two cards' mana values. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order."},{"date":"2024-06-07","text":"Kindred is a card type that allows noncreature cards to have creature types. For example, Echoes of Eternity is an Eldrazi (although not a creature) while on the battlefield and an Eldrazi card (although not a creature card) in zones other than the battlefield."},{"date":"2024-06-07","text":"Once an ability of a permanent you control has triggered, making it colorless won't cause that ability to trigger an additional time. Similarly, once an ability of a colorless permanent has triggered an additional time due to Echoes of Eternity's first ability, giving that permanent one or more colors won't remove that additional triggered ability from the stack."},{"date":"2024-06-07","text":"Replacement effects are unaffected by Echoes of Eternity's first ability. For example, a colorless creature that enters the battlefield under your control with one +1/+1 counter on it won't receive an additional +1/+1 counter."},{"date":"2024-06-07","text":"The copy created by Echoes of Eternity's last ability is put directly onto the stack. It isn't cast, so any abilities that apply \"when you cast [this spell]\" won't trigger."},{"date":"2024-06-07","text":"Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They're often written as \"[Trigger condition], [effect].\" Some keyword abilities are triggered abilities and will have \"when,\" \"whenever,\" or \"at the beginning of\" in their reminder text."},{"date":"2024-06-07","text":"While it appears only on cards that already have other card types, kindred is a card type and will be counted by effects that refer to the number of card types among cards in a zone."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":[],"text":"If a triggered ability of a colorless spell you control or another colorless permanent you control triggers, that ability triggers an additional time.\nWhenever you cast a colorless spell, copy it. You may choose new targets for the copy. (A copy of a permanent spell becomes a token.)","type":"Kindred Enchantment — Eldrazi","types":["Kindred","Enchantment"],"uuid":"a8edff72-4f22-58f5-9b4a-a6869ad37130"},{"artist":"Brent Hollowell","artistIds":["19d4900c-f5a1-4c08-b5e0-b8d7ba733ec2"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":12.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298007","mtgjsonV4Id":"72ca0090-c983-5f85-994c-dff48fce6144","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"234f13ee-5e69-40d6-9eb4-ced75480ca7a","scryfallIllustrationId":"7ab7865a-5782-41d2-bd20-9ac014e4f1d1","scryfallOracleId":"33300e69-29f6-41e4-92ab-82d8b018b217"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying","Madness","Protection"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{12}","manaValue":12.0,"name":"Emrakul, the World Anew","number":"6s","power":"12","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/55c8a682c8c5c91b"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A card with madness that's discarded counts as having been discarded even though it's put into exile rather than a graveyard. If it was discarded to pay a cost, that cost is still paid. Abilities that trigger when a card is discarded will still trigger."},{"date":"2024-06-07","text":"A spell cast for its madness cost is put onto the stack like any other spell. It can be countered, copied, and so on. As it resolves, it's put onto the battlefield if it's a permanent card or into its owner's graveyard if it's an instant or sorcery card."},{"date":"2024-06-07","text":"Cards are discarded in a Magic game only from a player's hand. Effects that put cards into a player's graveyard from anywhere else do not cause those cards to be discarded."},{"date":"2024-06-07","text":"Casting a spell with madness ignores the timing rules based on the card's card type. For example, you can cast a creature with madness if you discard it during an opponent's turn."},{"date":"2024-06-07","text":"Emrakul, the World Anew's triggered ability will resolve before Emrakul does. If Emrakul is countered or otherwise leaves the stack in response to that triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"If you choose not to cast a card with madness when the madness triggered ability resolves, it's put into your graveyard. Madness doesn't give you another chance to cast it later."},{"date":"2024-06-07","text":"If you discard a card with madness to pay the cost of a spell or activated ability, that card's madness triggered ability (and the spell that card becomes, if you choose to cast it) will resolve before the spell or ability the discard paid for."},{"date":"2024-06-07","text":"If you discard a card with madness while a spell or ability is resolving, it moves immediately to exile. Continue resolving that spell or ability, noting that the card you discarded is not in your graveyard at this time. Its madness triggered ability will be placed onto the stack once that spell or ability has completely resolved."},{"date":"2024-06-07","text":"If you discard a card with madness, you discard it into exile instead of into your graveyard. When you do, you can either cast it from exile for its madness cost or put it into your graveyard."},{"date":"2024-06-07","text":"Madness works independently of why you're discarding the card. You could discard it to pay a cost, because a spell or ability tells you to, or because you have too many cards in your hand during your cleanup step. You can't discard a card with madness just because you want to, though."},{"date":"2024-06-07","text":"The control-change effect of Emrakul's first ability lasts indefinitely. It doesn't wear off during the cleanup step or when Emrakul leaves the battlefield."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":["Legendary"],"text":"When you cast this spell, gain control of all creatures target player controls.\nFlying, protection from spells and from permanents that were cast this turn\nWhen Emrakul, the World Anew leaves the battlefield, sacrifice all creatures you control.\nMadness—Pay six {C}.","toughness":"12","type":"Legendary Creature — Eldrazi","types":["Creature"],"uuid":"088b05be-47d2-513d-81fe-176f95e2f8bb"},{"artist":"Lucas Graciano","artistIds":["ce98f39c-7cdd-47e6-a520-6c50443bb4c2"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":[],"convertedManaCost":9.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298008","mtgjsonV4Id":"2051e352-ea60-5b44-9a14-8ca69b650bd3","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"6db879dc-0e9f-448c-bda4-d6c77ae5477f","scryfallIllustrationId":"d373d774-cbf4-4ff8-b851-3a99be9999c8","scryfallOracleId":"76243b38-cab1-465f-aa7d-5bc617541753"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Emerge","Flying"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{9}","manaValue":9.0,"name":"Herigast, Erupting Nullkite","number":"8s","power":"6","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/99175f779944b5b3"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A creature's mana value is determined solely by the mana symbols printed in its upper right corner (unless that creature is the back face of a double-faced card, is a melded permanent, or is copying something else; see below). If the mana cost includes {X}, X is 0. If it's a single-faced card with no mana symbols in its upper right corner (because it's an animated land, for example), its mana value is 0. Ignore any alternative costs or additional costs (such as kicker) that were paid as the creature was cast."},{"date":"2024-06-07","text":"Colored mana components of emerge costs can't be reduced with emerge."},{"date":"2024-06-07","text":"Herigast's triggered ability will resolve before Herigast does. If Herigast is countered or otherwise leaves the stack in response to its triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"If a spell has more than one emerge cost, you may choose to pay it for any one of those emerge costs."},{"date":"2024-06-07","text":"If you cast a spell for another cost \"rather than paying its mana cost\", such as an emerge cost, you can't choose to cast it for any other alternative costs. You can, however, pay additional costs, such as kicker costs. If the spell has any mandatory additional costs, those must be paid to cast it."},{"date":"2024-06-07","text":"If you sacrifice a creature with {X} in its mana cost, that X is 0."},{"date":"2024-06-07","text":"Once you begin to cast a spell using an emerge ability granted by Herigast, losing control of Herigast won't affect it. You can finish casting it as normal. For example, you can choose to sacrifice Herigast as you choose to pay a creature spell's emerge cost from an emerge ability granted by Herigast itself."},{"date":"2024-06-07","text":"Once you begin to cast a spell with emerge, no player may take actions until you're done. Notably, opponents can't try to remove the permanent you wish to sacrifice."},{"date":"2024-06-07","text":"The creature chosen to be sacrificed is still on the battlefield up through the time that you activate mana abilities. Its abilities may affect the spell's cost, be activated to generate mana, and so on. However, if it has an ability that triggers when a spell is cast, it will have been sacrificed before that ability can trigger."},{"date":"2024-06-07","text":"The mana value of a creature spell with emerge isn't affected by whether its emerge cost is paid. For example, if you cast Herigast for its emerge cost and sacrifice a creature whose mana value is 3, Herigast's mana value remains 9."},{"date":"2024-06-07","text":"The mana value of the back face of a double-faced card is the mana value of its front face. The mana value of a melded permanent is the sum of the mana values of its front faces. A creature that's a copy of either has a mana value of 0."},{"date":"2024-06-07","text":"You may choose to exile your hand even if you have no cards in hand. If you do, you'll still draw three cards."},{"date":"2024-06-07","text":"You may sacrifice a creature with a mana value of 0, such as a token creature that's not a copy of another permanent, to cast a spell for its emerge cost. You'll just pay the full emerge cost with no reduction."},{"date":"2024-06-07","text":"You may sacrifice a creature with mana value greater than or equal to the emerge cost. If you do, you'll pay only the colored mana component of the emerge cost."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi","Dragon"],"supertypes":["Legendary"],"text":"Emerge {6}{R}{R} (You may cast this spell by sacrificing a creature and paying the emerge cost reduced by that creature's mana value.)\nWhen you cast this spell, you may exile your hand. If you do, draw three cards.\nFlying\nEach creature spell you cast has emerge. The emerge cost is equal to its mana cost.","toughness":"6","type":"Legendary Creature — Eldrazi Dragon","types":["Creature"],"uuid":"905a7389-50ac-5e16-a902-ff132acb2514"},{"artist":"Brent Hollowell","artistIds":["19d4900c-f5a1-4c08-b5e0-b8d7ba733ec2"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":9.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298009","mtgjsonV4Id":"267c2e1d-1deb-5611-b0c1-eeead0fb31eb","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"d2c238c4-5012-4934-8ed4-48166883824d","scryfallIllustrationId":"551c27d9-eec5-4783-b29c-ca737e6041fd","scryfallOracleId":"39f4bf0e-47d5-4ae8-a504-71acda849850"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Manifest"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{9}","manaValue":9.0,"name":"Kozilek, the Broken Reality","number":"10s","power":"9","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d621e5f007d8b7fc"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A permanent that turns face up or face down changes characteristics but is otherwise the same permanent. Spells and abilities that were targeting that permanent and Auras and Equipment that were attached to that permanent aren't affected unless the new characteristics of the object change the legality of those targets or attachments."},{"date":"2024-06-07","text":"Any time you have priority, you may turn a manifested creature face up by revealing that it's a creature card (ignoring any copy effects or type-changing effects that might be applying to it) and paying its mana cost. This is a special action. It doesn't use the stack and can't be responded to."},{"date":"2024-06-07","text":"Because face-down creatures don't have a name, they can't have the same name as any other creature, even another face-down creature."},{"date":"2024-06-07","text":"Because the permanent is on the battlefield both before and after it's turned face up, turning a permanent face up doesn't cause any enters-the-battlefield abilities to trigger."},{"date":"2024-06-07","text":"If a double-faced card is manifested, it will be put onto the battlefield face down. While face down, it can't transform. If the front face of the card is a creature card, you can turn it face up by paying its mana cost. If you do, its front face will be up."},{"date":"2024-06-07","text":"If a face-down permanent leaves the battlefield, you must reveal it. You must also reveal all face-down spells and permanents you control if you leave the game or the game end."},{"date":"2024-06-07","text":"If a manifested creature would have morph or disguise if it were face up, you may also turn it face up by paying its morph cost or disguise cost."},{"date":"2024-06-07","text":"If a targeted player has only one card in hand as Kozilek's triggered ability resolves, they manifest that card."},{"date":"2024-06-07","text":"If something tries to turn a face-down instant or sorcery card on the battlefield face up, reveal that card to show all players it's an instant or sorcery card. The permanent remains on the battlefield face down. Abilities that trigger when a permanent turns face up won't trigger, because even though you revealed the card, it never turned face up."},{"date":"2024-06-07","text":"Kozilek, the Broken Reality's triggered ability will resolve before Kozilek does. If Kozilek is countered or otherwise leaves the stack in response to that triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"To manifest a card, put it onto the battlefield face down. It becomes a 2/2 face-down creature card with no name, mana cost, or creature types. It's colorless and has a mana value of 0. Other effects that apply to the permanent can still grant it any characteristics it doesn't have or change the characteristics it does have."},{"date":"2024-06-07","text":"Turning a permanent face up or face down doesn't change whether that permanent is tapped or untapped."},{"date":"2024-06-07","text":"Unlike a face-down creature that was cast using a morph or disguise ability, a manifested creature may still be turned face up after it loses its abilities if it's a creature card."},{"date":"2024-06-07","text":"You must ensure that your face-down spells and permanents can be easily differentiated from each other. You're not allowed to mix up the cards that represent them on the battlefield to confuse other players. The order in which they entered the battlefield should remain clear, as well as what ability caused them to be face down. (This includes morph, manifest, disguise, cloak, and a few other effects that turn cards face down.) Common methods for doing this include using markers or dice, or simply placing them in order on the battlefield."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":["Legendary"],"text":"When you cast this spell, up to two target players each manifest two cards from their hands. For each card manifested this way, you draw a card. (To manifest a card, put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card.)\nOther colorless creatures you control get +3/+2.","toughness":"9","type":"Legendary Creature — Eldrazi","types":["Creature"],"uuid":"42ec90da-243b-5f6e-ac97-04ce3173939b"},{"artist":"Yeong-Hao Han","artistIds":["f8e7f8d6-6dde-4059-973c-30f1fd1bbe4e"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298010","mtgjsonV4Id":"55679761-2c5b-5a5b-9288-2629ee27f740","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"7a753c5c-9271-4a10-9fdc-4849ce4fb412","scryfallIllustrationId":"f5db8470-f6f8-4b8c-b365-3bf22b5fafea","scryfallOracleId":"2f2c549d-0293-4b9d-b9a8-ff392800f3a5"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{X}{C}{C}","manaValue":2.0,"name":"Kozilek's Command","number":"11s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/cb5fee5b1c417c7b"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If a creature has {X} in its mana cost, X is 0 when determining its mana value."},{"date":"2024-06-07","text":"If all of Kozilek's Command's targets are illegal as it tries to resolve, it will do nothing. If at least one target is still legal, it will resolve and do as much as it can."},{"date":"2024-06-07","text":"Kindred is a card type that allows noncreature cards to have creature types. For example, Echoes of Eternity is an Eldrazi (although not a creature) while on the battlefield and an Eldrazi card (although not a creature card) in zones other than the battlefield."},{"date":"2024-06-07","text":"While it appears only on cards that already have other card types, kindred is a card type and will be counted by effects that refer to the number of card types among cards in a zone."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":[],"text":"Choose two —\n• Target player creates X 0/1 colorless Eldrazi Spawn creature tokens with \"Sacrifice this creature: Add {C}.\"\n• Target player scries X, then draws a card.\n• Exile target creature with mana value X or less.\n• Exile up to X target cards from graveyards.","type":"Kindred Instant — Eldrazi","types":["Kindred","Instant"],"uuid":"082a5cb0-ad57-5c1f-934e-96c3638d1f58"},{"artist":"Johann Bodin","artistIds":["d92e2dd9-9ef6-43f6-81f8-df87f9066983"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":[],"convertedManaCost":7.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298011","mtgjsonV4Id":"6604eccb-8a86-567e-bb15-d0127135d48b","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"06b82c29-62bb-447b-a36a-d205627ed4f9","scryfallIllustrationId":"cf3e7614-f740-40aa-8e1c-d08112064e06","scryfallOracleId":"ef8d9c3a-5860-45bf-8205-14e2df9a6fc8"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Annihilator","Evoke","Flying"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{7}","manaValue":7.0,"name":"Nulldrifter","number":"13s","power":"4","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/84815602ce762f07"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Annihilator abilities trigger and resolve during the declare attackers step. The defending player sacrifices the required number of permanents of their choice before they declare blockers. Any creatures sacrificed this way won't be able to block."},{"date":"2024-06-07","text":"If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn't blocked, it simply won't deal combat damage to anything."},{"date":"2024-06-07","text":"Nulldrifter's first triggered ability will resolve before Nulldrifter does. If Nulldrifter is countered or otherwise leaves the stack in response to that triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you're paying (such as an evoke cost), add any cost increases, then apply any cost reductions. The mana value of the spell is determined by only its mana cost, no matter what the total cost to cast that spell was."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi","Elemental"],"supertypes":[],"text":"When you cast this spell, draw two cards.\nFlying\nAnnihilator 1 (Whenever this creature attacks, defending player sacrifices a permanent.)\nEvoke {2}{U} (You may cast this spell for its evoke cost. If you do, it's sacrificed when it enters the battlefield.)","toughness":"4","type":"Creature — Eldrazi Elemental","types":["Creature"],"uuid":"7755d29c-1c9b-5f8e-83e8-57ca91e0c2b9"},{"artist":"Chase Stone","artistIds":["2d753f61-5f5b-468e-97ea-8e0fdd347340"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":10.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298012","mtgjsonV4Id":"bf13b833-2881-5f94-834c-cf7967854257","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"c4209e00-2cd6-49a4-afc2-902e3b353bf9","scryfallIllustrationId":"2e9d842a-d143-4b6e-9af1-b6dbba7b5265","scryfallOracleId":"97836c48-8777-4b4e-98fb-e99204f38bdd"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Ward"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{10}","manaValue":10.0,"name":"Ulamog, the Defiler","number":"15s","power":"7","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/5af7e18835a14739"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"Annihilator abilities trigger and resolve during the declare attackers step. The defending player sacrifices the required number of permanents of their choice before they declare blockers. Any creatures sacrificed this way won't be able to block."},{"date":"2024-06-07","text":"If Ulamog is entering the battlefield directly from exile, it will see itself when determining which card has the greatest mana value among cards in exile. If that's Ulamog, which seems likely, it will enter with ten +1/+1 counters on it."},{"date":"2024-06-07","text":"If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn't blocked, it simply won't deal combat damage to anything."},{"date":"2024-06-07","text":"Ulamog, the Defiler has received a minor update to clarify that the target of the first ability exiles the top half of their library. Its updated Oracle text appears above."},{"date":"2024-06-07","text":"Ulamog, the Defiler's first ability will resolve before Ulamog does. If Ulamog is countered or otherwise leaves the stack in response to its triggered ability, the triggered ability will still resolve as normal."},{"date":"2024-06-07","text":"Use the number of +1/+1 counters on Ulamog at the time its annihilator ability resolves to determine how many permanents defending player should sacrifice."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":["Legendary"],"text":"When you cast this spell, target opponent exiles the top half of their library, rounded up.\nWard—Sacrifice two permanents.\nUlamog, the Defiler enters the battlefield with a number of +1/+1 counters on it equal to the greatest mana value among cards in exile.\nUlamog has annihilator X, where X is the number of +1/+1 counters on it.","toughness":"7","type":"Legendary Creature — Eldrazi","types":["Creature"],"uuid":"a9f8d11c-1feb-5354-8608-6d5921852954"},{"artist":"Carlos Palma Cruchaga","artistIds":["f0c43e1b-1853-4abc-8a1b-d7dda6c1d592"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298013","mtgjsonV4Id":"72f35477-16f8-58d6-9a4d-ac7339b282e2","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"2d302eb7-15eb-497e-87dc-70ac8762b869","scryfallIllustrationId":"b82cc056-5558-426d-bb37-fecfebe48882","scryfallOracleId":"3269f589-00fc-4f0b-8693-656f2ab0670d"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{W}","manaValue":2.0,"name":"Argent Dais","number":"20s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/33875dfb6d30bdcd"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Argent Dais's second ability triggers whenever two or more creatures attack, not just when you attack with two or more creatures."},{"date":"2024-06-07","text":"If the target nonland permanent is illegal as Argent Dais's last ability tries to resolve, it won't resolve and none of its effects will happen. No player will draw cards."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Argent Dais enters the battlefield with two oil counters on it.\nWhenever two or more creatures attack, put an oil counter on Argent Dais.\n{2}, {T}, Remove two oil counters from Argent Dais: Exile another target nonland permanent. Its controller draws two cards.","type":"Artifact","types":["Artifact"],"uuid":"8368f15d-e3f1-5604-bd37-77083c31deab"},{"artist":"Winona Nelson","artistIds":["e45fe8d3-75d6-42c9-a2df-e945ad81ea27"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":4.0,"finishes":["foil"],"flavorText":"\"I call upon a power greater than myself.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298014","mtgjsonV4Id":"068a27ec-f3db-5dff-8b60-5c806fc064f9","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"782190b2-6539-4fcb-bfe0-0beb160e84d1","scryfallIllustrationId":"ae8d1221-6f35-4244-9598-b355531498bf","scryfallOracleId":"4ff07b7c-e97a-4b57-bcf1-2f22c37a8bd6"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{W}{W}","manaValue":4.0,"name":"Flare of Fortitude","number":"26s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/afb33d9be6546a64"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Abilities that trigger whenever damage is dealt to you will still trigger because that damage is still dealt, even though your life total doesn't change as a result."},{"date":"2024-06-07","text":"Effects that replace an event with having you gain life (like Words of Worship's effect does) or having you lose life will end up replacing the event with nothing."},{"date":"2024-06-07","text":"Effects that would replace having you gain life with some other event won't be able to be applied because it's impossible for you to gain life."},{"date":"2024-06-07","text":"If a cost would include causing you to gain life, that cost can't be paid. Similarly, you can't pay a cost that includes the payment of any amount of life other than 0 life. However, you can choose to be dealt damage, even though that damage won't result in your life total changing."},{"date":"2024-06-07","text":"If an effect says to set your life total to a certain number, that part of the effect won't do anything."},{"date":"2024-06-07","text":"If an effect would cause you to exchange life totals with another player, the exchange won't happen. Neither player's life total changes."},{"date":"2024-06-07","text":"In a Commander game, the damage dealt to you by commanders will still be counted, even if that damage doesn't cause you to lose life."},{"date":"2024-06-07","text":"Spells and abilities that would normally cause you to gain or lose life still resolve while your life total can't change, but the life-gain or life-loss part simply has no effect."},{"date":"2024-06-07","text":"The effect of Flare of Fortitude doesn't prevent damage. Rather, it changes the results of that damage. For example, if a creature with lifelink deals damage to you, you won't lose any life, but its controller will still gain that much life. Similarly, if a creature you control with lifelink deals damage to another player, that player will lose life but you won't gain any life."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You may sacrifice a nontoken white creature rather than pay this spell's mana cost.\nUntil end of turn, your life total can't change, and permanents you control gain hexproof and indestructible.","type":"Instant","types":["Instant"],"uuid":"648c962b-3946-5dc3-9a21-f9269c2fc208"},{"artist":"Ryan Valle","artistIds":["6190569f-5e77-4bc1-bf22-9f85dba3a139"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":1.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298015","mtgjsonV4Id":"7c499847-59bd-57fb-a87e-f80bde5374d5","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ce1523f1-dcba-491c-90ea-92a34fabbdc4","scryfallIllustrationId":"84b5b9c4-bc13-42cb-8f16-e189464ef755","scryfallOracleId":"b304ac72-7f40-40de-b8d6-6392909b6029"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{W}","manaValue":1.0,"name":"Guide of Souls","number":"29s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/c64ed142d8936429"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"The type-changing effect of the reflexive triggered ability lasts indefinitely. It doesn't wear off during the cleanup step or when Guide of Souls leaves the battlefield."},{"date":"2024-06-07","text":"You don't choose a target for Guide of Souls's last ability at the time it triggers. Rather, a second \"reflexive\" ability triggers when you pay {E}{E}{E} this way. You choose a target for that ability as it goes on the stack. Each player may respond to this triggered ability as normal."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Human","Cleric"],"supertypes":[],"text":"Whenever another creature enters the battlefield under your control, you gain 1 life and get {E} (an energy counter).\nWhenever you attack, you may pay {E}{E}{E}. When you do, put two +1/+1 counters and a flying counter on target attacking creature. It becomes an Angel in addition to its other types.","toughness":"2","type":"Creature — Human Cleric","types":["Creature"],"uuid":"ba136d43-d586-58c9-9347-c5e3255e7985"},{"artist":"Chris Seaman","artistIds":["b9c49463-6f55-4039-9d32-c02a658af100"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":1.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298016","mtgjsonV4Id":"bf07a071-5c72-55c1-8e34-fa52d9318142","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"2343ea9c-9901-4162-8002-c1108826a75b","scryfallIllustrationId":"3007eb6b-793b-4fa7-9809-393232f2d37f","scryfallOracleId":"b4ce2c8f-a19c-461e-8a2e-0ec2bd3ebca3"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Ascend","First strike","Lifelink"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{W}","manaValue":1.0,"name":"Ocelot Pride","number":"38s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/5469dd982dd1386f"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A permanent is any object on the battlefield, including tokens and lands. Spells and emblems aren't permanents."},{"date":"2024-06-07","text":"Any enters-the-battlefield abilities of tokens you create will trigger when they enter the battlefield. Any \"As [this permanent] enters the battlefield\" or \"[This permanent] enters the battlefield with\" abilities of the tokens will also work."},{"date":"2024-06-07","text":"Ascend on a permanent isn't a triggered ability and doesn't use the stack. Players can respond to a spell that will give you your tenth permanent, but they can't respond to you getting the city's blessing once you control that tenth permanent. This means that if your tenth permanent is a land you play, players can't respond before you get the city's blessing."},{"date":"2024-06-07","text":"Each of the token copies you create copies the original characteristics of the token it's copying as stated by the effect that created that token. The newly created token doesn't copy whether the original token is tapped or untapped, whether it has any counters on it, whether it has any Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."},{"date":"2024-06-07","text":"If the creature token created by Ocelot Pride's last ability is your tenth permanent, you'll get the city's blessing before the ability would check to see if you have the city's blessing."},{"date":"2024-06-07","text":"If the original token is copying something else, the token copy you create will use the copiable values of the original token. In most cases, it will be a copy of whatever the original token is copying. If it's copying a permanent or card with {X} in its mana cost, X is 0."},{"date":"2024-06-07","text":"If you control ten permanents but don't control a permanent or resolving spell with ascend, you don't get the city's blessing. For example, if you control ten permanents, lose control of two, then cast Ocelot Pride, you won't have the city's blessing."},{"date":"2024-06-07","text":"If your tenth permanent enters the battlefield and then a permanent leaves the battlefield immediately afterwards (most likely due to the \"legend rule\" or due to being a creature with 0 toughness), you get the city's blessing before it leaves the battlefield."},{"date":"2024-06-07","text":"Ocelot Pride doesn't need to have been on the battlefield when you gained life. For example, if a creature with lifelink deals combat damage on your turn and you cast Ocelot Pride during your second main phase, its last ability will trigger at the beginning of your end step."},{"date":"2024-06-07","text":"Ocelot Pride's last ability doesn't target any of the tokens."},{"date":"2024-06-07","text":"Once you have the city's blessing, you have it for the rest of the game, even if you lose control of some or all your permanents. The city's blessing isn't a permanent itself and can't be removed by any effect."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Cat"],"supertypes":[],"text":"First strike, lifelink\nAscend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nAt the beginning of your end step, if you gained life this turn, create a 1/1 white Cat creature token. Then if you have the city's blessing, for each token you control that entered the battlefield this turn, create a token that's a copy of it.","toughness":"1","type":"Creature — Cat","types":["Creature"],"uuid":"7a17ea01-9e9c-562d-b327-0986e158c5c2"},{"artist":"Fajareka Setiawan","artistIds":["0cc534e0-be18-4cb1-8521-50fabd0dac6f"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298017","mtgjsonV4Id":"f59b665b-42f3-5205-bfbb-5c653592329e","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"df275d30-677a-45ae-ba34-d99a5e098281","scryfallIllustrationId":"8db1221a-06fc-45bb-bd91-77cca603bf1b","scryfallOracleId":"9bdc1e63-1cf9-4ddb-a7d5-f2a2eb91bdfd"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Lifelink"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{W}{W}","manaValue":3.0,"name":"Pearl-Ear, Imperial Advisor","number":"39s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/e3f4e4b04e38b95e"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A creature that is equipped is considered modified no matter who controls the Equipment that's attached to it."},{"date":"2024-06-07","text":"A creature with a counter on it is considered modified no matter what kind of counter it is or which player put it on that creature."},{"date":"2024-06-07","text":"A creature you control that's the target of an Aura spell isn't modified unless it already has a counter on it, an Equipment attached to it, or an Aura you control attached to it."},{"date":"2024-06-07","text":"An Aura controlled by another player does not cause a creature you control to be modified."},{"date":"2024-06-07","text":"If a spell has multiple instances of affinity, each one applies. For example, if you somehow control two Pearl-Ear, Imperial Advisors and you control two Auras, each enchantment spell you cast will cost {4} less to cast."},{"date":"2024-06-07","text":"If you put an Aura on an opponent's permanent, you still control the Aura, and it still counts for your spells that have affinity for Auras."},{"date":"2024-06-07","text":"Only creatures can be modified. If a modified creature stops being a creature, it is no longer considered modified."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Fox","Advisor"],"supertypes":["Legendary"],"text":"Lifelink\nEnchantment spells you cast have affinity for Auras. (They cost {1} less to cast for each Aura you control.)\nWhenever you cast an Aura spell that targets a modified permanent you control, draw a card. (Equipment, Auras you control, and counters are modifications.)","toughness":"4","type":"Legendary Creature — Fox Advisor","types":["Creature"],"uuid":"fcf6cb9a-d5c0-59d8-9539-2ca239f930a4"},{"artist":"Rudy Siswanto","artistIds":["23f86db1-9103-49bb-83d5-0fda18143921"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298018","mtgjsonV4Id":"c928c733-2312-58a4-9452-316a54b7aab0","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"c39859ab-dd74-47e3-8aca-306d1555537b","scryfallIllustrationId":"fec56c1b-e339-4232-8e2d-cf0bd692a5d5","scryfallOracleId":"5d86a59a-ba1f-45f7-b829-dca6f9f3e624"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flash"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{W}","manaValue":2.0,"name":"Phelia, Exuberant Shepherd","number":"40s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/dcb00fc414ec1009"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Auras attached to the exiled permanent will be put into their owners' graveyards. Equipment attached to the exiled permanent will become unattached and remain on the battlefield. Any counters on the exiled permanent will cease to exist. Once the exiled permanent returns, it's considered a new object with no relation to the object that it was."},{"date":"2024-06-07","text":"If a token is exiled this way, it will cease to exist and won't return to the battlefield."},{"date":"2024-06-07","text":"If the permanent that returns to the battlefield has any abilities that trigger at the beginning of the end step, those abilities won't trigger that turn."},{"date":"2024-06-07","text":"Phelia is a good dog."},{"date":"2024-06-07","text":"The exiled card will return to the battlefield at the beginning of the end step even if Phelia is no longer on the battlefield."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Dog"],"supertypes":["Legendary"],"text":"Flash\nWhenever Phelia, Exuberant Shepherd attacks, exile up to one other target nonland permanent. At the beginning of the next end step, return that card to the battlefield under its owner's control. If it entered under your control, put a +1/+1 counter on Phelia.","toughness":"2","type":"Legendary Creature — Dog","types":["Creature"],"uuid":"0a0ebcb7-3477-5bcf-97e0-f8fee61369aa"},{"artist":"Zoltan Boros","artistIds":["1885e6cb-c827-4896-994e-3d0a027d602f"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"His oath required no service beyond death, but his honor demanded it.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298019","mtgjsonV4Id":"a32f5dbb-750c-58d6-9e65-f33beab9d647","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"0cd78907-a14d-44e4-b578-1b2eb1398589","scryfallIllustrationId":"ed26da25-5090-4651-90fd-4f21923043ed","scryfallOracleId":"6edd2a36-3d65-4bf9-bd82-b6d03a7e8fea"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["First strike","Flying"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{W}{W}","manaValue":2.0,"name":"White Orchid Phantom","number":"47s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/2fac1056f503113a"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If the target land is an illegal target when White Orchid Phantom's last ability tries to resolve, it won't resolve and none of its effects will happen. That land's controller won't get to search for a basic land card."},{"date":"2024-06-07","text":"If the target land isn't destroyed by White Orchid Phantom's last ability (perhaps because the land has indestructible), its controller still gets to search for a basic land card."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Spirit","Knight"],"supertypes":[],"text":"Flying, first strike\nWhen White Orchid Phantom enters the battlefield, destroy up to one target nonbasic land. Its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.","toughness":"2","type":"Creature — Spirit Knight","types":["Creature"],"uuid":"67deb5c2-3ba9-5407-80cf-c54d0f285f3c"},{"artist":"Franz Vohwinkel","artistIds":["3a243c17-3baa-4b53-9599-645311cd7d3d"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"Even the weather of Dominaria shifts to assail would-be invaders.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298020","mtgjsonV4Id":"73907c99-0e6a-53c5-94f5-5282c36954d8","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"7efc6b27-8dd9-4208-b290-20fcb02cea54","scryfallIllustrationId":"7de67129-39db-4474-9267-732e1cba46fb","scryfallOracleId":"21efa6f2-3e7c-4576-b5a3-0b75b2843442"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{X}{W}{W}","manaValue":2.0,"name":"Wrath of the Skies","number":"49s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/9e1bccf8a61b3350"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Choosing not to pay any {E} will have the same result as choosing to pay zero {E}. In either of these cases, each artifact, creature, and enchantment with a mana value of 0 will be destroyed."},{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a permanent on the battlefield has {X} in its mana cost, X is 0 when determining its mana value."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You get X {E} (energy counters), then you may pay any amount of {E}. Destroy each artifact, creature, and enchantment with mana value less than or equal to the amount of {E} paid this way.","type":"Sorcery","types":["Sorcery"],"uuid":"6aa9a445-8ddf-5c08-b359-66770c467b85"},{"artist":"Omar Rayyan","artistIds":["256b61a2-b9af-4ff5-b485-47a61818f818"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298021","mtgjsonV4Id":"2cc2e77f-f6cd-5e6a-93ac-f94fae022103","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"72389187-ce0e-42b2-85f3-43a1308118be","scryfallIllustrationId":"09e597a1-6b44-45cf-8051-9b50e1342540","scryfallOracleId":"a4280cea-386b-450d-a7e9-29c7aa58ce5a"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Enchant","Flash","Storm"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{U}","manaValue":3.0,"name":"Amphibian Downpour","number":"51s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/270f3aad1b54dac8"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A copy of a spell can be countered like any other spell, but it must be countered individually. Countering a spell with storm won't affect the copies."},{"date":"2024-06-07","text":"Amphibian Downpour may enchant a permanent that is only temporarily a creature, such as a Vehicle. If this happens, Amphibian Downpour's effect causes the enchanted permanent to remain a 1/1 blue Frog creature even after the temporary effect making it a creature expires."},{"date":"2024-06-07","text":"Amphibian Downpour overwrites all colors and creature types the enchanted creature has. It's just a blue Frog. The creature keeps any supertypes it has (such as legendary) but loses any other card types it has (such as artifact)."},{"date":"2024-06-07","text":"Amphibian Downpour overwrites all previous effects that set the creature's base power and toughness to specific values. Any power- or toughness-setting effects that start to apply afterward will overwrite this effect."},{"date":"2024-06-07","text":"Because damage remains marked on a creature until the damage is removed as the turn ends, nonlethal damage dealt to a creature may become lethal if Amphibian Downpour becomes attached to it during that turn."},{"date":"2024-06-07","text":"Effects that modify the creature's power and/or toughness, such as the effect of Wing It, will apply to the creature no matter when they started to take effect. The same is true for counters that change its power and/or toughness and effects that switch its power and toughness."},{"date":"2024-06-07","text":"If the enchanted creature gains an ability after Amphibian Downpour becomes attached to it, it will keep that ability."},{"date":"2024-06-07","text":"If the enchanted creature has any subtypes other than creature types, such as Equipment, Vehicle, or Urza's, it loses those as well."},{"date":"2024-06-07","text":"Spells cast from zones other than a player's hand and spells that were countered or otherwise failed to resolve are counted by the storm ability."},{"date":"2024-06-07","text":"The copies are put directly onto the stack. They aren't cast and won't be counted by other spells with storm cast later in the turn."},{"date":"2024-06-07","text":"The triggered ability that creates the copies can itself be countered by anything that can counter a triggered ability. If it is countered, no copies will be put onto the stack."},{"date":"2024-06-07","text":"You may choose new targets for any of the copies. You can make different choices for each copy."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Aura"],"supertypes":[],"text":"Flash\nStorm (When you cast this spell, copy it for each spell cast before it this turn. You may choose new targets for the copies. Copies become tokens.)\nEnchant creature\nEnchanted creature loses all abilities and is a blue Frog creature with base power and toughness 1/1.","type":"Enchantment — Aura","types":["Enchantment"],"uuid":"b0b3b5e2-2608-52d5-91b6-63f77493d4b9"},{"artist":"Ron Spears","artistIds":["fce9030b-86bd-4439-b06a-920a1eeb184c"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298022","mtgjsonV4Id":"a764d7ef-c4cc-5f68-956e-140e7fee1bc8","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ea6c88c8-9d41-4f5d-ad89-5da0f06fd7a7","scryfallIllustrationId":"49acded0-1aab-4b06-bdb0-a2a02f3c1c44","scryfallOracleId":"ee8c0b4c-03c5-4da5-b4f1-028c845384af"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Proliferate","Vanishing"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{U}","manaValue":3.0,"name":"Dreamtide Whale","number":"59s","power":"7","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/00e630cbbdfa561d"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If a permanent that's already on the battlefield without time counters on it becomes a copy of a permanent with vanishing, it will stay on the battlefield indefinitely (unless time counters are somehow put on it later). If a permanent with one or more time counters on it becomes a copy of a permanent with vanishing, it will vanish as normal. If a permanent enters the battlefield as a copy of a permanent with vanishing, it enters with the appropriate number of time counters and will vanish as normal."},{"date":"2024-06-07","text":"If a player or permanent has more than one kind of counter on it, and you choose for it to get additional counters, it must get one of each kind of counter it already has. You can't have it get just one kind of counter it already has and not the others."},{"date":"2024-06-07","text":"If the last time counter is removed from a permanent with vanishing and the sacrifice ability is countered, that permanent will remain on the battlefield indefinitely with no time counters on it. As long as the permanent doesn't have any time counters on it, neither of vanishing's two triggered abilities will trigger again."},{"date":"2024-06-07","text":"Players can respond to a spell or ability whose effect includes proliferating. Once that spell or ability starts to resolve, however, and its controller chooses which permanents and players will get new counters, it's too late for anyone to respond."},{"date":"2024-06-07","text":"You don't have to choose every permanent or player that has a counter—only the ones you want to add counters to. Since \"any number\" includes zero, you don't have to choose any permanents at all, and you don't have to choose any players at all."},{"date":"2024-06-07","text":"hen you proliferate, you can choose any permanent that has a counter, including ones controlled by opponents. You can choose any player who has a counter, including opponents. You can't choose cards in any zone other than the battlefield, even if they have counters on them."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Whale"],"supertypes":[],"text":"Vanishing 2 (This creature enters the battlefield with two time counters on it. At the beginning of your upkeep, remove a time counter from it. When the last is removed, sacrifice it.)\nWhenever a player casts their second spell each turn, proliferate. (Choose any number of permanents and/or players, then give each another counter of each kind already there.)","toughness":"5","type":"Creature — Whale","types":["Creature"],"uuid":"de5ae3fd-2bac-584b-a979-cdf87202c20d"},{"artist":"Jason A. Engle","artistIds":["02e2b5de-4341-464c-8fdb-a1adbf873bc0"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"\"I see where you're going with that, and I don't like it.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298023","mtgjsonV4Id":"c095d889-64b8-59ad-a17b-2baf5a7ca788","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"b7e4f73b-2a55-42c1-9cdc-6423dd0d5950","scryfallIllustrationId":"43ff3ff2-3522-49ed-a9ff-3cc394e2e5db","scryfallOracleId":"437cfd16-94bc-43ba-afd8-e9e9d028a4ca"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{U}{U}","manaValue":3.0,"name":"Flare of Denial","number":"62s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/1656c1229fa8e692"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You may sacrifice a nontoken blue creature rather than pay this spell's mana cost.\nCounter target spell.","type":"Instant","types":["Instant"],"uuid":"765b8528-3619-5592-b6c6-cafff01d2c24"},{"artist":"Winona Nelson","artistIds":["e45fe8d3-75d6-42c9-a2df-e945ad81ea27"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"The rising moon calls mercilessly to the waves, commanding the sea to rise high enough to devour mountains.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298024","mtgjsonV4Id":"afba77ea-b188-5dcd-b284-9283322071dc","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"0cedea49-9640-4ccf-b817-829fd7806c0c","scryfallIllustrationId":"8d8cfb06-6b36-4dd9-9e42-bd21b8345f67","scryfallOracleId":"84910453-e5dc-4bff-8554-86a5f4ab2746"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{U}{U}","manaValue":3.0,"name":"Harbinger of the Seas","number":"63s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/7d2e67715cd06bbf"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Harbinger of the Seas doesn't affect names or supertypes. It won't turn any land into a basic land or remove the legendary supertype from a legendary land, and the lands won't be named \"Island.\""},{"date":"2024-06-07","text":"If Harbinger of the Seas loses its abilities, it continues to turn nonbasic lands into Islands. This is because effects that change subtypes are applied before considering effects that remove abilities, regardless of the order in which those effects started."},{"date":"2024-06-07","text":"If a nonbasic land has an ability that causes it to enter the battlefield tapped, it will lose that ability before it can apply. The same is also true of any other abilities that modify how a land enters the battlefield or apply \"as\" a land enters the battlefield, such as that of Vesuva or Cavern of Souls."},{"date":"2024-06-07","text":"If a nonbasic land has an ability that triggers \"when\" it enters the battlefield, it will lose that ability before it can trigger."},{"date":"2024-06-07","text":"Nonbasic lands lose any other land types and abilities they had. They gain the land type Island and gain the ability \"{T}: Add {U}.\""}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Merfolk","Wizard"],"supertypes":[],"text":"Nonbasic lands are Islands.","toughness":"2","type":"Creature — Merfolk Wizard","types":["Creature"],"uuid":"06d7e263-a20c-5f0f-8644-586cfb40d3c8"},{"artist":"Danny Schwartz","artistIds":["48e30a4a-5b4d-48e2-9c53-03125085374e"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":6.0,"finishes":["foil"],"flavorText":"Live fully, then return to the beginning.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298025","mtgjsonV4Id":"319e4184-6c73-5a45-94c0-436d4888930e","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ae3a1f86-810c-4c35-a62d-3bf9339a5685","scryfallIllustrationId":"34d15ce4-6941-4874-9679-5340b6d610d2","scryfallOracleId":"2ee9d018-02c7-43e7-ba2e-95e36d8ac0e8"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Enchant"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{4}{U}{U}","manaValue":6.0,"name":"Shadow of the Second Sun","number":"70s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/fb12f92c2575cae2"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"After the additional beginning phase, the game proceeds to the ending phase (unless something has added even more phases; see below)."},{"date":"2024-06-07","text":"Even if the enchanted player doesn't attack with any creatures during combat, they'll still get a postcombat main phase and Shadow of the Second Sun's ability will still trigger."},{"date":"2024-06-07","text":"If multiple phases are added to the same point in your turn, the most recently created phase happens first. For example, say you are enchanted by Shadow of the Second Sun and its ability triggers during your postcombat main phase. Later during that same main phase, another effect gives you an additional combat phase after this main phase. The additional combat will happen first, followed by the additional beginning phase."},{"date":"2024-06-07","text":"If the enchanted player somehow has more than two main phases in a turn, each main phase other than the first one is a postcombat main phase, and Shadow of the Second Sun's ability triggers at the beginning of each of them."},{"date":"2024-06-07","text":"The additional beginning phase all happens during the current turn. Any effects that last \"until your next turn\" or similar won't expire just because they'll go through an additional beginning phase."},{"date":"2024-06-07","text":"The enchanted player's additional beginning phase will be a lot like their normal beginning phase. During the untap step, permanents will phase in or out as appropriate and they'll untap their tapped permanents. Anything they control that triggers \"at the beginning of your upkeep\" or similar will trigger during their upkeep step, and they'll eventually draw a card for their draw step."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Aura"],"supertypes":[],"text":"Enchant player\nAt the beginning of enchanted player's postcombat main phase, there is an additional beginning phase after this phase. (The end step happens after the added untap, upkeep, and draw steps.)","type":"Enchantment — Aura","types":["Enchantment"],"uuid":"f84110e2-9184-5182-a896-ba7c8865a370"},{"artist":"Filipe Pagliuso","artistIds":["64c537b4-a864-4051-9a24-fbdd22cb40b4"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":1.0,"finishes":["foil"],"flavorText":"Some birds sing to nature's beauty and the freedom of the skies. Others simply ask questions.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298026","mtgjsonV4Id":"6a09184d-7c35-59bd-9900-30635b8cbfd6","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ef32f8e4-76ca-4edf-a77b-4c49c63123c4","scryfallIllustrationId":"b51bbf33-2bd0-40b8-a4f6-966acd28500a","scryfallOracleId":"7ca3aa03-e62d-464a-9111-e754abe17f76"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{U}","manaValue":1.0,"name":"Strix Serenade","number":"71s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/32f8fe03d58cba23"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Strix Serenade can target a spell that can't be countered. That spell won't be countered when Strix Serenade resolves, but its controller will get a Bird token. (This won't come up often, but when it does, it'll be a hoot.)"}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Counter target artifact, creature, or planeswalker spell. Its controller creates a 2/2 blue Bird creature token with flying.","type":"Instant","types":["Instant"],"uuid":"0bba0918-55c4-5cfb-b099-41d0b609bb26"},{"artist":"Drew Baker","artistIds":["a8c4ef83-94ad-41c7-861f-95debea16868"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":[],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298027","mtgjsonV4Id":"28a44a17-946c-5364-bac5-80eb7ac40725","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"0a80141e-fe03-469d-b057-23ee6aa54923","scryfallIllustrationId":"a0a9a837-6a6d-4166-adc9-1ceff911aad4","scryfallOracleId":"ed622e71-f348-4e46-8fb9-05aae430983a"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Devoid"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{U}","manaValue":3.0,"name":"Ugin's Binding","number":"76s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/1db8782a6cdb9538"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A card with devoid is just colorless. It's not colorless and the colors of mana in its mana cost."},{"date":"2024-06-07","text":"Devoid doesn't affect the color identity of the card for the purposes of the Commander variant. For example, while Abstruse Appropriation is colorless because it has devoid, its color identity is still white and black, and it can't be included in a Commander deck where the commander's color identity doesn't include both white and black."},{"date":"2024-06-07","text":"Devoid works in all zones, not just on the battlefield."},{"date":"2024-06-07","text":"If a card loses devoid, it will still be colorless. This is because effects that change an object's color (like the one created by devoid) are considered before the object loses devoid."},{"date":"2024-06-07","text":"Other cards and abilities can give a card with devoid a color. If that happens, it's just the new color, not that color and colorless."},{"date":"2024-06-07","text":"The last ability triggers only if Ugin's Binding is in your graveyard as you cast the colorless spell. That ability will resolve before the colorless spell does. If the colorless spell is countered or otherwise leaves the stack in response to Ugin's Binding's triggered ability, the ability will still resolve as normal."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Devoid (This card has no color.)\nReturn target nonland permanent you don't control to its owner's hand.\nWhenever you cast a colorless spell with mana value 7 or greater, you may exile Ugin's Binding from your graveyard. When you do, return each nonland permanent you don't control to its owner's hand.","type":"Instant","types":["Instant"],"uuid":"b700bb45-8798-5482-a5b9-f7b30ce65d93"},{"artist":"Campbell White","artistIds":["d281eab4-463a-4ba8-9039-8943737960a0"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298028","mtgjsonV4Id":"ac366bf1-c80e-5672-83aa-ba629dc872eb","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ff775584-0ce1-4d65-bc8d-5967fe417733","scryfallIllustrationId":"67ea2fb2-893e-4d7a-be09-d76d47e614d7","scryfallOracleId":"08d64b16-9221-4532-890c-d5cdbf181e28"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying","Hexproof","Hexproof from"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{U}","manaValue":2.0,"name":"Volatile Stormdrake","number":"79s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/792d6f8246f1a14d"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"As Volatile Stormdrake's last ability resolves, Volatile Stormdrake must be on the battlefield and the target creature must be a legal target. If either of these things isn't true, the ability does nothing."},{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, the effect giving you control of the target creature ends."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"The effect of Volatile Stormdrake's last ability lasts indefinitely. It doesn't wear off during the cleanup step, and it doesn't expire if Volatile Stormdrake leaves the battlefield."},{"date":"2024-06-07","text":"Volatile Stormdrake can't be the target of any activated or triggered abilities your opponents control."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Drake"],"supertypes":[],"text":"Flying, hexproof from activated and triggered abilities\nWhen Volatile Stormdrake enters the battlefield, exchange control of Volatile Stormdrake and target creature an opponent controls. If you do, you get {E}{E}{E}{E}, then sacrifice that creature unless you pay an amount of {E} equal to its mana value.","toughness":"2","type":"Creature — Drake","types":["Creature"],"uuid":"e6b7746c-0c9e-5122-80c9-bcf3bdf2d2a4"},{"artist":"Josu Solano","artistIds":["fb7b61a8-13c5-4813-a749-9d3396801906"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298029","mtgjsonV4Id":"6e1100bd-ecd5-53b0-96c0-5324422f6943","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ab73e637-547b-400d-9d30-c5c736e9d898","scryfallIllustrationId":"a292c90c-8ba0-4019-a16a-d12878c86bfc","scryfallOracleId":"c7a360f5-725e-4864-93cc-87f96f95975e"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{B}","manaValue":2.0,"name":"Chthonian Nightmare","number":"83s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d2b82d6485f9b99b"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Chthonian Nightmare's last ability must have a target to be activated. You can't activate it without a target in order to return Chthonian Nightmare to your hand."},{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a card in your graveyard has {X} in its mana cost, X is 0 when determining its mana value."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"When Chthonian Nightmare enters the battlefield, you get {E}{E}{E} (three energy counters).\nPay X {E}, Sacrifice a creature, Return Chthonian Nightmare to its owner's hand: Return target creature card with mana value X from your graveyard to the battlefield. Activate only as a sorcery.","type":"Enchantment","types":["Enchantment"],"uuid":"9df40238-45e9-593e-8cb7-aee941acc443"},{"artist":"Nicholas Gregory","artistIds":["a1bba8ff-63b4-4786-b1c4-f1bfe5d3ab1c"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":6.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298030","mtgjsonV4Id":"a1a9d1e2-661a-5723-a310-dafab579f4dc","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"41007710-f3b1-4879-8a09-b79fa40085b6","scryfallIllustrationId":"fa2a0d71-d7a6-45aa-949b-c78dd96dbc85","scryfallOracleId":"5c26c30b-bc4a-4d20-8406-ef9022256e0d"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Emerge"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{4}{B}{B}","manaValue":6.0,"name":"Crabomination","number":"85s","power":"5","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/472a63cf8cf3cfde"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"An artifact's mana value is determined solely by the mana symbols printed in its upper right corner (unless that artifact is the back face of a double-faced card, is a melded permanent, or is copying something else; see below). If the mana cost includes {X}, X is 0. If it's a single-faced card with no mana symbols in its upper right corner (because it's an animated land, for example), its mana value is 0. Ignore any alternative costs or additional costs (such as kicker) that were paid as the artifact was cast."},{"date":"2024-06-07","text":"Colored mana components of emerge costs can't be reduced with emerge."},{"date":"2024-06-07","text":"Crabomination's triggered ability doesn't allow you to play land cards, and as such, any land cards exiled with Crabomination's triggered ability will remain in exile. If you choose not to cast any of the exiled nonland cards (either because you can't or don't want to), those cards will remain in exile as well."},{"date":"2024-06-07","text":"Emerge from artifact is a variant of the emerge ability. It allows you to sacrifice an artifact rather than a creature, but otherwise functions identically to emerge."},{"date":"2024-06-07","text":"If you cast a spell for another cost \"without paying its mana cost,\" you can't choose to cast it for any alternative costs. You can, however, pay additional costs, such as kicker costs. If the spell has any mandatory additional costs, those must be paid to cast it."},{"date":"2024-06-07","text":"Once you begin to cast a spell with emerge, no player may take actions until you're done. Notably, opponents can't try to remove the permanent you wish to sacrifice."},{"date":"2024-06-07","text":"The artifact chosen to be sacrificed is still on the battlefield up through the time that you activate mana abilities. Its abilities may affect the spell's cost, be activated to generate mana, and so on. However, if it has an ability that triggers when a spell is cast, it will have been sacrificed before that ability can trigger."},{"date":"2024-06-07","text":"The mana value of a creature spell with emerge isn't affected by whether its emerge cost is paid. For example, if you cast Crabomination for its emerge cost and sacrifice an artifact whose mana value is 3, Crabomination's mana value remains 6."},{"date":"2024-06-07","text":"The mana value of the back face of a double-faced card is the mana value of its front face. The mana value of a melded permanent is the sum of the mana values of its front faces. An artifact that's a copy of either has a mana value of 0."},{"date":"2024-06-07","text":"The spell you cast without paying its mana cost is cast during the resolution of Crabomination's triggered ability. Timing restrictions of that spell based on card type are ignored."},{"date":"2024-06-07","text":"You choose whether or not to cast one of the exiled cards as Crabomination's triggered ability resolves. If you do, you do so as part of the resolution of that ability. You can't wait to cast it later in the turn. Timing restrictions based on the card's type are ignored."},{"date":"2024-06-07","text":"You may sacrifice an artifact with a mana value of 0, such as a Food token, to cast Crabomination for its emerge cost. You'll just pay the full emerge cost with no reduction."},{"date":"2024-06-07","text":"You may sacrifice an artifact with mana value greater than or equal to the emerge cost. If you do, you'll pay only the colored mana component of the emerge cost."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Crab","Demon"],"supertypes":[],"text":"Emerge from artifact {5}{B}{B} (You may cast this spell by sacrificing an artifact and paying the emerge cost reduced by that artifact's mana value.)\nWhen Crabomination enters the battlefield, target opponent exiles the top card of their library, a card at random from their graveyard, and a card at random from their hand. You may cast a spell from among cards exiled this way without paying its mana cost.","toughness":"5","type":"Creature — Crab Demon","types":["Creature"],"uuid":"41a3e6d5-7c16-5a3c-9534-fa5473ebb157"},{"artist":"Josh Hass","artistIds":["8fa1fdf0-96d6-46f4-a7ff-b1c0257c3735"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298031","mtgjsonV4Id":"03e7112f-0204-5ec3-bd5b-4611dfd94f46","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"1478025d-1194-4910-bf3d-cc8c79f9ee64","scryfallIllustrationId":"0422419a-03c0-44fc-9e9e-24eaab138c42","scryfallOracleId":"cb70a360-898e-443a-b053-38e35ea2baa2"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Adapt"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{B}","manaValue":2.0,"name":"Emperor of Bones","number":"90s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/5c381e80e511c63b"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Finality counters aren't keyword counters, and a finality counter doesn't give any abilities to the permanent it's on. If that permanent loses its abilities and then would go to a graveyard, it will still be exiled instead."},{"date":"2024-06-07","text":"Finality counters don't stop permanents from going to zones other than the graveyard from the battlefield. For example, if a permanent with a finality counter on it would be put into its owner's hand from the battlefield, it does so normally."},{"date":"2024-06-07","text":"If a creature somehow loses all of its +1/+1 counters, it can adapt again and get more +1/+1 counters."},{"date":"2024-06-07","text":"If any permanent with a finality counter on it would go to a graveyard from the battlefield, exile it instead."},{"date":"2024-06-07","text":"Multiple finality counters on a single permanent are redundant."},{"date":"2024-06-07","text":"You can always activate an ability that will cause a creature to adapt. As that ability resolves, if the creature has a +1/+1 counter on it for any reason, you simply won't put any +1/+1 counters on it."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Skeleton","Noble"],"supertypes":[],"text":"At the beginning of combat on your turn, exile up to one target card from a graveyard.\n{1}{B}: Adapt 2.\nWhenever one or more +1/+1 counters are put on Emperor of Bones, put a creature card exiled with Emperor of Bones onto the battlefield under your control with a finality counter on it. It gains haste. Sacrifice it at the beginning of the next end step.","toughness":"2","type":"Creature — Skeleton Noble","types":["Creature"],"uuid":"6c9e93c3-1eaf-5574-bd7d-dbfcb6f516ce"},{"artist":"David Palumbo","artistIds":["04ce1c75-e30c-4b7a-8cb0-b53e4ecc2f39"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":4.0,"finishes":["foil"],"flavorText":"\"Suffer as I have suffered. Lose as I have lost.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298032","mtgjsonV4Id":"46c5003f-5370-5f28-b06c-fbd00164c5f1","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ebeb9bcb-fc20-4c3e-88b7-ab3a6ba2db41","scryfallIllustrationId":"b7a4d1ce-c110-4c6b-ba7a-2891f4261bef","scryfallOracleId":"4ce156f8-6b0b-41ce-9e8f-b2735c757406"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{B}{B}","manaValue":4.0,"name":"Flare of Malice","number":"95s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/127a964ded047a91"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If an opponent has multiple creatures and/or planeswalkers tied for the greatest mana value, that player chooses which one to sacrifice."},{"date":"2024-06-07","text":"Starting with the next opponent in turn order (or, if you cast Flare of Malice on an opponent's turn, starting with the opponent whose turn it is) and proceeding in turn order, each opponent chooses a creature or planeswalker with the greatest mana value among creatures and planeswalkers they control to sacrifice. Then those permanents are sacrificed at the same time."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You may sacrifice a nontoken black creature rather than pay this spell's mana cost.\nEach opponent sacrifices a creature or planeswalker with the greatest mana value among creatures and planeswalkers they control.","type":"Instant","types":["Instant"],"uuid":"2b489962-92ed-52a0-8da5-49abcb70d9ce"},{"artist":"Robin Olausson","artistIds":["adb9ad6d-6173-454b-8b50-a102b182548b"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298033","mtgjsonV4Id":"09c86717-d90a-5b05-85e3-4209b1b2df33","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"35a311e7-9bce-484b-af41-570697aabbb1","scryfallIllustrationId":"e03d6045-fee9-4164-8217-8c5c507a167a","scryfallOracleId":"a10b3e35-8cc4-450e-9e30-0fce8df0fea4"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{B}{B}{B}","manaValue":3.0,"name":"Necrodominance","number":"102s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/8d8cc4bf0af2e63e"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"If a Necrodominance you control is destroyed by a spell you own, Necrodominance will be exiled and then the spell will be put into your graveyard."},{"date":"2024-06-07","text":"If a player has more cards in their hand than their maximum hand size during the cleanup step of that player's turn, that player discards until they have that many cards. A player's maximum hand size isn't checked at any time other than their own cleanup step."},{"date":"2024-06-07","text":"If multiple effects modify your hand size, apply them in timestamp order. For example, if you put Necrodominance onto the battlefield and then put Spellbook (an artifact that says you have no maximum hand size) onto the battlefield, you would have no maximum hand size. However, if those permanents entered the battlefield in the opposite order, your maximum hand size would be five."},{"date":"2024-06-07","text":"If you discard a card while you control Necrodominance, abilities that function when a card is discarded (such as madness) still work, even though that card never reaches your graveyard. In addition, spells or abilities that check the characteristics of a discarded card (such as connive) can find that card in exile."},{"date":"2024-06-07","text":"While Necrodominance is on the battlefield under your control, abilities that trigger whenever a permanent you own is put into your graveyard from the battlefield (for example, \"When this creature dies…\") won't trigger because cards and tokens are never put into your graveyard."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":["Legendary"],"text":"Skip your draw step.\nAt the beginning of your end step, you may pay any amount of life. If you do, draw that many cards.\nYour maximum hand size is five.\nIf a card or token would be put into your graveyard from anywhere, exile it instead.","type":"Legendary Enchantment","types":["Enchantment"],"uuid":"d5af41e2-1070-5570-b58b-66f14600f222"},{"artist":"Xavier Ribeiro","artistIds":["e17c2662-0491-47b2-bf1d-8c111a8ad3f8"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":1.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298034","mtgjsonV4Id":"f5e3c53f-dfa3-5c76-aefd-d3b858f41a58","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"e4246003-e1c5-4ad2-8035-9bcb727c0d2b","scryfallIllustrationId":"bb6cb876-531b-452a-b1cf-87eeb977d5ca","scryfallOracleId":"040cbd8a-a9e5-454b-a5ae-9b66bb66b8e9"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Escape"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{B}","manaValue":1.0,"name":"Nethergoyf","number":"103s","power":"*","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/0a47ab14e9f6a351"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"After an escaped spell resolves, it returns to its owner's graveyard if it's not a permanent spell. If it is a permanent spell, it enters the battlefield and will return to its owner's graveyard if it dies later. It can escape again."},{"date":"2024-06-07","text":"Card types that can appear on cards in a graveyard are artifact, battle, creature, enchantment, instant, kindred, land, planeswalker, and sorcery. Legendary, basic, and snow are supertypes, not card types; Lhurgoyf, Forest, and Siege are subtypes, not card types."},{"date":"2024-06-07","text":"Escape's permission doesn't change when you may cast the spell from your graveyard."},{"date":"2024-06-07","text":"If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."},{"date":"2024-06-07","text":"If a card with escape is put into your graveyard during your turn, you'll be able to cast it right away if it's legal to do so, before an opponent can take any actions."},{"date":"2024-06-07","text":"If you cast a spell with its escape permission, you can't choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."},{"date":"2024-06-07","text":"Nethergoyf's first ability counts card types, not cards. If the only card in your graveyard is a single artifact creature card, Nethergoyf will be a 2/3. If your graveyard consists of ten artifact cards and ten creature cards, Nethergoyf will still be a 2/3."},{"date":"2024-06-07","text":"Once you begin casting a spell with escape, it immediately moves to the stack. Players can't take any other actions until you're done casting the spell."},{"date":"2024-06-07","text":"The ability that defines Nethergoyf's power and toughness works in all zones, not just the battlefield."},{"date":"2024-06-07","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you're paying (such as an escape cost), add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Lhurgoyf"],"supertypes":[],"text":"Nethergoyf's power is equal to the number of card types among cards in your graveyard and its toughness is equal to that number plus 1.\nEscape—{2}{B}, Exile any number of other cards from your graveyard with four or more card types among them. (You may cast this card from your graveyard for its escape cost.)","toughness":"1+*","type":"Creature — Lhurgoyf","types":["Creature"],"uuid":"3fe312d0-0e9c-5334-850b-711d4b95d394"},{"artist":"Ben Wootten","artistIds":["31cdca96-ecde-4245-bfb6-653929d57d9c"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"As the monster lay dying, it stared into the eyes of the human who slew it. Decades later, it has yet to break its gaze.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298035","mtgjsonV4Id":"e19ec14e-5699-5859-9bcd-c7ac843a5afc","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"a18b861b-1c6e-4415-9373-4440906a57dd","scryfallIllustrationId":"c43a919d-f327-440c-8be7-1836d0271435","scryfallOracleId":"2acf8e34-9215-4a72-a24f-09d3bdd0083a"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Mill"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{B}","manaValue":2.0,"name":"Ripples of Undeath","number":"107s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/25ddfa8f337a754c"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"At the beginning of your precombat main phase, mill three cards. Then you may pay {1} and 3 life. If you do, put a card from among those cards into your hand.","type":"Enchantment","types":["Enchantment"],"uuid":"a1f11e43-3ac0-5532-8cf6-d0c515fafbc9"},{"artist":"Chris Rallis","artistIds":["a8e7b854-b15a-421a-b66d-6e68187ae285"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","W"],"colors":["B"],"convertedManaCost":5.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298036","mtgjsonV4Id":"8b21841d-a97c-5aea-8dac-b836d1bf6fb0","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"d11c8ece-0330-4f5c-9a27-e81434f7c01f","scryfallIllustrationId":"83e1a360-ac95-437d-a538-97eb0a79df80","scryfallOracleId":"71ac4d8c-5b58-4ea8-996b-f0289717c4bb"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{3}{B}{B}","manaValue":5.0,"name":"Shilgengar, Sire of Famine","number":"109s","power":"6","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/4c4ca9954729c720"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Finality counters aren't keyword counters, and a finality counter doesn't give any abilities to the permanent it's on. If that permanent loses its abilities and then would go to a graveyard, it will still be exiled instead."},{"date":"2024-06-07","text":"Finality counters don't stop permanents from going to zones other than the graveyard from the battlefield. For example, if a permanent with a finality counter on it would be put into its owner's hand from the battlefield, it does so normally."},{"date":"2024-06-07","text":"Finality counters work on any permanent, not only creatures. If a permanent with a finality counter on it would go to a graveyard from the battlefield, exile it instead."},{"date":"2024-06-07","text":"If you sacrificed an Angel to pay the cost of Shilgengar's second ability, use the toughness of that Angel as it last existed on the battlefield to determine how many Blood tokens to create."},{"date":"2024-06-07","text":"Multiple finality counters on a single permanent are redundant."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Elder","Demon"],"supertypes":["Legendary"],"text":"Flying\nSacrifice another creature: Create a Blood token. If you sacrificed an Angel this way, create a number of Blood tokens equal to its toughness instead.\n{W/B}{W/B}{W/B}, Sacrifice six Blood tokens: Return each creature card from your graveyard to the battlefield with a finality counter on it. Those creatures are Vampires in addition to their other types.","toughness":"6","type":"Legendary Creature — Elder Demon","types":["Creature"],"uuid":"09ca7d04-8d6e-5b63-995b-1b5df38744f4"},{"artist":"Pete Venters","artistIds":["d54c4a1a-c0c5-4834-84db-125d341f3ad8"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"\"The living take their souls for granted. The dead know what they're worth.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298037","mtgjsonV4Id":"a083a39b-062c-5112-b849-5e485ad10c66","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"55ad90d3-d2f0-4606-bd96-1878d7317d06","scryfallIllustrationId":"e0b5ff17-1609-4169-b60a-63d9325c14a3","scryfallOracleId":"ace86e56-efde-4eb7-8815-71456a4c3abe"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Treasure"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{B}","manaValue":3.0,"name":"Warren Soultrader","number":"110s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/2a9a44e0d09a95d3"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":["Zombie","Goblin","Wizard"],"supertypes":[],"text":"Pay 1 life, Sacrifice another creature: Create a Treasure token. (It's an artifact with \"{T}, Sacrifice this artifact: Add one mana of any color.\")","toughness":"3","type":"Creature — Zombie Goblin Wizard","types":["Creature"],"uuid":"cd401f09-d78c-5e89-b224-e5a363fc70b1"},{"artist":"Filipe Pagliuso","artistIds":["64c537b4-a864-4051-9a24-fbdd22cb40b4"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298039","mtgjsonV4Id":"6085fae3-82f1-5c74-971d-77b0f70b869c","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"271ef715-861c-4dad-93b2-160e29131c49","scryfallIllustrationId":"4b06f8cb-42b3-4827-90be-a1672783ed71","scryfallOracleId":"b73661a6-d136-4c65-804c-461e83484f4b"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Revolt"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{R}{R}","manaValue":4.0,"name":"Aether Revolt","number":"113s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/648a73f3dc828e36"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect instructs you to get one or more {E} and then allows you to spend {E}, Aether Revolt's last ability will see the amount of {E} you got. It doesn't matter how much {E} you spend after that."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"If another effect modifies how much damage a source would deal to an opponent or a permanent they control, including preventing some of it, the player being dealt damage or the controller of the permanent being dealt damage chooses an order in which to apply those effects. If all of the damage is prevented, Aether Revolt's effect no longer applies."},{"date":"2024-06-07","text":"If noncombat damage dealt by a source you control is being divided or assigned among multiple opponents and/or permanents opponents control, divide the original amount before adding 2. For example, if you cast a spell that deals 4 damage divided among any number of targets and you choose to have it deal 2 damage to a creature and 2 damage to that creature's controller, that spell will deal 4 damage to each of them instead."},{"date":"2024-06-07","text":"If you get multiple {E} at once, Aether Revolt's last ability will trigger only once. When the triggered ability resolves, it will deal damage to the target equal to the amount of {E} you gained."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Once a permanent you control leaves the battlefield, Aether Revolt's revolt ability will apply to noncombat damage dealt by sources you control until the turn ends or Aether Revolt leaves the battlefield, whichever happens first. It doesn't matter what happens to the card or token that left the battlefield afterward."},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"The additional damage is dealt by the original source of the damage, not by Aether Revolt."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Revolt — As long as a permanent you controlled left the battlefield this turn, if a source you control would deal noncombat damage to an opponent or a permanent an opponent controls, it deals that much damage plus 2 instead.\nWhenever you get one or more {E}, Aether Revolt deals that much damage to any target.","type":"Enchantment","types":["Enchantment"],"uuid":"de7ef6e3-2184-5d38-a61c-f3f0207e0afa"},{"artist":"Michal Ivan","artistIds":["89ba58cb-84a6-480b-a86c-d8ae57df2834"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298040","mtgjsonV4Id":"862dd0a6-1d54-53c5-8faa-df307c849f18","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"10661bc7-fe73-4595-b294-21379196f26a","scryfallIllustrationId":"6610f2bc-b8f9-4011-9db3-2a63060f202d","scryfallOracleId":"6fe9fd59-9cac-4572-8f94-bc19bea44f94"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Magecraft"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{R}{R}","manaValue":4.0,"name":"Ashling, Flame Dancer","number":"115s","power":"4","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/a86b2e8ae40141d5"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"If a red mana you add has certain restrictions or riders associated with it (for example, if it was produced by the last ability of Arena of Glory), they'll apply to that mana no matter when you spend it."},{"date":"2024-06-07","text":"If an effect creates multiple copies of an instant or sorcery spell, Ashling's last ability triggers once for each copy created by the effect."},{"date":"2024-06-07","text":"Once Ashling leaves the battlefield, you have until the end of the current step or phase to spend whatever red mana you have before you lose that mana as normal. There is no penalty associated with this other than the loss of the mana."},{"date":"2024-06-07","text":"Some effects instruct you to copy an instant or sorcery card in a zone other than the stack. These copies will not cause Ashling's last ability to trigger. However, most effects that do this also allow you to cast the copy, and casting the copy will cause Ashling's last ability to trigger."},{"date":"2024-06-07","text":"You can keep unspent red mana indefinitely while Ashling is on the battlefield. That means if you add a red mana during one step or phase, you can spend it during a later step or phase, or even a later turn. You will still lose other types of unspent mana as each step and phase ends."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Elemental","Shaman"],"supertypes":["Legendary"],"text":"You don't lose unspent red mana as steps and phases end.\nMagecraft — Whenever you cast or copy an instant or sorcery spell, discard a card, then draw a card. If this is the second time this ability has resolved this turn, Ashling, Flame Dancer deals 2 damage to each opponent and each creature they control. If it's the third time, add {R}{R}{R}{R}.","toughness":"4","type":"Legendary Creature — Elemental Shaman","types":["Creature"],"uuid":"3cfdd993-0c65-59a6-86dd-1104111f20be"},{"artist":"Deruchenko Alexander","artistIds":["806f6ff9-6ed4-4e93-998a-a562c0b792e6"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298041","mtgjsonV4Id":"beb4f548-1f11-5ffd-9ea4-3c711d37b74b","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ee6c975f-0629-482a-8041-c8e059cc6a68","scryfallIllustrationId":"39fd322a-23ce-4b3b-b127-e9ca8fe1a008","scryfallOracleId":"52c3fe55-74ee-44cb-b62b-dc6c5dfdc33e"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Bestow","Collect evidence","Flying","Haste"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{R}","manaValue":3.0,"name":"Detective's Phoenix","number":"116s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/c908183be93b87a8"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Auras attached to a creature don't become tapped when the creature becomes tapped. Except in some rare cases, an Aura with bestow remains untapped when it becomes unattached and becomes a creature."},{"date":"2024-06-07","text":"If a permanent with bestow enters the battlefield by any method other than being cast, it will be an enchantment creature. You can't choose to pay the bestow cost and have it become an Aura."},{"date":"2024-06-07","text":"If you can't exile enough cards to meet or exceed the required mana value, you can't choose to collect evidence at all."},{"date":"2024-06-07","text":"On the stack, a spell with bestow is either a creature spell or an Aura spell. It's never both, although it's an enchantment spell in either case."},{"date":"2024-06-07","text":"Once you've announced that you're casting a spell, players can't take actions until you've finished doing so. Notably, opponents can't try to remove cards from your graveyard to stop you from collecting evidence."},{"date":"2024-06-07","text":"Unlike other Aura spells, an Aura spell with bestow isn't countered if its target is illegal as it begins to resolve. Rather, the effect making it an Aura spell ends, it loses enchant creature, it returns to being an enchantment creature spell, and it resolves and enters the battlefield as an enchantment creature."},{"date":"2024-06-07","text":"Unlike other Auras, an Aura with bestow isn't put into its owner's graveyard if it becomes unattached. Rather, the effect making it an Aura ends, it loses enchant creature, and it remains on the battlefield as an enchantment creature. It can attack (and its {T} abilities can be activated, if it has any) on the turn it becomes unattached if it's been under your control continuously, even as an Aura, since your most recent turn began."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Phoenix"],"supertypes":[],"text":"Bestow—{R}, Collect evidence 6. (To pay this bestow cost, pay {R} and exile cards with total mana value 6 or greater from your graveyard.)\nFlying, haste\nEnchanted creature gets +2/+2 and has flying and haste.\nYou may cast Detective's Phoenix from your graveyard using its bestow ability.","toughness":"2","type":"Enchantment Creature — Phoenix","types":["Enchantment","Creature"],"uuid":"0dd8b58f-2904-5958-9496-299d1d9a83fb"},{"artist":"Leonardo Santanna","artistIds":["f1f8e6d8-8fb3-472a-a32f-a4b1225bd054"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":[],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298042","mtgjsonV4Id":"f4f71b14-07b1-5b77-be2b-9dece2eb1c6e","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"1fa5e693-2719-415e-add1-cd89c4bc919c","scryfallIllustrationId":"bf5ae25d-b874-4782-8fee-f22540bf58d9","scryfallOracleId":"db432387-58d3-4473-9442-b5b586dbea38"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Devoid","Trample"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{C}{R}","manaValue":3.0,"name":"Eldrazi Linebreaker","number":"117s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/82467df717c75c38"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A card with devoid is just colorless. It's not colorless and the colors of mana in its mana cost."},{"date":"2024-06-07","text":"Devoid doesn't affect the color identity of the card for the purposes of the Commander variant. For example, while Abstruse Appropriation is colorless because it has devoid, its color identity is still white and black, and it can't be included in a Commander deck where the commander's color identity doesn't include both white and black."},{"date":"2024-06-07","text":"Devoid works in all zones, not just on the battlefield."},{"date":"2024-06-07","text":"If a card loses devoid, it will still be colorless. This is because effects that change an object's color (like the one created by devoid) are considered before the object loses devoid."},{"date":"2024-06-07","text":"Other cards and abilities can give a card with devoid a color. If that happens, it's just the new color, not that color and colorless."},{"date":"2024-06-07","text":"The value of X is calculated only once, as Eldrazi Linebreaker's last ability resolves."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":[],"text":"Devoid (This card has no color.)\nTrample\nAt the beginning of combat on your turn, target creature you control gains haste and gets +X/+0 until end of turn, where X is the number of Eldrazi you control.","toughness":"3","type":"Creature — Eldrazi","types":["Creature"],"uuid":"253196a6-b73d-5347-8d60-9d16f9b9f80a"},{"artist":"Olivier Bernard","artistIds":["11c6f325-68c2-4f2a-972d-98d2ffe6c224"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"\"Decent. But let me show you what mastery looks like.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298043","mtgjsonV4Id":"8c824635-24c8-54a2-a62d-561eafacd087","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"5edc2617-7d04-425d-a2ca-4a4c696e4b63","scryfallIllustrationId":"ff86bbbf-8f71-472b-b9b8-d2e9818fd5fc","scryfallOracleId":"f586ecb8-310c-4f40-a766-6a7ca46a254d"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{R}{R}","manaValue":3.0,"name":"Flare of Duplication","number":"119s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/7b595fffebe636ab"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If the spell has damage divided as it was cast, the division can't be changed (although the targets receiving that damage still can). The same is true of spells that distribute counters."},{"date":"2024-06-07","text":"If the spell that's copied has an X whose value was determined as it was cast (like Kozilek's Command does), the copy will have the same value of X."},{"date":"2024-06-07","text":"If the spell that's copied is modal (that is, it says \"Choose one —\" or the like), the copy will have the same mode. A different mode can't be chosen."},{"date":"2024-06-07","text":"If you copy a spell, you control the copy. It will resolve before the original spell does."},{"date":"2024-06-07","text":"The controller of a copy can't choose to pay any alternative or additional costs for the copy. However, effects based on any alternative or additional costs that were paid for the original spell are copied as though those same costs were paid for the copy."},{"date":"2024-06-07","text":"The copy is created on the stack, so it's not \"cast.\" Abilities that trigger when a player casts a spell won't trigger."},{"date":"2024-06-07","text":"The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You may sacrifice a nontoken red creature rather than pay this spell's mana cost.\nCopy target instant or sorcery spell. You may choose new targets for the copy.","type":"Instant","types":["Instant"],"uuid":"b1bb2b9b-e52f-5d30-b861-68291a3771e0"},{"artist":"Leanna Crossan","artistIds":["976cfe82-042e-4c2a-b762-2bc3e86cb6d0"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298044","mtgjsonV4Id":"bf92c8c4-6f9f-5012-8506-3c42e1409b30","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"8effa88d-eabf-4ee3-91c0-05e3d0bb8530","scryfallIllustrationId":"ecba8423-3034-49d1-8cb7-c499b4f54ad7","scryfallOracleId":"03cd7583-d054-4359-8c94-7776c54198ed"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{R}","manaValue":2.0,"name":"Party Thrasher","number":"129s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/696578ca24d1294f"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Because convoke isn't an alternative cost, it can be used in conjunction with alternative costs."},{"date":"2024-06-07","text":"If a creature you control has a mana ability with {T} in the cost, activating that ability while casting a spell with convoke will result in the creature being tapped before you pay the spell's costs. You won't be able to tap it again for convoke. Similarly, if you sacrifice a creature to activate a mana ability while casting a spell with convoke, that creature won't be on the battlefield when you pay the spell's costs, so you won't be able to tap it for convoke."},{"date":"2024-06-07","text":"If you sacrifice Party Thrasher while casting a noncreature spell from exile (to activate a mana ability, for example), the spell won't have convoke when you pay its costs unless it has convoke some other way."},{"date":"2024-06-07","text":"Multiple instances of convoke on a single spell are redundant."},{"date":"2024-06-07","text":"When calculating a spell's total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Convoke applies after the total cost is calculated. Convoke doesn't change a spell's mana cost or mana value."},{"date":"2024-06-07","text":"When using convoke to cast a spell with {X} in its cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell's total cost. Then you can tap creatures you control to help pay that cost. For example, if you cast Wrath of the Skies (a spell with mana cost {X}{W}{W}) from exile, choosing 3 as the value of X, the total cost is {3}{W}{W}. If you tap a white creature and a red creature, you'll have to pay {2}{W}."},{"date":"2024-06-07","text":"You pay all costs and follow all normal timing rules for cards played using Party Thrasher's second ability. For example, if the chosen exiled card is a land card, you may play it only during your main phase while the stack is empty."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Lizard","Wizard"],"supertypes":[],"text":"Noncreature spells you cast from exile have convoke. (Each creature you tap while casting a noncreature spell from exile pays for {1} or one mana of that creature's color.)\nAt the beginning of your precombat main phase, you may discard a card. If you do, exile the top two cards of your library, then choose one of them. You may play that card this turn.","toughness":"4","type":"Creature — Lizard Wizard","types":["Creature"],"uuid":"0a7faa1f-7ba3-5b56-8c07-9dcd149b1275"},{"artist":"Steve Ellis","artistIds":["39d8411c-2187-426c-8ad3-d4f688b22db1"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"For every action, a reaction. For every force, a firestorm.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298045","mtgjsonV4Id":"7378b565-613e-5940-87a9-1d6e1f0a0c6d","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"f1357d73-9886-4666-b402-fada7dd8d4bf","scryfallIllustrationId":"8f08e3f6-350e-4e00-95ef-3d8569d11d22","scryfallOracleId":"8be368dc-6212-4627-989e-077eea78f30d"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{R}{R}","manaValue":2.0,"name":"Powerbalance","number":"131s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/eafa659eec8ddec2"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A spell's mana value is determined only by its mana cost. Ignore any alternative costs, additional costs, cost increases, or cost reductions."},{"date":"2024-06-07","text":"If an opponent casts a spell with {X} in its mana cost, use the value of X that was chosen when it was cast to determine its mana value."},{"date":"2024-06-07","text":"If the revealed card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."},{"date":"2024-06-07","text":"If you cast a spell \"without paying its mana cost,\" you can't choose to cast it for any alternative costs. You can, however, pay additional costs, such as kicker costs. If the spell has any mandatory additional costs, those must be paid to cast it."},{"date":"2024-06-07","text":"In some unusual cases, the card you reveal from the top of your library may not have the same mana value as the spell your opponent cast, but you can still cast that card because the resulting spell does have the same mana value. For example, if an opponent casts a spell with mana value 4 and you reveal Frogmyr Enforcer (a prototype card with mana cost {7} and prototype cost {3}{R}), you can cast Frogmyr Enforcer as a prototyped spell, as that spell will have a mana value of 4."},{"date":"2024-06-07","text":"The mana value of a split card not on the stack or a fused split spell on the stack is determined by the combined mana cost of its two halves. Otherwise, while a split card is on the stack, its mana value is determined by the mana cost of the half that was chosen to be cast."},{"date":"2024-06-07","text":"You choose whether or not to cast the exiled card as Powerbalance's triggered ability resolves. If you do, you do so as part of the resolution of that ability. You can't wait to cast it later in the turn. Timing restrictions based on the card's type are ignored."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Whenever an opponent casts a spell, you may reveal the top card of your library. If you do, you may cast that card without paying its mana cost if the two spells have the same mana value.","type":"Enchantment","types":["Enchantment"],"uuid":"eb822a49-fb3e-5152-ba34-aaa9368c8f42"},{"artist":"Drew Baker","artistIds":["a8c4ef83-94ad-41c7-861f-95debea16868"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"The wheel only has one sure output: chaos.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298046","mtgjsonV4Id":"5ce70540-2faa-53f7-a6cf-221f36a6149c","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"151eeadc-2cff-47db-8cd3-48f1005534cc","scryfallIllustrationId":"8de429de-f4e4-4078-bf77-b38feb053ed0","scryfallOracleId":"95a7db5d-26f6-4192-9dc7-4342f7e0e9c5"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{R}","manaValue":3.0,"name":"Wheel of Potential","number":"144s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/3ee993803e4fc4ae"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Players decide and announce in turn order, starting with the active player, whether or not they want to exile their hand. Then, all players who chose to do so exile their hands and draw X cards. Players later in the turn order will know if players before them are exiling their hands, but they don't get to see what those players will exile to help them decide whether to exile their hands themselves."},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"You pay all costs and follow all normal timing rules for cards played this way. For example, if one of the exiled cards is a land card, you may play it only during your main phase while the stack is empty."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You get {E}{E}{E} (three energy counters), then you may pay X {E}.\nEach player may exile their hand and draw X cards. If X is 7 or more, you may play cards you own exiled this way until the end of your next turn.","type":"Sorcery","types":["Sorcery"],"uuid":"828d6b45-2824-5d2e-b82f-4904dc52eb0c"},{"artist":"Drew Tucker","artistIds":["22eef389-7b21-4dda-95dc-4c9a0f1bf4dd"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298047","mtgjsonV4Id":"a05841c9-b5a1-5542-8faf-b8b6e551f312","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"c341e592-5545-4d28-b65f-2c91a0516712","scryfallIllustrationId":"71b34179-e932-4df2-8a7e-05f5bae9a6b1","scryfallOracleId":"37a5ab64-12e4-4aad-9a09-46a26fe9953b"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}","manaValue":2.0,"name":"Birthing Ritual","number":"146s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/556a3d28225a67b9"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"Birthing Ritual's ability checks if you control a creature at the beginning of your end step. If you don't, the ability won't trigger."},{"date":"2024-06-07","text":"If Birthing Ritual's ability does trigger but you control no creatures when it tries to resolve, the ability will do nothing."},{"date":"2024-06-07","text":"If one of the revealed creature cards has {X} in its mana cost, X is 0 when determining that card's mana value."},{"date":"2024-06-07","text":"Use the mana value of the sacrificed creature as it last existed on the battlefield to determine the value of X."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"At the beginning of your end step, if you control a creature, look at the top seven cards of your library. Then you may sacrifice a creature. If you do, you may put a creature card with mana value X or less from among those cards onto the battlefield, where X is 1 plus the sacrificed creature's mana value. Put the rest on the bottom of your library in a random order.","type":"Enchantment","types":["Enchantment"],"uuid":"3cf1f4c7-37a9-58e2-9ca3-60a8b1c94e70"},{"artist":"Zoltan Boros","artistIds":["1885e6cb-c827-4896-994e-3d0a027d602f"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298048","mtgjsonV4Id":"bc00e09a-1530-596c-b604-b39cbc457aab","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"b0d465d4-4c58-499d-8555-bcb25c48f4ab","scryfallIllustrationId":"73c4b857-700d-4a2d-986d-7ad7471c9bbf","scryfallOracleId":"9aff3d55-e25d-4f06-a783-c3aa9eb9fd50"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}{G}","manaValue":3.0,"name":"Eladamri, Korvecdal","number":"149s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/8ad08218abe94de3"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"Because you never \"cast\" a land card, Eladamri, Korvecdal doesn't allow you to play a land creature (such as Dryad Arbor) from the top of your library."},{"date":"2024-06-07","text":"If the top card of your library changes while you're casting a spell, playing a land, or activating an ability, you can't look at the new top card until you finish doing so. This means that if you cast a spell from the top of your library, you can't look at the next one until you're done paying for that spell."},{"date":"2024-06-07","text":"You can look at the top card of your library whenever you want (with one restriction; see below), even if you don't have priority. This action doesn't use the stack. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand."},{"date":"2024-06-07","text":"You must pay all costs and follow all timing rules for spells cast from the top of your library this way."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Elf","Warrior"],"supertypes":["Legendary"],"text":"You may look at the top card of your library any time.\nYou may cast creature spells from the top of your library.\n{G}, {T}, Tap two untapped creatures you control: Reveal a card from your hand or the top card of your library. If you reveal a creature card this way, put it onto the battlefield. Activate only during your turn.","toughness":"3","type":"Legendary Creature — Elf Warrior","types":["Creature"],"uuid":"693c7260-de9e-5f4b-b22b-0f4c9fd26dbd"},{"artist":"Scott Murphy","artistIds":["07c7ac65-dfa6-4273-9c66-ec9d8f3e2226"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298049","mtgjsonV4Id":"2a06f944-b4e3-580a-b11f-9c29d908e752","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"39538c47-eb5b-4bdf-848a-b58f91da35a6","scryfallIllustrationId":"a18b4f37-38fa-4f37-8034-f2e6cbb55d39","scryfallOracleId":"7973820b-fdaf-46ec-9e3e-d4c0e77b5067"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Eternalize","Ferocious"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}","manaValue":2.0,"name":"Fanatic of Rhonas","number":"152s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/114f4cbb91331364"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If a creature card with eternalize is put into your graveyard during your main phase, you'll have priority immediately afterward. You can activate its eternalize ability before any player can try to exile it."},{"date":"2024-06-07","text":"Once you've activated an eternalize ability, the card is immediately exiled. Opponents can't try to stop the ability by exiling the card."},{"date":"2024-06-07","text":"The token copies exactly what was printed on the original card and nothing else, except the characteristics specifically modified by eternalize. It doesn't copy any information about the object the card was before it was put into your graveyard."},{"date":"2024-06-07","text":"The token is a Zombie in addition to its other types and is black instead of its other colors. Its base power and toughness are 4/4. It has no mana cost, and thus its mana value is 0. These are copiable values of the token that other effects may copy."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Snake","Druid"],"supertypes":[],"text":"{T}: Add {G}.\nFerocious — {T}: Add {G}{G}{G}{G}. Activate only if you control a creature with power 4 or greater.\nEternalize {2}{G}{G} ({2}{G}{G}, Exile this card from your graveyard: Create a token that's a copy of it, except it's a 4/4 black Zombie Snake Druid with no mana cost. Eternalize only as a sorcery.)","toughness":"4","type":"Creature — Snake Druid","types":["Creature"],"uuid":"4d26c72a-c9cd-5400-aeb9-149d5c6ad725"},{"artist":"Billy Christian","artistIds":["10f26f94-64fc-4174-856e-701bea4f1521"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"\"You need to expand your horizons.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298050","mtgjsonV4Id":"5f28eb85-7225-51b4-857a-ea6e012df741","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"dd6bb827-481c-4878-80f1-7644347120aa","scryfallIllustrationId":"b3fa2519-70cc-46c2-a636-8045afccdd29","scryfallOracleId":"1766f1f4-0924-4436-8379-94030adcccc5"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}{G}","manaValue":3.0,"name":"Flare of Cultivation","number":"154s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/da36104daa295eba"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"You may sacrifice a nontoken green creature rather than pay this spell's mana cost.\nSearch your library for up to two basic land cards, reveal those cards, put one onto the battlefield tapped and the other into your hand, then shuffle.","type":"Sorcery","types":["Sorcery"],"uuid":"06983cf8-0dea-511b-a8a1-458eefbb52e1"},{"artist":"Yeong-Hao Han","artistIds":["f8e7f8d6-6dde-4059-973c-30f1fd1bbe4e"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":4.0,"finishes":["foil"],"flavorText":"When Gaea speaks, all of nature falls silent.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298051","mtgjsonV4Id":"1ee2025f-98e7-5dae-811a-92f9ae3d38f1","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"e107144e-133b-4c76-b7e1-91bd0f3cbaac","scryfallIllustrationId":"622622be-2a4d-4c54-80b3-9cc4f19a3ec5","scryfallOracleId":"8d087fe0-d554-4d7c-ba22-32db2cf71887"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{G}{G}","manaValue":4.0,"name":"Primal Prayers","number":"166s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/e33ab32fda9b7dfd"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Energy counters are a kind of counter that a player may have. They're not associated with any specific permanents."},{"date":"2024-06-07","text":"Energy counters aren't mana. They don't go away as steps, phases, and turns end, and effects that add mana \"of any type\" can't give you energy counters."},{"date":"2024-06-07","text":"If a spell or ability with one or more targets states that you \"may pay\" some amount of {E}, and each permanent that it targets has become an illegal target, the spell or ability won't resolve. You can't pay any {E} even if you want to."},{"date":"2024-06-07","text":"If a spell you cast this way has {X} in its mana cost, you must choose 0 as the value of X when casting it."},{"date":"2024-06-07","text":"If an effect says you get one or more {E}, you get that many energy counters. To pay one or more {E}, you lose that many energy counters. You can't pay more energy counters than you have. Any effects that interact with counters a player gets, has, or loses can interact with energy counters."},{"date":"2024-06-07","text":"If you cast a spell for another cost \"rather than paying its mana cost,\" you can't choose to cast it for any alternative costs. You can, however, pay additional costs, such as kicker costs. If the spell has any mandatory additional costs, those must be paid to cast it."},{"date":"2024-06-07","text":"Keep track of how many energy counters each player has. Potential ways to track this include writing theme down on paper or using dice, but any method that is clear and mutually agreeable is fine. (At higher levels of tournament play, dice may not be allowed for tracking counters that players have.)"},{"date":"2024-06-07","text":"Some spells and abilities that give you {E} may require targets. If each target chosen is an illegal target as that spell or ability tries to resolve, it won't resolve. You won't get any {E}."},{"date":"2024-06-07","text":"Some triggered abilities state that you \"may pay\" a certain amount of {E}. You can't pay that amount multiple times to multiply the effect. You simply choose whether or not to pay that amount of {E} as the ability resolves."},{"date":"2024-06-07","text":"Some triggered abilities that state that you \"may pay\" a certain amount of {E} describe an effect that happens \"If you do.\" In that case, no player may take actions to try to stop the ability's effect after you make your choice. If the payment is followed by the phrase \"When you do,\" then you'll choose any targets for that reflexive triggered ability and put it on the stack before players can take actions."},{"date":"2024-06-07","text":"{E} is the energy symbol. It represents one energy counter."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"When Primal Prayers enters the battlefield, you get {E}{E} (two energy counters).\nYou may cast creature spells with mana value 3 or less by paying {E} rather than paying their mana costs. If you cast a spell this way, you may cast it as though it had flash.","type":"Enchantment","types":["Enchantment"],"uuid":"6b2eed9f-082c-5c56-9dc2-836e35a90a51"},{"artist":"Andrew Mar","artistIds":["adad79bf-cd52-456a-b170-740ed8bff0fc"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298052","mtgjsonV4Id":"3ebf4c4b-0e98-5a5f-a369-237598f36739","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"0b9ba1f1-584d-4c40-85b4-3292d793e33a","scryfallIllustrationId":"7bb9f6c6-0e77-46f9-b740-c85cee829156","scryfallOracleId":"dbcbdf37-c40f-4068-b4a7-a849cab1056c"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Mill","Reach"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{G}","manaValue":3.0,"name":"Six","number":"169s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/ecfe6a655875dad5"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If a spell you cast with retrace is countered, it's put back into your graveyard. You may use the retrace ability to cast it again."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Treefolk"],"supertypes":["Legendary"],"text":"Reach\nWhenever Six attacks, mill three cards. You may put a land card from among them into your hand.\nAs long as it's your turn, nonland permanent cards in your graveyard have retrace. (You may cast permanent cards from your graveyard by discarding a land card in addition to paying their other costs.)","toughness":"4","type":"Legendary Creature — Treefolk","types":["Creature"],"uuid":"2395164e-4cbb-5e06-954d-a07d5f44f650"},{"artist":"Slawomir Maniak","artistIds":["d887bc66-2779-416c-a1ff-d8720242063e"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":[],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298053","mtgjsonV4Id":"cfc1275b-e03a-5651-8034-d7187113911b","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ebbd6efa-24d3-49f1-a92d-2b83765fde75","scryfallIllustrationId":"ea7de7ea-d1ed-4833-a8bb-7d2235e5c620","scryfallOracleId":"63a19c7c-49d7-4b75-aac8-d0ff36c45fb8"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Devoid","Kicker"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{3}{G}","manaValue":4.0,"name":"Sowing Mycospawn","number":"170s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/3841bef152f0fa6e"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A card with devoid is just colorless. It's not colorless and the colors of mana in its mana cost."},{"date":"2024-06-07","text":"Devoid doesn't affect the color identity of the card for the purposes of the Commander variant. For example, while Abstruse Appropriation is colorless because it has devoid, its color identity is still white and black, and it can't be included in a Commander deck where the commander's color identity doesn't include both white and black."},{"date":"2024-06-07","text":"Devoid works in all zones, not just on the battlefield."},{"date":"2024-06-07","text":"If a card loses devoid, it will still be colorless. This is because effects that change an object's color (like the one created by devoid) are considered before the object loses devoid."},{"date":"2024-06-07","text":"Other cards and abilities can give a card with devoid a color. If that happens, it's just the new color, not that color and colorless."},{"date":"2024-06-07","text":"Sowing Mycospawn's triggered abilities will resolve before Sowing Mycospawn does. If Sowing Mycospawn is countered or otherwise leaves the stack in response to those triggered abilities, the triggered abilities will still resolve as normal."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi","Fungus"],"supertypes":[],"text":"Devoid (This card has no color.)\nKicker {1}{C} (You may pay an additional {1}{C} as you cast this spell.)\nWhen you cast this spell, search your library for a land card, put it onto the battlefield, then shuffle.\nWhen you cast this spell, if it was kicked, exile target land.","toughness":"3","type":"Creature — Eldrazi Fungus","types":["Creature"],"uuid":"f3a74a22-6bbd-5a54-aa86-81bea73686e7"},{"artist":"Valera Lutfullina","artistIds":["76bc57c7-47c6-40c5-8797-8ffcce430ac7"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298054","mtgjsonV4Id":"3692cbe7-c280-5ba0-a15c-e31ab8b92f2a","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"f5b2afc5-16f6-4fed-90de-6ca0051392e2","scryfallIllustrationId":"12a84ea9-c11a-4a8a-8a9c-ab3e62443e19","scryfallOracleId":"8a3ad2ef-8bcb-40c0-85de-f03328c2b644"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Bestow","Landfall"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}","manaValue":2.0,"name":"Springheart Nantuko","number":"171s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d8f0dcd9888ed32d"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Auras attached to a creature don't become tapped when the creature becomes tapped. Except in some rare cases, an Aura with bestow remains untapped when it becomes unattached and becomes a creature."},{"date":"2024-06-07","text":"If a permanent with bestow enters the battlefield by any method other than being cast, it will be an enchantment creature. You can't choose to pay the bestow cost and have it become an Aura."},{"date":"2024-06-07","text":"If you don't pay {1}{G}, either because you simply chose not to or because Springheart Nantuko isn't attached to a creature you control, you'll still create a 1/1 green Insect creature token when Springheart Nantuko's landfall ability resolves."},{"date":"2024-06-07","text":"On the stack, a spell with bestow is either a creature spell or an Aura spell. It's never both, although it's an enchantment spell in either case."},{"date":"2024-06-07","text":"Unlike other Aura spells, an Aura spell with bestow isn't countered if its target is illegal as it begins to resolve. Rather, the effect making it an Aura spell ends, it loses enchant creature, it returns to being an enchantment creature spell, and it resolves and enters the battlefield as an enchantment creature."},{"date":"2024-06-07","text":"Unlike other Auras, an Aura with bestow isn't put into its owner's graveyard if it becomes unattached. Rather, the effect making it an Aura ends, it loses enchant creature, and it remains on the battlefield as an enchantment creature. It can attack (and its {T} abilities can be activated, if it has any) on the turn it becomes unattached if it's been under your control continuously, even as an Aura, since your most recent turn began."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Insect","Monk"],"supertypes":[],"text":"Bestow {1}{G}\nEnchanted creature gets +1/+1.\nLandfall — Whenever a land enters the battlefield under your control, you may pay {1}{G} if Springheart Nantuko is attached to a creature you control. If you do, create a token that's a copy of that creature. If you didn't create a token this way, create a 1/1 green Insect creature token.","toughness":"1","type":"Enchantment Creature — Insect Monk","types":["Enchantment","Creature"],"uuid":"b523d1c1-310d-50b9-b606-90c14b358553"},{"artist":"Raph Lomotan","artistIds":["7da5333c-6b1e-48ba-ab42-1b41f09920ee"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":[],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298055","mtgjsonV4Id":"d2db69ca-f7e7-5e33-bad0-bc759c80f45c","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"35b34d0d-9484-4531-81ff-1f2ed897e422","scryfallIllustrationId":"74a2cd52-fa58-4a5c-bbbe-a35d8589496e","scryfallOracleId":"7abbd5af-a04b-476d-aee5-2b2f5114b019"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Devoid"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{C}{G}","manaValue":3.0,"name":"Thief of Existence","number":"174s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/14731a00295c8ee3"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A card with devoid is just colorless. It's not colorless and the colors of mana in its mana cost."},{"date":"2024-06-07","text":"Devoid doesn't affect the color identity of the card for the purposes of the Commander variant. For example, while Abstruse Appropriation is colorless because it has devoid, its color identity is still white and black, and it can't be included in a Commander deck where the commander's color identity doesn't include both white and black."},{"date":"2024-06-07","text":"Devoid works in all zones, not just on the battlefield."},{"date":"2024-06-07","text":"If a card loses devoid, it will still be colorless. This is because effects that change an object's color (like the one created by devoid) are considered before the object loses devoid."},{"date":"2024-06-07","text":"If the target of Thief of Existence's triggered ability is illegal as the ability tries to resolve, it won't resolve and none of its effects will happen. Thief of Existence won't gain another ability."},{"date":"2024-06-07","text":"Other cards and abilities can give a card with devoid a color. If that happens, it's just the new color, not that color and colorless."},{"date":"2024-06-07","text":"Thief of Existence's triggered ability will resolve before Thief of Existence does. If Thief of Existence is countered or otherwise leaves the stack in response to that triggered ability, the triggered ability will still resolve as normal."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Eldrazi"],"supertypes":[],"text":"Devoid (This card has no color.)\nWhen you cast this spell, exile up to one target noncreature, nonland permanent an opponent controls with mana value 4 or less. If you do, Thief of Existence gains \"When this creature leaves the battlefield, target opponent draws a card.\"","toughness":"4","type":"Creature — Eldrazi","types":["Creature"],"uuid":"b118fb8b-4610-5ecc-8496-1a375a24e377"},{"artist":"Jason Rainville","artistIds":["6ed7e669-579b-443d-b223-e5cbcb2a7483"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","W"],"colors":[],"convertedManaCost":4.0,"finishes":["foil"],"flavorText":"\"Kozilek experiences reality on his own terms.\"\n—Ayli, high priest of the Eternal Pilgrims","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298056","mtgjsonV4Id":"dc3b31c6-8e71-50ec-b3d7-fad5bfc53fec","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"e5153f6f-e6dc-4aac-a9a2-172aa957166c","scryfallIllustrationId":"fc9536cf-a074-4764-9a20-d781d23c5adc","scryfallOracleId":"61a23402-3244-4b5e-9134-98e1f82eda65"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Devoid"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{W}{B}","manaValue":4.0,"name":"Abstruse Appropriation","number":"177s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/da8b0b4c834f87d2"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A card with devoid is just colorless. It's not colorless and the colors of mana in its mana cost."},{"date":"2024-06-07","text":"Abstruse Appropriation doesn't change when you can cast the exiled card. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty."},{"date":"2024-06-07","text":"Devoid doesn't affect the color identity of the card for the purposes of the Commander variant. For example, while Abstruse Appropriation is colorless because it has devoid, its color identity is still white and black, and it can't be included in a Commander deck where the commander's color identity doesn't include both white and black."},{"date":"2024-06-07","text":"Devoid works in all zones, not just on the battlefield."},{"date":"2024-06-07","text":"If a card loses devoid, it will still be colorless. This is because effects that change an object's color (like the one created by devoid) are considered before the object loses devoid."},{"date":"2024-06-07","text":"If a token is exiled this way, it will cease to exist and won't return to the battlefield. You can't cast it."},{"date":"2024-06-07","text":"In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, any spells or permanents you control from Abstruse Appropriation's effect are exiled, and any cards still exiled by it remain exiled."},{"date":"2024-06-07","text":"In the rare case where the exiled card is a land card (probably because that land became a copy of a permanent while it was still on the battlefield), you won't be able to play it from exile."},{"date":"2024-06-07","text":"Other cards and abilities can give a card with devoid a color. If that happens, it's just the new color, not that color and colorless."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Devoid (This card has no color.)\nExile target nonland permanent. You may cast that card for as long as it remains exiled, and you may spend colorless mana as though it were mana of any color to cast that spell.","type":"Instant","types":["Instant"],"uuid":"f492f75b-902c-513c-9940-e02e37bfa200"},{"artist":"Cristi Balanescu","artistIds":["c09ede88-a1b5-4a18-9895-dc8a965d28a5"],"asciiName":"Arna Kennerud, Skycaptain","availability":["paper"],"borderColor":"black","colorIdentity":["B","U","W"],"colors":["B","U","W"],"convertedManaCost":5.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298057","mtgjsonV4Id":"a01e2bd1-5ea7-5a10-a112-284b7a749dfc","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"fe60347c-2ef7-4515-a4b8-00ef74801fe8","scryfallIllustrationId":"705ce8ff-3beb-4bea-bb56-2a61ceb10b07","scryfallOracleId":"436e7548-f8d5-43af-947d-b382da0d19b3"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying","Lifelink","Ward"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{W}{U}{B}","manaValue":5.0,"name":"Arna Kennerüd, Skycaptain","number":"178s","power":"4","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/f073191ecfebf56e"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"A creature that is equipped is considered modified no matter who controls the Equipment that's attached to it."},{"date":"2024-06-07","text":"A creature with a counter on it is considered modified no matter what kind of counter it is or which player put it on that creature."},{"date":"2024-06-07","text":"An Aura controlled by another player does not cause a creature you control to be modified."},{"date":"2024-06-07","text":"If, for any reason, an Aura token that would be created with Arna Kennerüd's last ability can't be attached to the appropriate creature, that token isn't created. If an Equipment token that can't be attached to the appropriate creature would be created, that token enters the battlefield unattached."},{"date":"2024-06-07","text":"Only creatures can be modified. If a modified creature stops being a creature, it is no longer considered modified."},{"date":"2024-06-07","text":"To double the number of each kind of counter on a permanent, put another counter on it for each counter it already has. Effects that interact with counters being put onto permanents, such as the effect of Branching Evolution, apply as appropriate."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Human","Knight"],"supertypes":["Legendary"],"text":"Flying, lifelink\nWard—Discard a card.\nWhenever a modified creature you control attacks, double the number of each kind of counter on it. Then for each nontoken permanent attached to it, create a token that's a copy of that permanent attached to that creature.","toughness":"4","type":"Legendary Creature — Human Knight","types":["Creature"],"uuid":"3fb68ba3-3dea-545e-99dd-34b309fdfd05"},{"artist":"Chuck Lukacs","artistIds":["2bdf4da7-c66c-4c46-a253-284c856ccfab"],"availability":["paper"],"borderColor":"black","colorIdentity":["U","W"],"colors":["U","W"],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298058","mtgjsonV4Id":"07896b9e-090b-5617-be4f-230c87b7fd6e","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"4988f0fb-2f3e-4ec6-afea-b02894230d95","scryfallIllustrationId":"4533dbd9-03fc-4a70-b6f7-b80717f4b4cb","scryfallOracleId":"ca16b735-26c7-4d0b-959b-b031f6cb376e"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{W}{U}","manaValue":4.0,"name":"Genku, Future Shaper","number":"186s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/996b8ee3365102b1"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If Genku and one or more other nontoken permanents you control leave the battlefield at the same time, Genku's ability will trigger for each of those other nontoken permanents."},{"date":"2024-06-07","text":"If multiple other nontoken permanents you control leave the battlefield simultaneously, you must still choose different modes for each instance of the triggered ability that's put onto the stack. If more than three other nontoken permanents you control leave the battlefield simultaneously, that choice is made only for the first three."},{"date":"2024-06-07","text":"If you can't legally choose a mode because all three have been chosen that turn, that instance of the ability is removed from the stack with no effect."},{"date":"2024-06-07","text":"If you somehow control two or more Genku, Future Shapers, track which modes have been chosen each turn for each one's ability separately."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Moonfolk","Wizard"],"supertypes":["Legendary"],"text":"Whenever another nontoken permanent you control leaves the battlefield, choose one that hasn't been chosen this turn. Create a creature token with those characteristics.\n• 2/2 white Fox with vigilance.\n• 1/2 blue Moonfolk with flying.\n• 1/1 black Rat with lifelink.\n{3}{W}{U}: Put a +1/+1 counter on each creature you control.","toughness":"5","type":"Legendary Creature — Moonfolk Wizard","types":["Creature"],"uuid":"192b8a71-16e8-599e-9361-268c9b82ef9e"},{"artist":"Xavier Ribeiro","artistIds":["e17c2662-0491-47b2-bf1d-8c111a8ad3f8"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","R"],"colors":["B","R"],"convertedManaCost":8.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298059","mtgjsonV4Id":"b8f70c71-a175-5d98-a262-83ac8c28e375","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"dc18794c-5648-4d8f-a262-d85bb168864e","scryfallIllustrationId":"bc279d94-3f33-4fbb-af85-bf03b0ebbb71","scryfallOracleId":"2494101a-2c6b-45d8-95fe-e62bf9a25130"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Affinity"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{6}{B}{R}","manaValue":8.0,"name":"Imskir Iron-Eater","number":"189s","power":"5","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/e7919e23930ed07d"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If an artifact on the battlefield has {X} in its mana cost, X is 0 when determining its mana value."},{"date":"2024-06-07","text":"The value of X is calculated only once, as Imskir Iron-Eater's triggered ability resolves."},{"date":"2024-06-07","text":"Use the mana value of the sacrificed artifact as it last existed on the battlefield to determine how much damage is dealt."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Demon"],"supertypes":["Legendary"],"text":"Affinity for artifacts (This spell costs {1} less to cast for each artifact you control.)\nWhen Imskir Iron-Eater enters the battlefield, you draw X cards and you lose X life, where X is half the number of artifacts you control, rounded down.\n{3}{R}, Sacrifice an artifact: Imskir deals damage equal to the sacrificed artifact's mana value to any target.","toughness":"5","type":"Legendary Creature — Demon","types":["Creature"],"uuid":"0a57b70a-ea57-5d67-9c37-4099e69ea023"},{"artist":"Leonardo Santanna","artistIds":["f1f8e6d8-8fb3-472a-a32f-a4b1225bd054"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","U"],"colors":["R","U"],"convertedManaCost":3.0,"finishes":["foil"],"flavorText":"\"Skreeg! I thought I told you to stop messing with... Oh, that worked. Good job, Skreeg.\"\n—Ral Zarek","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298060","mtgjsonV4Id":"69432b17-621d-5532-bd35-47d4e91d6d62","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"b262a509-dc48-4da5-a1ad-379e4ad33a81","scryfallIllustrationId":"2b99d94b-1b75-465a-8c6c-5bc6b9957d05","scryfallOracleId":"69e12b1f-0fd9-43a9-b3db-fe08290442c6"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{U}{U}{R}","manaValue":3.0,"name":"Invert Polarity","number":"190s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/03c69c08ce6a9102"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If the target spell has a variable number of targets, you can't change how many targets it has."},{"date":"2024-06-07","text":"If the target spell has damage divided as it was cast, the division can't be changed although the targets receiving that damage still can. The same is true of spells that distribute counters."},{"date":"2024-06-07","text":"If you choose new targets for the target spell, the new targets must be legal."},{"date":"2024-06-07","text":"You don't make any decisions about new targets for the spell until you win the flip."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Choose target spell, then flip a coin. If you win the flip, gain control of that spell and you may choose new targets for it. If you lose the flip, counter that spell.","type":"Instant","types":["Instant"],"uuid":"64faf8ea-9a15-56b6-b1f7-c47967555f4a"},{"artist":"Ekaterina Burmak","artistIds":["2a9f3780-fcc8-4ec5-b403-ee1d1370d3b4"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","W"],"colors":["G","W"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"Born from the greatest granite boulder, nursed on the sweetest honey, crowned amid a raging blizzard.","foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298061","mtgjsonV4Id":"78c60117-4862-53df-aff8-1eea388be7fb","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"e253b3de-b190-452a-942a-bda727a42d9a","scryfallIllustrationId":"5786b6e6-0488-481e-8ca2-50daed4402ca","scryfallOracleId":"070d22cf-2eed-4d04-b932-4b8339ea9b7a"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{G}{W}","manaValue":2.0,"name":"Kudo, King Among Bears","number":"192s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/2f790f5e76364f78"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Because damage remains marked on a creature until the damage is removed as the turn ends, nonlethal damage dealt to creatures may become lethal if Kudo enters or leaves the battlefield during that turn."},{"date":"2024-06-07","text":"If an effect causes a noncreature permanent to become a creature and sets its power and toughness as it does so, that creature will have that power and toughness; it won't be 2/2. Notably, crewing a Vehicle does not set its power and toughness, so a Vehicle will be a 2/2 creature once crewed."},{"date":"2024-06-07","text":"Kudo, King Among Bears's ability overwrites any effects that set a creature's power and toughness. Any existing effects or counters that raise, lower, or switch a creature's power and/or toughness continue to apply to the creature's newly set power and toughness. Any power- or toughness-setting effects that start to apply after Kudo enters the battlefield will overwrite this effect."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Bear"],"supertypes":["Legendary"],"text":"Other creatures have base power and toughness 2/2 and are Bears in addition to their other types.","toughness":"2","type":"Legendary Creature — Bear","types":["Creature"],"uuid":"8bd63ed8-6e6f-54e2-94a3-811bf92f8227"},{"artist":"Daren Bader","artistIds":["7da1a585-c875-45e4-b322-5da9e8e1f651"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","U"],"colors":["G","U"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298062","mtgjsonV4Id":"d5633e8e-7d22-5c1a-83be-1befdb2667e0","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"acd7ca2d-08fc-42de-94e1-f4c7358f5a10","scryfallIllustrationId":"75fa2577-f434-45db-805d-d842aa6ff192","scryfallOracleId":"0ff11a61-6fe3-4c70-aba8-417023a5e54e"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Restricted","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{G}{U}","manaValue":3.0,"name":"Nadu, Winged Wisdom","number":"193s","power":"3","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d16d85a562a517b9"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If Nadu leaves the battlefield and returns to the battlefield in the same turn, or if Nadu leaves and another Nadu appears, the triggered ability granted by the new one is different than the triggered ability granted by the old one. The one granted by the new Nadu may trigger twice for each creature you control, even if the ability granted by the old Nadu already triggered twice for those creatures that turn. (Note that creatures you control won't have the ability granted by the old one anymore, and if you control multiple Nadus, you won't have the opportunity to take actions before the \"legend rule\" gets you down to one Nadu.)"},{"date":"2024-06-07","text":"If Nadu leaves the battlefield while one or more triggered abilities generated by the ability it grants are still on the stack, those abilities will still resolve as normal."},{"date":"2024-06-07","text":"If Nadu somehow enters the battlefield while a spell or ability that targets a creature you control is on the stack, the ability granted by Nadu won't trigger since that creature didn't have that ability when it became the target of that spell or ability."},{"date":"2024-06-07","text":"If you somehow control more than one Nadu, each permanent you control will have that many instances of the granted ability. These abilities are not redundant. For example, if you control two Nadus and one becomes the target of a spell or ability, each of its granted abilities will trigger. If that same Nadu becomes the target of a spell or ability again later in the turn, each of its granted abilities will trigger again, as each of them have triggered only once so far this turn."},{"date":"2024-06-07","text":"Nadu, Winged Wisdom's last ability grants a triggered ability to itself as well as other creatures you control."},{"date":"2024-06-07","text":"The ability that Nadu grants to each creature you control functions independently for each creature. Specifically, the ability can trigger twice each turn for each creature you control, not just twice total."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Bird","Wizard"],"supertypes":["Legendary"],"text":"Flying\nCreatures you control have \"Whenever this creature becomes the target of a spell or ability, reveal the top card of your library. If it's a land card, put it onto the battlefield. Otherwise, put it into your hand. This ability triggers only twice each turn.\"","toughness":"4","type":"Legendary Creature — Bird Wizard","types":["Creature"],"uuid":"dfb88f67-9da9-525c-982e-f2281c0b0df7"},{"artist":"Igor Krstic","artistIds":["44cdd332-50f6-4cab-b606-c4565fc5efeb"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","G","W"],"colors":["B","G","W"],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298063","mtgjsonV4Id":"383a0989-713f-5e26-b08e-08b88adbaf8c","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"66f40264-0d28-4222-9a85-9e9e9f811c12","scryfallIllustrationId":"6f9fb548-7bfc-4e06-9f83-711cc840a879","scryfallOracleId":"b981af39-4ee6-4fbc-9a89-618dcad9dfbf"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Landfall","Mill"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{W}{B}{G}","manaValue":4.0,"name":"The Necrobloom","number":"194s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/711ae0072b10f7af"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Dredge can replace any card draw, not just the one during your draw step. One card draw can't be replaced by multiple dredge abilities."},{"date":"2024-06-07","text":"If an effect puts a card into your hand without specifically using the word \"draw,\" you're not drawing a card. Dredge can't replace this event."},{"date":"2024-06-07","text":"If multiple lands enter the battlefield under your control simultaneously, all of those lands are counted. For example, if you sacrifice seven lands while resolving Scapeshift and search your library for seven lands with different names, you'll create seven Zombie tokens."},{"date":"2024-06-07","text":"If you control multiple lands with the same name, only one of those lands will count toward the seven or more required to create a Zombie. For example, if you control four lands named Forest, two named Plains, and one named Swamp, you control three lands with different names."},{"date":"2024-06-07","text":"If you're drawing multiple cards, each draw is performed one at a time. For example, if you're instructed to draw two cards and you replace the first draw with a dredge ability, another card with a dredge ability (including one that was put into your graveyard by the first dredge ability) may be used to replace the second draw."},{"date":"2024-06-07","text":"Once you've announced that you're applying a card's dredge ability to replace a draw, players can't take any action until you've put that card into your hand and put the top cards of your library into your graveyard."},{"date":"2024-06-07","text":"You can't attempt to use a dredge ability if you don't have enough cards in your library."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Plant"],"supertypes":["Legendary"],"text":"Landfall — Whenever a land enters the battlefield under your control, create a 0/1 green Plant creature token. If you control seven or more lands with different names, create a 2/2 black Zombie creature token instead.\nLand cards in your graveyard have dredge 2. (You may return a land card from your graveyard to your hand and mill two cards instead of drawing a card.)","toughness":"7","type":"Legendary Creature — Plant","types":["Creature"],"uuid":"3573cc0c-4218-5109-b30d-60e5eecfcc40"},{"artist":"Lucas Graciano","artistIds":["ce98f39c-7cdd-47e6-a520-6c50443bb4c2"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","W"],"colors":["R","W"],"convertedManaCost":3.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298064","mtgjsonV4Id":"5321594b-f9f3-5deb-8204-80959e1054c9","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"ba8331fc-aa90-4978-b4ab-20ab685f7fa3","scryfallIllustrationId":"58dc4ed9-6535-486f-869a-e7fe4cb718d4","scryfallOracleId":"3407eb6e-b74d-4159-a801-d7163937953c"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Escape"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{R}{W}","manaValue":3.0,"name":"Phlage, Titan of Fire's Fury","number":"197s","power":"6","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/27bdee1b41ecdef3"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"After an escaped spell resolves, it returns to its owner's graveyard if it's not a permanent spell. If it is a permanent spell, it enters the battlefield and will return to its owner's graveyard if it dies later. It can escape again."},{"date":"2024-06-07","text":"Escape's permission doesn't change when you may cast the spell from your graveyard."},{"date":"2024-06-07","text":"If a card has multiple abilities giving you permission to cast it, such as two escape abilities or an escape ability and a flashback ability, you choose which one to apply. The others have no effect."},{"date":"2024-06-07","text":"If a card with escape is put into your graveyard during your turn, you'll be able to cast it right away if it's legal to do so, before an opponent can take any actions."},{"date":"2024-06-07","text":"If you cast a spell with its escape permission, you can't choose to apply any other alternative costs or to cast it without paying its mana cost. If it has any additional costs, you must pay those."},{"date":"2024-06-07","text":"Once you begin casting a spell with escape, it immediately moves to the stack. Players can't take any other actions until you're done casting the spell."},{"date":"2024-06-07","text":"Phlage's first ability causes you to sacrifice it if you didn't cast it, or if it was cast using any permission other than an escape ability."},{"date":"2024-06-07","text":"Phlage's second ability triggers when it enters the battlefield, even if it didn't escape."},{"date":"2024-06-07","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you're paying (such as an escape cost), add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was and no matter whether an alternative cost was paid."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Elder","Giant"],"supertypes":["Legendary"],"text":"When Phlage enters the battlefield, sacrifice it unless it escaped.\nWhenever Phlage enters the battlefield or attacks, it deals 3 damage to any target and you gain 3 life.\nEscape—{R}{R}{W}{W}, Exile five other cards from your graveyard. (You may cast this card from your graveyard for its escape cost.)","toughness":"6","type":"Legendary Creature — Elder Giant","types":["Creature"],"uuid":"8bd0439a-714d-5848-8c6f-0f2755b28010"},{"artist":"Pete Venters","artistIds":["d54c4a1a-c0c5-4834-84db-125d341f3ad8"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","U"],"colors":["B","U"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"Some frogs poison the body. Some frogs poison the mind.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298065","mtgjsonV4Id":"32d375b5-cf5e-59eb-b5c5-1bb924e9b7ae","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"1d090ea5-c01b-4f3a-bb5c-7478e8fdb86d","scryfallIllustrationId":"ed6e6e59-f13a-49a7-adec-e79c6999c776","scryfallOracleId":"e157ad1e-be35-47f3-92db-01799f8fb6a5"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{U}{B}","manaValue":2.0,"name":"Psychic Frog","number":"199s","power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d48b266f42e84f26"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":["Frog"],"supertypes":[],"text":"Whenever Psychic Frog deals combat damage to a player or planeswalker, draw a card.\nDiscard a card: Put a +1/+1 counter on Psychic Frog.\nExile three cards from your graveyard: Psychic Frog gains flying until end of turn.","toughness":"2","type":"Creature — Frog","types":["Creature"],"uuid":"c393f75f-08ef-5879-b919-da01663aae87"},{"artist":"Fang Xinyu","artistIds":["83ef4d6d-7ca1-4ec9-98ce-437d34f8e464"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","R"],"colors":["G","R"],"convertedManaCost":4.0,"finishes":["foil"],"foreignData":[],"frameEffects":["legendary"],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298066","mtgjsonV4Id":"32bc0e57-b6a1-5637-b746-c6c42bd76c98","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"bc55a52f-ec0a-4c17-9d29-65b2b82b927e","scryfallIllustrationId":"93ab4a32-91a7-4ea5-9666-1f49b7f66093","scryfallOracleId":"3108a4fe-b18a-4d02-9545-b19812454362"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Mill"],"language":"English","layout":"normal","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}{R}{G}","manaValue":4.0,"name":"Rosheen, Roaring Prophet","number":"202s","power":"4","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/9ab3abf244ee0ecf"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"A \"cost that contains {X}\" may be a spell's total cost, an activated ability's cost, a suspend cost, or a cost you're asked to pay as part of the resolution of a spell or ability (such as Condescend). A spell's total cost includes either its mana cost (printed in the upper right corner) or its alternative cost (such as flashback), as well as any additional costs (such as kicker). If it's something you can spend mana on, it's a cost. If that cost includes the {X} symbol in it, you can spend mana generated by Rosheen on that cost."},{"date":"2024-06-07","text":"You can spend mana generated with Rosheen's last ability on any part of a cost that contains {X}. You're not limited to spending it only on the {X} part."},{"date":"2024-06-07","text":"You can use the mana generated with Rosheen's last ability in any cost you pay that includes {X}, including the mana costs of spells, activation costs, and even costs for special actions (such as morph). Any time you pay mana, that's a cost."},{"date":"2024-06-07","text":"You don't have to spend all of the mana generated with Rosheen's last ability on the same cost."}],"securityStamp":"oval","setCode":"PMH3","subtypes":["Giant","Shaman"],"supertypes":["Legendary"],"text":"When Rosheen, Roaring Prophet enters the battlefield, mill six cards. You may put a card with {X} in its mana cost from among them into your hand.\n{T}: Reveal any number of cards with {X} in their mana cost in your hand. Add {C}{C} for each card revealed this way. Spend this mana only on costs that contain {X}.","toughness":"4","type":"Legendary Creature — Giant Shaman","types":["Creature"],"uuid":"99cf2280-018b-540d-98b6-3f337ebabb8d"},{"artist":"Scott Murphy","artistIds":["07c7ac65-dfa6-4273-9c66-ec9d8f3e2226"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","G"],"colors":["B","G"],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"Her new demonic overlords prized her knowledge of Bant's landscape.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298067","mtgjsonV4Id":"f6c87738-15de-5d91-890e-de81609c39e7","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"a98ebbe3-74a4-4ae6-90b5-63c85ea6102e","scryfallIllustrationId":"fa165726-348d-48a1-8acd-602e77b5a016","scryfallOracleId":"4507df69-6bf7-43d6-a609-c032b61835d5"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Vigilance"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{B}{G}","manaValue":2.0,"name":"Wight of the Reliquary","number":"207s","power":"2","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/d8e88417cb23cd8d"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":["Zombie","Knight"],"supertypes":[],"text":"Vigilance\nWight of the Reliquary gets +1/+1 for each creature card in your graveyard.\n{T}, Sacrifice another creature: Search your library for a land card, put it onto the battlefield tapped, then shuffle.","toughness":"2","type":"Creature — Zombie Knight","types":["Creature"],"uuid":"1da98c85-9de8-533e-8450-fd3a601c8964"},{"artist":"Xavier Ribeiro","artistIds":["e17c2662-0491-47b2-bf1d-8c111a8ad3f8"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":2.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298068","mtgjsonV4Id":"df12ce40-9e74-5674-b432-f14b82884129","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"4d74a48b-9c0d-4a22-bdda-468911fe72ce","scryfallIllustrationId":"e8203e40-0336-4da7-9def-f2f955a8b49d","scryfallOracleId":"d6c46906-1339-4440-8cd0-2bb9890d4975"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flash"],"language":"English","layout":"normal","legalities":{"brawl":"Banned","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}","manaValue":2.0,"name":"Disruptor Flute","number":"209s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/c6844adf4c465710"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Activated abilities contain a colon. They're generally written \"[Cost]: [Effect].\" Some keywords are activated abilities and will have colons in their reminder text. An activated mana ability is one that produces mana as it resolves, not one that costs mana to activate."},{"date":"2024-06-07","text":"If you name a card that has both a mana ability and another activated ability, the mana ability can be activated but the other ability can't be activated."},{"date":"2024-06-07","text":"Some cards can have alternative names, such as split cards, adventurer cards, double-faced cards, and so on. You may choose one of the two names the card can have; Disruptor Flute's abilities won't affect anything with the other name. For example, if you choose Ondu Knotmaster, Throw a Line will still cost only {W}{B} to cast."},{"date":"2024-06-07","text":"To determine the total cost of a spell, start with the mana cost or alternative cost you're paying, add any cost increases, then apply any cost reductions. The mana value of the spell remains unchanged, no matter what the total cost to cast it was."},{"date":"2024-06-07","text":"You can choose the name of any card. You can't choose the name of a token unless it's also the name of a card."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Flash\nAs Disruptor Flute enters the battlefield, choose a card name.\nSpells with the chosen name cost {3} more to cast.\nActivated abilities of sources with the chosen name can't be activated unless they're mana abilities.","type":"Artifact","types":["Artifact"],"uuid":"7172c45e-98db-50d4-8094-c9372b541e57"},{"artist":"Drew Baker","artistIds":["a8c4ef83-94ad-41c7-861f-95debea16868"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":2.0,"finishes":["foil"],"flavorText":"\"The sun and moon have decided to make a competition of our misery.\"\n—Naromin, veteran explorer","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298069","mtgjsonV4Id":"e3b2c61a-1053-58bb-a8aa-d870e5583f95","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"c309cd5f-1de5-4689-a7f0-0e9f468585ed","scryfallIllustrationId":"928f80db-9a68-4560-b4fc-b61eedcc9506","scryfallOracleId":"b922f057-1c91-43eb-b74a-8a933b1be2d2"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{2}","manaValue":2.0,"name":"Winter Moon","number":"213s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/78bf5f0841a0cf9e"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If Winter Moon is on the battlefield while another effect restricts untapping lands or permanents in a different way, their effects are cumulative. For example, if you control both Winter Moon and Static Orb, each player will be able to untap no more than two permanents, up to one of which can be a nonbasic land, during their untap step."},{"date":"2024-06-07","text":"If multiple Winter Moons are on the battlefield, their effects are redundant. Each player will still be able to untap no more than one nonbasic land during their untap step."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Players can't untap more than one nonbasic land during their untap steps.","type":"Artifact","types":["Artifact"],"uuid":"bc34ff95-6b51-573e-890a-2c9ede46059a"},{"artist":"Yeong-Hao Han","artistIds":["f8e7f8d6-6dde-4059-973c-30f1fd1bbe4e"],"availability":["paper"],"borderColor":"black","colorIdentity":["U"],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298070","mtgjsonV4Id":"66e4f767-4dbf-54a1-ab12-a88ce2ffa67a","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"62f528be-f279-4568-8e03-5de7281fc7f1","scryfallIllustrationId":"c60629bb-9f08-4cce-889d-beb7f0648258","scryfallOracleId":"bfa20bc7-4626-4a52-87f4-6e2763cb8ed5"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Archway of Innovation","number":"214s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/ae0ed3ae209618e2"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Because improvise isn't an alternative cost, it can be used in conjunction with alternative costs."},{"date":"2024-06-07","text":"If an artifact you control has a mana ability with {T} in the cost, activating that ability while casting a spell with improvise will result in the artifact being tapped before you pay the spell's costs. You won't be able to tap it again for improvise. Similarly, if you sacrifice an artifact to activate a mana ability while casting a spell with improvise, that artifact won't be on the battlefield when you pay the spell's costs, so you won't be able to tap it for improvise."},{"date":"2024-06-07","text":"Multiple instances of improvise are redundant."},{"date":"2024-06-07","text":"When calculating a spell's total cost, include any alternative costs, additional costs, or anything else that increases or reduces the cost to cast the spell. Improvise applies after the total cost is calculated. Improvise doesn't change a spell's mana cost or mana value."},{"date":"2024-06-07","text":"When using improvise to cast a spell with {X} in its cost, first choose the value for X. That choice, plus any cost increases or decreases, will determine the spell's total cost. Then you can tap artifacts you control to help pay that cost. For example, if you activate the last ability of Archway of Innovation and then cast Wrath of the Skies (a spell with mana cost {X}{W}{W}), choosing 3 as the value of X, the total cost is {3}{W}{W}. If you tap two artifacts, you'll have to pay {1}{W}{W}."},{"date":"2024-06-07","text":"You must already control an Island as Archway of Innovation enters the battlefield for it to enter untapped. If it enters the battlefield at the same time as an Island when you control no other Islands, it will enter tapped."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Archway of Innovation enters the battlefield tapped unless you control an Island.\n{T}: Add {U}.\n{U}, {T}: The next spell you cast this turn has improvise. (Your artifacts can help cast that spell. Each artifact you tap after you're done activating mana abilities pays for {1}.)","type":"Land","types":["Land"],"uuid":"81a1f422-c6b1-58f3-8aa6-48d7718d1a9a"},{"artist":"Jorge Jacinto","artistIds":["05a3ac12-b25d-48e2-af5e-8a299fd3da14"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298071","mtgjsonV4Id":"56bc4cda-3349-5fee-9d2c-c2115ae54fa4","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"86cbcf48-0410-4eb5-b617-4f72da2f9da1","scryfallIllustrationId":"a64f6e6f-fc2e-4223-928b-cb3dde4a35d7","scryfallOracleId":"63dfe794-5f56-41ec-9883-5523b41cc3e0"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Exert"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Arena of Glory","number":"215s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/95da5b8f4937cc2f"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"If an exerted permanent is already untapped during your next untap step (most likely because an effect untapped it), exert's effect preventing it from untapping expires without having done anything."},{"date":"2024-06-07","text":"If mana generated with Arena of Glory's last ability is spent on a noncreature spell that becomes a creature later in the turn, that creature won't have haste."},{"date":"2024-06-07","text":"If mana generated with Arena of Glory's last ability is spent to cast a noncreature spell that creates tokens, those tokens won't gain haste."},{"date":"2024-06-07","text":"If mana generated with Arena of Glory's last ability is spent to pay any part of a creature spell's cost, including an alternative or additional cost, that creature spell (and the resulting creature) will gain haste until end of turn."},{"date":"2024-06-07","text":"If the mana generated with Arena of Glory's last ability is spent on two different creature spells, each of those spells (and resulting creatures) will gain haste until end of turn."},{"date":"2024-06-07","text":"If you gain control of another player's permanent until end of turn and exert it, and then that player regains control of it, it will untap during that player's untap step."},{"date":"2024-06-07","text":"The mana generated with Arena of Glory's last ability can be spent on anything, not just creature spells."},{"date":"2024-06-07","text":"You must already control a Mountain as Arena of Glory enters the battlefield for it to enter untapped. If it enters the battlefield at the same time as a Mountain when you control no other Mountains, it will enter tapped."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Arena of Glory enters the battlefield tapped unless you control a Mountain.\n{T}: Add {R}.\n{R}, {T}, Exert Arena of Glory: Add {R}{R}. If that mana is spent on a creature spell, it gains haste until end of turn. (An exerted permanent won't untap during your next untap step.)","type":"Land","types":["Land"],"uuid":"f539e91d-85a9-56fe-98d7-3dd6ff3b0f39"},{"artist":"Bruce Brenneise","artistIds":["91d65465-e8a6-4a4e-8b0e-0e07466cfa0f"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.31,"finishes":["foil"],"flavorText":"A graveyard for conquerors and conquered alike.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298072","mtgjsonV4Id":"8c3a29e7-8fdc-54fb-9459-0b1b77682818","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"cbe1eccc-02b4-4dd1-b0c6-3f24f7e2ed7f","scryfallIllustrationId":"f0eeb519-dabc-4f0f-9368-c9e36778a8d3","scryfallOracleId":"fc0707c7-d504-4ccf-a0d2-3eb6e26e7a57"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Banned","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","pioneer":"Banned","predh":"Legal","premodern":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Bloodstained Mire","number":"216s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/420327ea6cd9d0c1"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"{T}, Pay 1 life, Sacrifice Bloodstained Mire: Search your library for a Swamp or Mountain card, put it onto the battlefield, then shuffle.","type":"Land","types":["Land"],"uuid":"8687b024-bdbb-5b10-b32e-ba947122e9ea"},{"artist":"Alexander Forssberg","artistIds":["85908891-3cc7-42b0-9b54-27ed0fe89c53"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.28,"finishes":["foil"],"flavorText":"Once a prosperous Vantress town, now swept clean and reclaimed by the waters of the wilds.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298073","mtgjsonV4Id":"48913048-6dcb-578f-837b-26d8195aa9a3","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"b817ec56-51cb-42b0-a46b-914a6d4b5582","scryfallIllustrationId":"f9257bed-547d-4f93-92bc-84db9fc460d4","scryfallOracleId":"f3c7af78-a77d-4134-82a2-a5ce84285a84"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Banned","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","pioneer":"Banned","predh":"Legal","premodern":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Flooded Strand","number":"220s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/8bde38489a3347a5"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"{T}, Pay 1 life, Sacrifice Flooded Strand: Search your library for a Plains or Island card, put it onto the battlefield, then shuffle.","type":"Land","types":["Land"],"uuid":"447e9abf-79b3-5324-895d-3efe2e52a615"},{"artist":"Steven Belledin","artistIds":["f07d73b9-52a0-4fe5-858b-61f7b42174a5"],"availability":["paper"],"borderColor":"black","colorIdentity":["W"],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298074","mtgjsonV4Id":"d4cdff39-c4f1-526a-8c2e-e91d163f5ec6","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"913e0213-a9dd-4042-9002-5ff9e0e7b5dd","scryfallIllustrationId":"9caf08e2-6222-4eab-8cff-c9a82c43c61b","scryfallOracleId":"c48df45c-3513-4d56-aed6-30c2f3a759cd"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Monumental Henge","number":"222s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/fcac3d6efbe14522"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"You must already control a Plains as Monumental Henge enters the battlefield for it to enter untapped. If it enters the battlefield at the same time as a Plains when you control no other Plains, it will enter tapped."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Monumental Henge enters the battlefield tapped unless you control a Plains.\n{T}: Add {W}.\n{2}{W}{W}, {T}: Look at the top five cards of your library. You may reveal a historic card from among them and put it into your hand. Put the rest on the bottom of your library in a random order.","type":"Land","types":["Land"],"uuid":"23d60ee9-578f-5ae3-8014-e14694c5d548"},{"artist":"Chris Ostrowski","artistIds":["b5f1bd34-abee-40c9-99f7-a6ee089fb30b"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.28,"finishes":["foil"],"flavorText":"A warped gateway that seeps toxins and malevolence into the waters around Towashi.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298075","mtgjsonV4Id":"ba2f4b7d-cfd9-56bb-aac3-5cee32a1c557","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"12ecf069-25bf-484e-a92e-a46a41a86536","scryfallIllustrationId":"03eeacee-aae9-4c8e-aa8f-abfeb90d3160","scryfallOracleId":"ef86989d-ce80-4e55-aece-7d11710eeffa"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Banned","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","pioneer":"Banned","predh":"Legal","premodern":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Polluted Delta","number":"224s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/87687d3a0913bc7b"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"{T}, Pay 1 life, Sacrifice Polluted Delta: Search your library for an Island or Swamp card, put it onto the battlefield, then shuffle.","type":"Land","types":["Land"],"uuid":"9ec7833f-da09-5552-84c3-e9df418b2e92"},{"artist":"Josu Hernaiz","artistIds":["74246024-92b4-43d0-a5af-a3f9f2a35d5f"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298076","mtgjsonV4Id":"c186828a-a118-5407-9910-473797439f81","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"160444a5-e10f-4de2-b2c6-f2952490b324","scryfallIllustrationId":"0233e9fd-8db6-4630-9bee-34de49b12378","scryfallOracleId":"7c2a4fe5-43e8-4e20-bef2-0278d18afc4b"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Delirium"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Shifting Woodland","number":"228s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/f8fac7d74c9a1ed7"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Any effects that applied to Shifting Woodland before it becomes a copy of another card will continue to apply after it becomes a copy. The same is true of any counters that are on Shifting Woodland."},{"date":"2024-06-07","text":"Because Shifting Woodland isn't entering the battlefield when it becomes a copy of a card, any \"When [this creature] enters the battlefield\" or \"[This creature] enters the battlefield with\" abilities of the copied card won't apply."},{"date":"2024-06-07","text":"If a card in your graveyard has {X} in its mana cost, X is considered to be 0."},{"date":"2024-06-07","text":"Shifting Woodland copies exactly what was printed on the original card and nothing else. It doesn't copy any information about the object the card was before it was put into your graveyard."},{"date":"2024-06-07","text":"You must already control a Forest as Shifting Woodland enters the battlefield for it to enter untapped. If it enters the battlefield at the same time as a Forest when you control no other Forests, it will enter tapped."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Shifting Woodland enters the battlefield tapped unless you control a Forest.\n{T}: Add {G}.\nDelirium — {2}{G}{G}: Shifting Woodland becomes a copy of target permanent card in your graveyard until end of turn. Activate only if there are four or more card types among cards in your graveyard.","type":"Land","types":["Land"],"uuid":"0d1b5226-bd64-5d2f-ad02-db06228783b0"},{"artist":"David Álvarez","artistIds":["c3004e2c-d372-4faa-90db-f1274e75ef41"],"availability":["paper"],"borderColor":"black","colorIdentity":["B"],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298077","mtgjsonV4Id":"e5f2308c-114c-5ad4-b1d2-ad392d0a06b5","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"d978a3c6-94cd-4260-8fd4-91855cbf3129","scryfallIllustrationId":"09ed9f12-00ba-40d3-bf99-a4c46f640678","scryfallOracleId":"69ddca4b-5cc0-45f3-b2e6-a047c8d601be"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Connive"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Spymaster's Vault","number":"230s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/c2cb45d855aff1a2"},"rarity":"rare","rulings":[{"date":"2024-06-07","text":"Connive X is a variant of connive. If a creature connives X, its controller will draw X cards, discard X cards, then then put a number of +1/+1 counters on the conniving permanent equal to the number of nonland cards discarded this way."},{"date":"2024-06-07","text":"If a resolving spell or ability instructs a specific creature to connive but that creature has left the battlefield, the creature still connives, although you can't put any +1/+1 counters on it. Abilities that trigger \"when [that creature] connives\" will trigger."},{"date":"2024-06-07","text":"If no cards are discarded, most likely because that player's hand is empty and an effect says they can't draw cards, the conniving creature does not receive any +1/+1 counters."},{"date":"2024-06-07","text":"Once an ability that causes a creature to connive begins to resolve, no player may take any other actions until it's done. Notably, opponents can't try to remove the conniving creature after you discard cards but before it receives +1/+1 counters, if any."},{"date":"2024-06-07","text":"You must already control a Swamp as Spymaster's Vault enters the battlefield for it to enter untapped. If it enters the battlefield at the same time as a Swamp when you control no other Swamps, it will enter tapped."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Spymaster's Vault enters the battlefield tapped unless you control a Swamp.\n{T}: Add {B}.\n{B}, {T}: Target creature you control connives X, where X is the number of creatures that died this turn. (Draw X cards, then discard X cards. Put a +1/+1 counter on that creature for each nonland card discarded this way.)","type":"Land","types":["Land"],"uuid":"355d1fc1-ffeb-5ded-92dd-a47478e9ccba"},{"artist":"Mark Poole","artistIds":["bfdeaf09-f915-4058-8e8b-bcac3bc43c33"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298078","mtgjsonV4Id":"88217293-b29c-5f8f-a22c-f546844869aa","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"db2df285-9808-4043-9fe9-828a4bc1fe4f","scryfallIllustrationId":"fff9a9ff-f3e9-4bce-8081-a6afe1e6f820","scryfallOracleId":"d565cd3d-68d4-4039-9e45-7e69e31d0ffb"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Imprint"],"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Ugin's Labyrinth","number":"233s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/0082f83b565ece41"},"rarity":"mythic","rulings":[{"date":"2024-06-07","text":"In the rare case where more than one card is exiled with Ugin's Labyrinth's imprint ability (likely because the triggered ability was copied or the ability triggered a second time), its last ability will return all such cards to their owners' hands."}],"securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"Imprint — When Ugin's Labyrinth enters the battlefield, you may exile a colorless card with mana value 7 or greater from your hand.\n{T}: Add {C}. If a card is exiled with Ugin's Labyrinth, add {C}{C} instead.\n{T}: Return the exiled card to its owner's hand.","type":"Land","types":["Land"],"uuid":"a8035858-98ba-5cfa-a041-95bcc4cdaf7d"},{"artist":"Alexander Forssberg","artistIds":["85908891-3cc7-42b0-9b54-27ed0fe89c53"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.23,"finishes":["foil"],"flavorText":"An underground paradise, bright and thriving beneath the surface of Ixalan.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298079","mtgjsonV4Id":"27676809-2f66-578b-8af8-c5b1c30cb6d6","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"903e4a26-b49c-45af-b291-37935808295c","scryfallIllustrationId":"36e2ec10-9387-4adb-973d-c45c3f09ac0c","scryfallOracleId":"29737a60-3ebd-40d9-b935-c4f54b90d45d"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Banned","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","pioneer":"Banned","predh":"Legal","premodern":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Windswept Heath","number":"235s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/afab4f517f4d0ed6"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"{T}, Pay 1 life, Sacrifice Windswept Heath: Search your library for a Forest or Plains card, put it onto the battlefield, then shuffle.","type":"Land","types":["Land"],"uuid":"05afb711-6769-5c07-a599-8f5575f4550f"},{"artist":"Chris Ostrowski","artistIds":["b5f1bd34-abee-40c9-99f7-a6ee089fb30b"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.28,"finishes":["foil"],"flavorText":"Home and hunting ground for Kaldheim's fearsome trolls.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298080","mtgjsonV4Id":"d5f5c9b5-5eec-55fb-a02a-cf322926eddd","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"a7d96c81-cec3-40de-b4c1-c2287d1f5cb8","scryfallIllustrationId":"62282188-7ebd-4cd1-8796-1aa9c249befd","scryfallOracleId":"6587a463-a108-4854-b6d1-944e89b8c8a4"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Banned","gladiator":"Legal","historic":"Banned","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","pioneer":"Banned","predh":"Legal","premodern":"Legal","timeless":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Wooded Foothills","number":"236s","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/185d6d50d1a60e7c"},"rarity":"rare","securityStamp":"oval","setCode":"PMH3","subtypes":[],"supertypes":[],"text":"{T}, Pay 1 life, Sacrifice Wooded Foothills: Search your library for a Mountain or Forest card, put it onto the battlefield, then shuffle.","type":"Land","types":["Land"],"uuid":"217467fb-d6dc-529c-a7fb-9113dbc742a8"},{"artist":"Chris Rallis","artistIds":["a8e7b854-b15a-421a-b66d-6e68187ae285"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","W"],"colors":["W"],"convertedManaCost":2.0,"faceConvertedManaCost":2.0,"faceManaValue":2.0,"faceName":"Ajani, Nacatl Pariah","finishes":["foil"],"flavorText":"His pride denied him; his brother did not.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298081","mtgjsonV4Id":"c1038e38-25f4-51f6-ad20-0a6ae2d12b8a","scryfallId":"047f196b-a9d1-4cd3-b665-3b304cc59767","scryfallIllustrationId":"3dff950b-68c7-4b2d-a8e5-419b140d897e","scryfallOracleId":"2588f348-d7a3-46c8-9ace-dca53ed5ef99"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Transform"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Restricted","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{W}","manaValue":2.0,"name":"Ajani, Nacatl Pariah // Ajani, Nacatl Avenger","number":"237s","otherFaceIds":["41415dd4-9b6a-51bd-8b20-f063847c9c28"],"power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/4ab8a3bda1122a3d"},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"a","subtypes":["Cat","Warrior"],"supertypes":["Legendary"],"text":"When Ajani, Nacatl Pariah enters the battlefield, create a 2/1 white Cat Warrior creature token.\nWhenever one or more other Cats you control die, you may exile Ajani, then return him to the battlefield transformed under his owner's control.","toughness":"2","type":"Legendary Creature — Cat Warrior","types":["Creature"],"uuid":"66bc99a5-105e-597c-895e-fba4b05415be"},{"artist":"Chris Rallis","artistIds":["a8e7b854-b15a-421a-b66d-6e68187ae285"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","W"],"colorIndicator":["R","W"],"colors":["R","W"],"convertedManaCost":2.0,"faceConvertedManaCost":0.0,"faceManaValue":0.0,"faceName":"Ajani, Nacatl Avenger","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"mtgjsonV4Id":"37c73519-fcf4-5231-8f24-7cbebd5db899","scryfallId":"047f196b-a9d1-4cd3-b665-3b304cc59767","scryfallIllustrationId":"941b8c13-e0db-4ef8-8182-17ae977e65a7","scryfallOracleId":"2588f348-d7a3-46c8-9ace-dca53ed5ef99"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":false,"oathbreaker":true},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Restricted","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"loyalty":"3","manaValue":2.0,"name":"Ajani, Nacatl Pariah // Ajani, Nacatl Avenger","number":"237s","otherFaceIds":["66bc99a5-105e-597c-895e-fba4b05415be"],"promoTypes":["prerelease","datestamped"],"purchaseUrls":{},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"b","subtypes":["Ajani"],"supertypes":["Legendary"],"text":"[+2]: Put a +1/+1 counter on each Cat you control.\n[0]: Create a 2/1 white Cat Warrior creature token. When you do, if you control a red permanent other than Ajani, Nacatl Avenger, he deals damage equal to the number of creatures you control to any target.\n[−4]: Each opponent chooses an artifact, a creature, an enchantment and a planeswalker from among the nonland permanents they control, then sacrifices the rest.","type":"Legendary Planeswalker — Ajani","types":["Planeswalker"],"uuid":"41415dd4-9b6a-51bd-8b20-f063847c9c28"},{"artist":"Magali Villeneuve","artistIds":["9e6a55ae-be4d-4c23-a2a5-135737ffd879"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","U"],"colors":["U"],"convertedManaCost":1.0,"faceConvertedManaCost":1.0,"faceManaValue":1.0,"faceName":"Tamiyo, Inquisitive Student","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298082","mtgjsonV4Id":"a25dcd65-a596-5a58-8188-1c763a0dbacd","scryfallId":"de7f58e4-c7f8-459e-8901-fedfefc957fa","scryfallIllustrationId":"8b89f6b6-b648-41a3-b8b1-1bf2806a2d2b","scryfallOracleId":"1ed9e351-0000-4b75-8ecb-d15bd88df68a"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Flying","Investigate","Transform"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{U}","manaValue":1.0,"name":"Tamiyo, Inquisitive Student // Tamiyo, Seasoned Scholar","number":"242s","otherFaceIds":["118c3ca3-9ad6-5816-bac2-044fa73d3cd2"],"power":"0","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/f758cf3a561f45f5"},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"a","subtypes":["Moonfolk","Wizard"],"supertypes":["Legendary"],"text":"Flying\nWhenever Tamiyo, Inquisitive Student attacks, investigate. (Create a Clue token. It's an artifact with \"{2}, Sacrifice this artifact: Draw a card.\")\nWhen you draw your third card in a turn, exile Tamiyo, then return her to the battlefield transformed under her owner's control.","toughness":"3","type":"Legendary Creature — Moonfolk Wizard","types":["Creature"],"uuid":"8ee6a52e-8ba9-54ae-828d-72614dab6962"},{"artist":"Magali Villeneuve","artistIds":["9e6a55ae-be4d-4c23-a2a5-135737ffd879"],"availability":["paper"],"borderColor":"black","colorIdentity":["G","U"],"colorIndicator":["G","U"],"colors":["G","U"],"convertedManaCost":1.0,"faceConvertedManaCost":0.0,"faceManaValue":0.0,"faceName":"Tamiyo, Seasoned Scholar","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"mtgjsonV4Id":"5ab6e3ad-3ad7-53e0-af26-c68bdf2bee27","scryfallId":"de7f58e4-c7f8-459e-8901-fedfefc957fa","scryfallIllustrationId":"5b329d90-24a6-4733-878f-aa3e853e1dd5","scryfallOracleId":"1ed9e351-0000-4b75-8ecb-d15bd88df68a"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":false,"oathbreaker":true},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"loyalty":"2","manaValue":1.0,"name":"Tamiyo, Inquisitive Student // Tamiyo, Seasoned Scholar","number":"242s","otherFaceIds":["8ee6a52e-8ba9-54ae-828d-72614dab6962"],"promoTypes":["prerelease","datestamped"],"purchaseUrls":{},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"b","subtypes":["Tamiyo"],"supertypes":["Legendary"],"text":"[+2]: Until your next turn, whenever a creature attacks you or a planeswalker you control, it gets -1/-0 until end of turn.\n[−3]: Return target instant or sorcery card from your graveyard to your hand. If it's a green card, add one mana of any color.\n[−7]: Draw cards equal to half the number of cards in your library, rounded up. You get an emblem with \"You have no maximum hand size.\"","type":"Legendary Planeswalker — Tamiyo","types":["Planeswalker"],"uuid":"118c3ca3-9ad6-5816-bac2-044fa73d3cd2"},{"artist":"Matt Stewart","artistIds":["20871267-2d8a-41d5-b03a-be3d557c5734"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","W"],"colors":["B"],"convertedManaCost":2.0,"faceConvertedManaCost":2.0,"faceManaValue":2.0,"faceName":"Sorin of House Markov","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298083","mtgjsonV4Id":"5d31dd2e-cea8-541e-99c5-4a884c99a4c3","scryfallId":"42353f71-9c79-4105-a117-c12b3f4ac895","scryfallIllustrationId":"47d243ef-5482-4b70-9692-9eed3d801e8e","scryfallOracleId":"84e84532-498b-40ea-9510-46fb2403939b"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Extort","Lifelink","Transform"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{B}","manaValue":2.0,"name":"Sorin of House Markov // Sorin, Ravenous Neonate","number":"245s","otherFaceIds":["463c0928-5075-5ddd-b434-a061143c2b6c"],"power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/659ce5ea099726fe"},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"a","subtypes":["Human","Noble"],"supertypes":["Legendary"],"text":"Lifelink\nExtort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\nAt the beginning of your postcombat main phase, if you gained 3 or more life this turn, exile Sorin of House Markov, then return him to the battlefield transformed under his owner's control.","toughness":"4","type":"Legendary Creature — Human Noble","types":["Creature"],"uuid":"0c6deeb7-bd4a-5db8-8380-5545118456e9"},{"artist":"Matt Stewart","artistIds":["20871267-2d8a-41d5-b03a-be3d557c5734"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","W"],"colorIndicator":["B","W"],"colors":["B","W"],"convertedManaCost":2.0,"faceConvertedManaCost":0.0,"faceManaValue":0.0,"faceName":"Sorin, Ravenous Neonate","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"mtgjsonV4Id":"b5ed35e3-4dce-5590-a27a-59c4454361d7","scryfallId":"42353f71-9c79-4105-a117-c12b3f4ac895","scryfallIllustrationId":"97f977d0-0ffc-4da2-8c55-5cdda449d5eb","scryfallOracleId":"84e84532-498b-40ea-9510-46fb2403939b"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Extort","Food","Lifelink"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":false,"oathbreaker":true},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"loyalty":"3","manaValue":2.0,"name":"Sorin of House Markov // Sorin, Ravenous Neonate","number":"245s","otherFaceIds":["0c6deeb7-bd4a-5db8-8380-5545118456e9"],"promoTypes":["prerelease","datestamped"],"purchaseUrls":{},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"b","subtypes":["Sorin"],"supertypes":["Legendary"],"text":"Extort (Whenever you cast a spell, you may pay {W/B}. If you do, each opponent loses 1 life and you gain that much life.)\n[+2]: Create a Food token.\n[−1]: Sorin, Ravenous Neonate deals damage equal to the amount of life you gained this turn to any target.\n[−6]: Gain control of target creature. It becomes a Vampire in addition to its other types. Put a lifelink counter on it if you control a white permanent other than that creature or Sorin.","type":"Legendary Planeswalker — Sorin","types":["Planeswalker"],"uuid":"463c0928-5075-5ddd-b434-a061143c2b6c"},{"artist":"Dmitry Burmak","artistIds":["9872f5c0-274a-48ce-a9ad-6f0d5654e29c"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","U"],"colors":["R"],"convertedManaCost":2.0,"faceConvertedManaCost":2.0,"faceManaValue":2.0,"faceName":"Ral, Monsoon Mage","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298084","mtgjsonV4Id":"de9d1a3a-84cc-52ad-b216-9216759e5be5","scryfallId":"4e96867e-f127-44cc-8f48-3d32878185de","scryfallIllustrationId":"019e46ae-f886-418a-b90c-7149c0e03ae1","scryfallOracleId":"16d40f56-691b-42a7-a5ab-157568921e03"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Transform"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{1}{R}","manaValue":2.0,"name":"Ral, Monsoon Mage // Ral, Leyline Prodigy","number":"247s","otherFaceIds":["77adbb5d-2eb0-5703-a664-03d0594c8ff9"],"power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/ab235047350f1bee"},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"a","subtypes":["Human","Wizard"],"supertypes":["Legendary"],"text":"Instant and sorcery spells you cast cost {1} less to cast.\nWhenever you cast an instant or sorcery spell during your turn, flip a coin. If you lose the flip, Ral, Monsoon Mage deals 1 damage to you. If you win the flip, you may exile Ral. If you do, return him to the battlefield transformed under his owner's control.","toughness":"3","type":"Legendary Creature — Human Wizard","types":["Creature"],"uuid":"285105b0-4b78-5849-b95e-26a8b6f22ded"},{"artist":"Dmitry Burmak","artistIds":["9872f5c0-274a-48ce-a9ad-6f0d5654e29c"],"availability":["paper"],"borderColor":"black","colorIdentity":["R","U"],"colorIndicator":["R","U"],"colors":["R","U"],"convertedManaCost":2.0,"faceConvertedManaCost":0.0,"faceManaValue":0.0,"faceName":"Ral, Leyline Prodigy","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"mtgjsonV4Id":"1b10042c-932d-5d10-b0e3-8230e7a4b2c2","scryfallId":"4e96867e-f127-44cc-8f48-3d32878185de","scryfallIllustrationId":"e92d928c-0771-4868-9457-abb86072ad55","scryfallOracleId":"16d40f56-691b-42a7-a5ab-157568921e03"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":false,"oathbreaker":true},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"loyalty":"2","manaValue":2.0,"name":"Ral, Monsoon Mage // Ral, Leyline Prodigy","number":"247s","otherFaceIds":["285105b0-4b78-5849-b95e-26a8b6f22ded"],"promoTypes":["prerelease","datestamped"],"purchaseUrls":{},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"b","subtypes":["Ral"],"supertypes":["Legendary"],"text":"Ral, Leyline Prodigy enters the battlefield with an additional loyalty counter on him for each instant and sorcery spell you've cast this turn.\n[+1]: Until your next turn, instant and sorcery spells you cast cost {1} less to cast.\n[−2]: Ral deals 2 damage divided as you choose among one or two targets. Draw a card if you control a blue permanent other than Ral.\n[−8]: Exile the top eight cards of your library. You may cast instant and sorcery spells from among them this turn without paying their mana costs.","type":"Legendary Planeswalker — Ral","types":["Planeswalker"],"uuid":"77adbb5d-2eb0-5703-a664-03d0594c8ff9"},{"artist":"Chris Rahn","artistIds":["7742047e-0f80-4c0f-a530-d07460165e86"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","G"],"colors":["G"],"convertedManaCost":1.0,"faceConvertedManaCost":1.0,"faceManaValue":1.0,"faceName":"Grist, Voracious Larva","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"298085","mtgjsonV4Id":"c1020a4b-072b-5d19-98b6-066b97a3ecee","scryfallId":"60d0e035-72bf-40fb-b0fb-7bd2733e4c30","scryfallIllustrationId":"c88b33b1-15bc-40e7-9bd3-dcca0ff70c17","scryfallOracleId":"196f8f13-d4df-4740-8746-8fed3bc71840"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Deathtouch","Transform"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":true,"oathbreaker":false},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{G}","manaValue":1.0,"name":"Grist, Voracious Larva // Grist, the Plague Swarm","number":"251s","otherFaceIds":["0382f202-9f44-5a36-a30c-da508769f2ae"],"power":"1","promoTypes":["prerelease","datestamped"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/bd6a1dfcad2021bb"},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"a","subtypes":["Insect"],"supertypes":["Legendary"],"text":"Deathtouch\nWhenever Grist, Voracious Larva or another creature enters the battlefield under your control, if it entered from your graveyard or you cast it from your graveyard, you may pay {G}. If you do, exile Grist, then return it to the battlefield transformed under its owner's control.","toughness":"2","type":"Legendary Creature — Insect","types":["Creature"],"uuid":"5c832c19-1d84-50aa-9e1f-3944bc5a8af4"},{"artist":"Chris Rahn","artistIds":["7742047e-0f80-4c0f-a530-d07460165e86"],"availability":["paper"],"borderColor":"black","colorIdentity":["B","G"],"colorIndicator":["B","G"],"colors":["B","G"],"convertedManaCost":1.0,"faceConvertedManaCost":0.0,"faceManaValue":0.0,"faceName":"Grist, the Plague Swarm","finishes":["foil"],"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"identifiers":{"mtgjsonV4Id":"a9d3cd57-44db-535c-8171-bc36063a7e9c","scryfallId":"60d0e035-72bf-40fb-b0fb-7bd2733e4c30","scryfallIllustrationId":"2efadc43-1dca-4e0d-98dd-eafcf9fecf48","scryfallOracleId":"196f8f13-d4df-4740-8746-8fed3bc71840"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Deathtouch","Mill"],"language":"English","layout":"transform","leadershipSkills":{"brawl":false,"commander":false,"oathbreaker":true},"legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","timeless":"Legal","vintage":"Legal"},"loyalty":"3","manaValue":1.0,"name":"Grist, Voracious Larva // Grist, the Plague Swarm","number":"251s","otherFaceIds":["5c832c19-1d84-50aa-9e1f-3944bc5a8af4"],"promoTypes":["prerelease","datestamped"],"purchaseUrls":{},"rarity":"mythic","securityStamp":"oval","setCode":"PMH3","side":"b","subtypes":["Grist"],"supertypes":["Legendary"],"text":"[+1]: Create a 1/1 black and green Insect creature token, then mill two cards. Put a deathtouch counter on the token if a black card was milled this way.\n[−2]: Destroy target artifact or enchantment.\n[−6]: For each creature card in your graveyard, create a token that's a copy of it, except it's a 1/1 black and green Insect.","type":"Legendary Planeswalker — Grist","types":["Planeswalker"],"uuid":"0382f202-9f44-5a36-a30c-da508769f2ae"}],"code":"PMH3","isFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"MH3","languages":["English"],"name":"Modern Horizons 3 Promos","parentCode":"MH3","releaseDate":"2024-06-14","tokens":[],"totalSetSize":85,"translations":{},"type":"promo","meta":{"date":"2024-07-20","version":"5.2.2+20240720"}}
