{"baseSetSize":2,"block":"Time Spiral","cards":[{"artist":"Vance Kovacs","artistIds":["b5516011-4722-4fc8-8542-102cecc52b71"],"availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":2.0,"edhrecSaltiness":0.25,"finishes":["foil"],"flavorText":"Arc mages aren't known for their patience.","foreignData":[],"frameVersion":"2003","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"125304","cardsphereFoilId":"23911","mcmId":"17739","mtgjsonV4Id":"ca4713ac-3c94-5ebb-b9b8-ddd645fbe43e","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"9fcc7ad0-1348-44e9-9782-e9b7fd032fa4","scryfallIllustrationId":"9d4ddd99-a8e6-4edf-8aa8-8b8767860c3a","scryfallOracleId":"7b139231-dcd2-4b03-bcf2-fcb040617b69","tcgplayerProductId":"38425"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Split second"],"language":"English","layout":"normal","legalities":{"commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","penny":"Legal","predh":"Legal","vintage":"Legal"},"manaCost":"{1}{R}","manaValue":2.0,"name":"Sudden Shock","number":"179★","promoTypes":["release"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/74b426c4c573bc54","tcgplayer":"https://mtgjson.com/links/ad1f46685cb7bdb6"},"rarity":"rare","rulings":[{"date":"2021-03-19","text":"After a spell with split second resolves (or otherwise leaves the stack), players may again cast spells and activate abilities before the next object on the stack resolves."},{"date":"2021-03-19","text":"Casting a spell with split second won't affect spells and abilities that are already on the stack."},{"date":"2021-03-19","text":"If the resolution of a triggered ability involves casting a spell, that spell can't be cast if a spell with split second is on the stack."},{"date":"2021-03-19","text":"Players may turn face-down creatures face up while a spell with split second is on the stack."},{"date":"2021-03-19","text":"Players still get priority while a card with split second is on the stack; their options are just limited to mana abilities and certain special actions."},{"date":"2021-03-19","text":"Split second doesn't stop triggered abilities from triggering, such as that of Chalice of the Void. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."}],"setCode":"PTSP","subtypes":[],"supertypes":[],"text":"Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nSudden Shock deals 2 damage to any target.","type":"Instant","types":["Instant"],"uuid":"fe9fdf71-7e72-5a13-bc80-ec6e93a12325","watermark":"set"},{"artist":"Christopher Rush","artistIds":["c96773f0-346c-4f7d-9271-2d98cc5d86e1"],"availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"edhrecSaltiness":0.46,"finishes":["foil"],"foreignData":[],"frameVersion":"2003","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"121864","cardsphereFoilId":"37310","mcmId":"542806","mtgjsonV4Id":"15a8e748-1a45-5087-8e5c-2c4ea2835985","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"38869586-2d79-4b64-b5a9-a431665e1af2","scryfallIllustrationId":"31b5d531-26e6-4ab4-97e1-d047dd635ef8","scryfallOracleId":"04cf02dc-f053-414e-87d8-1537f25bcbf4","tcgplayerProductId":"38388"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Suspend"],"language":"English","layout":"normal","legalities":{"commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","predh":"Legal","vintage":"Legal"},"manaValue":0.0,"name":"Lotus Bloom","number":"259★","originalReleaseDate":"2006-09-23","promoTypes":["datestamped","prerelease"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/296817b998c978f1","tcgplayer":"https://mtgjson.com/links/e30256a0251000b2"},"rarity":"rare","rulings":[{"date":"2024-02-02","text":"A card with no mana cost can't be cast normally; you'll need a way to cast it for an alternative cost or without paying its mana cost, such as by suspending it."},{"date":"2024-02-02","text":"Cards exiled with suspend are exiled face up."},{"date":"2024-02-02","text":"Due to a recent rules change to suspend, you are no longer required to cast the suspended card as the second triggered ability of suspend resolves. Instead, as the second triggered ability resolves, you may cast the card. Timing permissions based on the card's type are ignored. If you don't cast the card, it remains exiled with no time counters on it, and it's no longer suspended."},{"date":"2024-02-02","text":"Exiling a card with suspend isn't casting that card. This action doesn't use the stack and can't be responded to."},{"date":"2024-02-02","text":"If a card with no mana cost is given an alternative cost equal to its mana cost (by Snapcaster Mage, for example), that cost cannot be paid and the card cannot be cast this way."},{"date":"2024-02-02","text":"If an effect refers to a \"suspended card,\" that means a card that (1) has suspend, (2) is in exile, and (3) has one or more time counters on it."},{"date":"2024-02-02","text":"If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."},{"date":"2024-02-02","text":"If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again at the beginning of the card's owner's next upkeep."},{"date":"2024-02-02","text":"If the second triggered ability is countered, the card can't be cast. It remains exiled with no time counters on it, and it's no longer suspended."},{"date":"2024-02-02","text":"If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it's exiled."},{"date":"2024-02-02","text":"If you cast a card \"without paying its mana cost,\" such as with suspend, you can't choose to cast it for any alternative costs. You can, however, pay additional costs. If the card has any mandatory additional costs, you must pay those if you want to cast the card."},{"date":"2024-02-02","text":"Suspend is a keyword that represents three abilities. The first is a static ability that allows you to exile the card from your hand with the specified number of time counters (the number before the dash) on it by paying its suspend cost (listed after the dash). The second is a triggered ability that removes a time counter from the suspended card at the beginning of each of your upkeeps. The third is a triggered ability that gives you the option to cast the card when the last time counter is removed."},{"date":"2024-02-02","text":"The mana value of a spell cast without paying its mana cost is determined by its mana cost, even though that cost wasn't paid."},{"date":"2024-02-02","text":"When the last time counter is removed, the second triggered ability of suspend (the one that lets you cast the card) triggers. It doesn't matter why the last time counter was removed or what effect removed it."},{"date":"2024-02-02","text":"You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effects that modify when you could cast it (such as flash) and any other effects that stop you from casting it (such as from Meddling Mage's ability) to determine if and when you can do this. Whether you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or that requires a target even if no legal targets are available at that time."}],"setCode":"PTSP","subtypes":[],"supertypes":[],"text":"Suspend 3—{0} (Rather than cast this card from your hand, pay {0} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, you may cast it without paying its mana cost.)\n{T}, Sacrifice Lotus Bloom: Add three mana of any one color.","type":"Artifact","types":["Artifact"],"uuid":"4336b2f0-c294-5064-a14c-867989983ded","watermark":"set"}],"code":"PTSP","isFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"TSP","languages":["English"],"name":"Time Spiral Promos","parentCode":"TSP","releaseDate":"2006-10-06","tokens":[],"totalSetSize":2,"translations":{},"type":"promo","meta":{"date":"2024-11-03","version":"5.2.2+20241103"}}
