{"baseSetSize":2,"block":"Time Spiral","cards":[{"artist":"Vance Kovacs","availability":["paper"],"borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":2.0,"flavorText":"Arc mages aren't known for their patience.","foreignData":[],"frameVersion":"2003","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"125304","mcmId":"17739","mtgjsonV4Id":"ca4713ac-3c94-5ebb-b9b8-ddd645fbe43e","scryfallId":"9fcc7ad0-1348-44e9-9782-e9b7fd032fa4","scryfallIllustrationId":"9d4ddd99-a8e6-4edf-8aa8-8b8767860c3a","scryfallOracleId":"7b139231-dcd2-4b03-bcf2-fcb040617b69","tcgplayerProductId":"38425"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Split second"],"layout":"normal","legalities":{"commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","penny":"Legal","vintage":"Legal"},"manaCost":"{1}{R}","name":"Sudden Shock","number":"179★","promoTypes":["release"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/74b426c4c573bc54","tcgplayer":"https://mtgjson.com/links/ad1f46685cb7bdb6"},"rarity":"rare","rulings":[{"date":"2013-06-07","text":"Players still get priority while a card with split second is on the stack."},{"date":"2013-06-07","text":"Split second doesn’t prevent players from activating mana abilities."},{"date":"2013-06-07","text":"Split second doesn’t prevent triggered abilities from triggering. If one does, its controller puts it on the stack and chooses targets for it, if any. Those abilities will resolve as normal."},{"date":"2013-06-07","text":"Split second doesn’t prevent players from performing special actions. Notably, players may turn face-down creatures face up while a spell with split second is on the stack."},{"date":"2013-06-07","text":"Casting a spell with split second won’t affect spells and abilities that are already on the stack."},{"date":"2013-06-07","text":"If the resolution of a triggered ability involves casting a spell, that spell can’t be cast if a spell with split second is on the stack."}],"setCode":"PTSP","subtypes":[],"supertypes":[],"text":"Split second (As long as this spell is on the stack, players can't cast spells or activate abilities that aren't mana abilities.)\nSudden Shock deals 2 damage to any target.","type":"Instant","types":["Instant"],"uuid":"fe9fdf71-7e72-5a13-bc80-ec6e93a12325","watermark":"set"},{"artist":"Christopher Rush","availability":["paper"],"borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":0.0,"foreignData":[],"frameVersion":"2003","hasFoil":true,"hasNonFoil":false,"identifiers":{"cardKingdomFoilId":"121864","mcmId":"17725","mtgjsonV4Id":"15a8e748-1a45-5087-8e5c-2c4ea2835985","scryfallId":"38869586-2d79-4b64-b5a9-a431665e1af2","scryfallIllustrationId":"31b5d531-26e6-4ab4-97e1-d047dd635ef8","scryfallOracleId":"04cf02dc-f053-414e-87d8-1537f25bcbf4","tcgplayerProductId":"38388"},"isPromo":true,"isReprint":true,"isStarter":true,"keywords":["Suspend"],"layout":"normal","legalities":{"commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"name":"Lotus Bloom","number":"259★","originalReleaseDate":"2006-09-23","promoTypes":["datestamped","prerelease"],"purchaseUrls":{"cardKingdomFoil":"https://mtgjson.com/links/296817b998c978f1","tcgplayer":"https://mtgjson.com/links/e30256a0251000b2"},"rarity":"rare","rulings":[{"date":"2013-06-07","text":"Exiling a card with suspend isn’t casting that card. This action doesn’t use the stack and can’t be responded to."},{"date":"2013-06-07","text":"If the spell requires any targets, those targets are chosen when the spell is finally cast, not when it’s exiled."},{"date":"2013-06-07","text":"If the first triggered ability of suspend (the one that removes time counters) is countered, no time counter is removed. The ability will trigger again during the card’s owner’s next upkeep."},{"date":"2013-06-07","text":"When the last time counter is removed, the second triggered ability of suspend will trigger. It doesn’t matter why the last time counter was removed or what effect removed it."},{"date":"2013-06-07","text":"You can exile a card in your hand using suspend any time you could cast that card. Consider its card type, any effect that affects when you could cast it (such as flash) and any other effects that could stop you from casting it (such as Meddling Mage’s effect) to determine if and when you can do this. Whether or not you could actually complete all steps in casting the card is irrelevant. For example, you can exile a card with suspend that has no mana cost or requires a target even if no legal targets are available at that time."},{"date":"2013-06-07","text":"As the second triggered ability resolves, you must cast the card if able. Timing restrictions based on the card’s type are ignored."},{"date":"2013-06-07","text":"If you can’t cast the card, perhaps because there are no legal targets available, it remains exiled with no time counters on it, and it’s no longer suspended."},{"date":"2013-06-07","text":"If the spell has any mandatory additional costs, you must pay those if able. However, if an additional cost includes a mana payment, you are forced to pay that cost only if there’s enough mana in your mana pool at the time you cast the spell. You aren’t forced to activate any mana abilities, although you may do so if you wish."},{"date":"2013-06-07","text":"A creature cast using suspend will enter the battlefield with haste. It will have haste until another player gains control of it (or, in some rare cases, gains control of the creature spell itself)."},{"date":"2013-06-07","text":"If the second triggered ability of suspend (the one that lets you cast the card) is countered, the card can’t be cast. It remains exiled with no time counters on it, and it’s no longer suspended."},{"date":"2016-09-20","text":"This has no mana cost, which means its mana cost can’t be paid for effects such as replicate from Djinn Illuminatus or flashback from Snapcaster Mage."}],"setCode":"PTSP","subtypes":[],"supertypes":[],"text":"Suspend 3—{0} (Rather than cast this card from your hand, pay {0} and exile it with three time counters on it. At the beginning of your upkeep, remove a time counter. When the last is removed, cast it without paying its mana cost.)\n{T}, Sacrifice Lotus Bloom: Add three mana of any one color.","type":"Artifact","types":["Artifact"],"uuid":"4336b2f0-c294-5064-a14c-867989983ded","watermark":"set"}],"code":"PTSP","isFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"TSP","name":"Time Spiral Promos","parentCode":"TSP","releaseDate":"2006-10-06","tokens":[],"totalSetSize":2,"translations":{},"type":"promo","meta":{"date":"2021-01-16","version":"5.0.1+20210116"}}
