{"baseSetSize":1,"cards":[{"artist":"Magali Villeneuve","artistIds":["9e6a55ae-be4d-4c23-a2a5-135737ffd879"],"availability":["paper"],"borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":6.0,"edhrecSaltiness":0.41,"finishes":["nonfoil"],"flavorText":"\"Control the Great Conduit? You might as well try to divert a river with your hands.\"","foreignData":[],"frameVersion":"1997","hasFoil":false,"hasNonFoil":true,"identifiers":{"mtgjsonV4Id":"a07dbf6c-ddd5-5d03-8816-2c6f0984c0b6","scryfallCardBackId":"0aeebaf5-8c7d-4636-9e82-8c27447861f7","scryfallId":"9542c2ea-5ac9-400a-80f8-3486695f024e","scryfallIllustrationId":"d7147662-fbd0-4a25-82fa-4cab8f2ea3fd","scryfallOracleId":"97407cd0-2bd2-4074-94d3-4ec3d243fa78"},"isPromo":true,"isReprint":true,"isStarter":true,"language":"English","layout":"normal","legalities":{"brawl":"Legal","commander":"Legal","duel":"Legal","explorer":"Legal","gladiator":"Legal","historic":"Legal","legacy":"Legal","modern":"Legal","oathbreaker":"Legal","penny":"Legal","pioneer":"Legal","timeless":"Legal","vintage":"Legal"},"manaCost":"{4}{G}{G}","manaValue":6.0,"name":"Rishkar's Expertise","number":"1","originalReleaseDate":"2025-02-21","promoTypes":["commanderparty","wizardsplaynetwork"],"purchaseUrls":{},"rarity":"rare","rulings":[{"date":"2017-02-09","text":"A card's mana value is determined solely by the mana symbols printed in its upper right corner. The mana value is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {1}{U}{U} has mana value 3. Ignore any alternative costs, additional costs, cost increases, or cost reductions that could apply to it. A card with no mana cost has a mana value of 0."},{"date":"2017-02-09","text":"Any triggered abilities that trigger while performing the Expertise spell's first effect won't be put onto the stack until after you're done casting your free spell. They're put onto the stack at the same time as any abilities that triggered while casting that spell regardless of the order in which those abilities triggered."},{"date":"2017-02-09","text":"Effects that allow you to \"cast\" a card don't allow you to play a land card."},{"date":"2017-02-09","text":"If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."},{"date":"2017-02-09","text":"If you cast a card \"without paying its mana cost,\" you can't choose to cast it for any alternative costs, such as emerge costs. You can, however, pay additional costs. If the card has any mandatory additional costs, such as that of Cathartic Reunion, you must pay those to cast the card."},{"date":"2017-02-09","text":"If you control no creatures with power greater than 0 as Rishkar's Expertise resolves, you draw no cards, but you may cast a card with mana value 5 or less from your hand without paying its mana cost."},{"date":"2017-02-09","text":"The greatest power among creatures you control is determined as Rishkar's Expertise resolves."},{"date":"2017-02-09","text":"While you're casting your free spell, the Expertise spell is still on the stack. It will be put into its owner's graveyard after the free spell is cast. The free spell can't target the Expertise card in your graveyard. It can target the Expertise spell on the stack, but the Expertise spell will become an illegal target before the free spell resolves."},{"date":"2017-02-09","text":"You may cast one of the cards drawn by Rishkar's Expertise's first effect while performing its second effect."},{"date":"2017-04-18","text":"The mana value of a split card is determined by the combined mana cost of its two halves. If an expertise spell allows you to cast a split card, you may cast either half or, if that split card has fuse, both halves."}],"setCode":"PW25","subtypes":[],"supertypes":[],"text":"Draw cards equal to the greatest power among creatures you control.\nYou may cast a spell with mana value 5 or less from your hand without paying its mana cost.","type":"Sorcery","types":["Sorcery"],"uuid":"b64a854b-a895-5a8f-8b6a-6063720c19bf"}],"code":"PW25","isFoilOnly":false,"isNonFoilOnly":true,"isOnlineOnly":false,"keyruneCode":"PMEI","languages":["English"],"name":"Wizards Play Network 2025","releaseDate":"2025-01-01","tokens":[],"totalSetSize":1,"translations":{},"type":"promo","meta":{"date":"2025-01-27","version":"5.2.2+20250127"}}
